[["to_location I want to visit New York.", "to_location New York"], ["What is the bus station that I will leave from and which station will I arrrive at?", ""], ["Sounds fine to me.", ""], ["Yep, I would like to get tickets.", ""], ["travelers I need it for two people.", ""], ["Yep, that sounds good to me.", ""], ["Thanks so much for your help.", ""], ["Nope, thanks again for helping me.", ""], ["Is there a bus that leaves from Anaheim to SD?", "to_location SD from_location Anaheim"], ["Sounds great. I would like to reserve it.", ""], ["I'm thinking of going out of town. Could you please help me find a bus?", ""], ["leaving_date I'd like to leave on 10th of March.", "leaving_date 10th of March"], ["from_location to_location I want to travel from Washington to Philly.", "to_location Philly from_location Washington"], ["What's my destination station?", ""], ["Please find out whether there are other available buses, for a group of three.", ""], ["Please let me know my departure and destination stations.", ""], ["Okay, that sounds perfect. Please make a reservation on the bus.", ""], ["I'm really grateful for your help. That will be all.", ""], ["Which station am I going from?", ""], ["That's good thanks.", ""], ["Yes please reserve them.", ""], ["travelers I need 2 please.", ""], ["No I need 3 seats.", ""], ["Yes that's good, which bus station does it go to?", ""], ["Can you help me find a bus, please?", ""], ["from_location leaving_date to_location I want to go to Fresno. I have two people in my party and I want to leave on the 12th of March, from Anaheim.", "to_location Fresno leaving_date 12th of March from_location Anaheim"], ["Are there any other bus options? I have 3 people in my party.", ""], ["At which bus station will it be arriving at? From which bus station am I leaving?", ""], ["OK, that sounds good then.", ""], ["No, I don't want those tickets. Thank you.", ""], ["I need a bus to Fresno.", "to_location Fresno"], ["Where is the departure station and where is the arrival station?", ""], ["Are there any other options available? I need 4 seats.", ""], ["Book that one for me.", ""], ["Great! Thanks.", ""], ["Not just now. That willbe all, thanks.", ""], ["Would you help me searh for a bus?", ""], ["to_location I would like to go to Vegas.", "to_location Vegas"], ["from_location I will leave from Fresno, CA.", "from_location Fresno, CA"], ["leaving_date I want to leave March 8th.", "leaving_date March 8th"], ["Which bus station will I arrive at?", ""], ["Sounds good. Please reserve it for me.", ""], ["I need to find a bus for my trip.", ""], ["What is the bus station I'd be leaving from? And what's the destination station?", ""], ["That sounds like something I'd like.", ""], ["Yes, for three people.", ""], ["Yes. What are the origin and destination stations?", ""], ["Great, that's all the help I need.", ""], ["leaving_date to_location I'm going to Sacramento, CA on the 5th of March.", "to_location Sacramento, CA leaving_date 5th of March"], ["Are there any others? I'll need 2 tickets", ""], ["Yes that would be great.", ""], ["Hey, can you help me find a bus? I want to go to LAX.", "to_location LAX"], ["Yes, it sounds good.", ""], ["Yes, buy a ticket for one, please.", ""], ["Thanks very much, that's all I need.", ""], ["leaving_date from_location Leaving from Sacramento on the 11th of March.", "leaving_date 11th of March from_location Sacramento"], ["to_location Going to SF.", "to_location SF"], ["Yes, reserve some.", ""], ["I need assistance finding a bus.", ""], ["to_location I am leaving Sacramento, CA. and heading to Anaheim, CA.", "to_location Anaheim, CA from_location Sacramento, CA"], ["Is there anything else available?", ""], ["Is there anything else available for four individuals?", ""], ["That would be great. I would like to use that bus.", ""], ["That would be great. From which station would the bus be leaving and where would it be arriving?", ""], ["No. You have been very helpful.", ""], ["Which bus stations would I leave and arrive at?", ""], ["What are some other choices?", ""], ["What are some others and it will be for 1 person.?", ""], ["I like that one I want you to reserve me a seat.", ""], ["Yes that would be wonderful.", ""], ["Thanks for your help that will be all for now.", ""], ["I need help with a travel bus?", ""], ["I want to reserve this.", ""], ["travelers Just one ticket for me.", ""], ["I need 4 tickets now.", ""], ["Yes, that is fine. What is my departure station and my arrival station?", ""], ["to_location I am planning my trip to Long Beach, CA. I like it very much.", "to_location Long Beach, CA"], ["from_location I am in Sacramento, from here I need the bus.", "from_location Sacramento"], ["From which station am I leaving?", ""], ["What is the station name where the bus will reach?", ""], ["leaving_date to_location I wanna go to Anaheim. I am planning to leave on March 5th. I am leaving from Sacramento, CA.", "to_location Anaheim leaving_date March 5th from_location Sacramento, CA"], ["What's the bus station it's leaving from?", ""], ["Sounds good to me. I want to make a reservation", ""], ["Sounds good to me. Which bus station are we reaching?", ""], ["Thanks a lot. That's everything, for now.", ""], ["Can you find me a bus.", ""], ["leaving_date I am leaving on 2nd of this month.", "leaving_date 2nd of this month"], ["to_location from_location I leaving from Fresno, CA going to LAX.", "to_location LAX from_location Fresno, CA"], ["thats great, please book this for me.", ""], ["travelers i need three tickets.", ""], ["thats correct. What bus station will i be drop off", ""], ["thanks a lot.", ""], ["no thats it.", ""], ["I want to go to San Fran - can you help me search for a bus?", "to_location San Fran"], ["leaving_date I'm leaving from Vegas, Saturday this week.", "leaving_date Saturday this week from_location Vegas"], ["Which station am I leaving from and where do I arrive?", ""], ["That sounds good, I'd like to get 4 tickets.", ""], ["No, two tickets.", ""], ["to_location I would like to go to Fresno.", "to_location Fresno"], ["leaving_date from_location I would like to leave on the 12th from Anaheim.", "leaving_date the 12th from_location Anaheim"], ["What bus station would I be leaving from?", ""], ["Do I have any other bus options?", ""], ["ok, but list another option please.", ""], ["ok, what bus station would I be leaving from?", ""], ["Sounds pretty good to me.", ""], ["Yes go ahead.", ""], ["travelers please purchase 3 tickets.", ""], ["Great. Find out what bus station i will arrive at.", ""], ["Thanks for all your help. I appreciate it.", ""], ["from_location I am departing from Las Vegas.", "from_location Las Vegas"], ["No, not right now. That is all.", ""], ["leaving_date to_location I intend on traveling to SD, starting on the 6th of March.", "to_location SD leaving_date 6th of March"], ["What bus stations will I be leaving from and arriving at, respectively?", ""], ["I don't want to buy tickets right now. I don't need anything else.", ""], ["I need to book a bus ticket, can you find me a seat?", ""], ["to_location leaving_date I'd like to get four tickets from San Fran to Sacramento, CA on the 12th of March.", "to_location Sacramento, CA leaving_date 12th of March from_location San Fran"], ["That's great, I'm done now.", ""], ["Would you help me find a bus?", ""], ["from_location Fresno, CA.", "from_location Fresno, CA"], ["No, that is all I want.", ""], ["from_location I'm leaving from SD.", "from_location SD"], ["What bus station is it leaving from and which station am I reaching?", ""], ["Can you find me a bus to Philadelphia?", "to_location Philadelphia"], ["from_location From New York City.", "from_location New York City"], ["leaving_date On the 9th of March.", "leaving_date 9th of March"], ["What are the destination and origin stations?", ""], ["Can you please help me in searching for a bus?", ""], ["from_location leaving_date to_location I would like to go to LAX. I am having plans to leave on March 6th. We are 4 people and we would like to depart from Anaheim.", "to_location LAX leaving_date March 6th from_location Anaheim"], ["Great. That's all I need at this point in time", ""], ["to_location leaving_date I am planning to leave this Sunday, going to Vegas.", "to_location Vegas leaving_date this Sunday"], ["Are there any other bus options?", ""], ["What bus station will I arrive at?", ""], ["Which bus station will I be leaving from?", ""], ["Sounds good, that will be all.", ""], ["Me and my friends are planning to take a bus. We're four in total. Can you find a bus for us?", ""], ["to_location leaving_date from_location We are going to San Diego. We're leaving from Anaheim, CA on March 3rd.", "to_location San Diego leaving_date March 3rd from_location Anaheim, CA"], ["That looks good.", ""], ["Not now, thanks. I needed only the informations about the bus.", ""], ["I need to find bus leaving next Wednesday.", "leaving_date next Wednesday"], ["from_location to_location I want to go from Sacramento to SD.", "to_location SD from_location Sacramento"], ["What are the other available buses?", ""], ["Tell me about some more buses.", ""], ["That's the one I want.", ""], ["No not right now, that's all.", ""], ["leaving_date I want it for the 10th of March for three people.", "leaving_date 10th of March"], ["from_location I'm leaving from Long Beach, CA.", "from_location Long Beach, CA"], ["to_location I need to go to LAX.", "to_location LAX"], ["Hi, i need a help, Could you search me for a bus, I need to go to Long Beach, CA.", "to_location Long Beach, CA"], ["Could you tell me the details? Which bus station am i reaching and what is the bus station i am leaving from?", ""], ["That Seems good for me, That's all i need,Thank you very much.", ""], ["to_location I'm going to Sacramento.", "to_location Sacramento"], ["What other options are there? What about trips to Long Beach, CA?", "to_location Long Beach, CA"], ["Where does it depart from?", ""], ["That sounds good. That's all I need for now, thanks.", ""], ["I plan to leave on the 8th and I need help searching for a bus.", "leaving_date the 8th"], ["from_location Long Beach, CA is where I am leaving from.", "from_location Long Beach, CA"], ["to_location It's for 2 people to go to San Francisco.", "to_location San Francisco"], ["I want to go to San Fran. Will you be able to look for a bus?", "to_location San Fran"], ["leaving_date I am thinking of leaving on 12th of March.", "leaving_date 12th of March"], ["Which is the bus station i am leaving from? and which is the bus station i am reaching?", ""], ["I want to book a bus, can you find one?", ""], ["to_location I like to visit LA.", "to_location LA"], ["Anything else you can find?", ""], ["Let me know the name of Bus station where I am leaving from?", ""], ["Thanks, that is okay for me.", ""], ["can you help me search for a bus?", ""], ["that sounds good that's all i need.", ""], ["Can you please help me find a bus?", ""], ["to_location leaving_date from_location I want to go to SD on the 5th of this month and I am leaving from LA.", "to_location SD leaving_date 5th of this month from_location LA"], ["What station is the bus leaving from? In which bus station?", ""], ["Is there any other buses available for 3 people?", ""], ["I am in Las Vegas are they any other buses available to go to Long Beach.", "to_location Long Beach from_location Las Vegas"], ["That is good.", ""], ["No thank you for the information.", ""], ["Can you assist me search for a bus?", ""], ["That's awesome. That will be all. Thank you.", ""], ["I want to go on a trip. Can you help find a bus? I want to leave on the 14th of this month.", "leaving_date 14th of this month"], ["to_location from_location I want to go to Long Beach. I am leaving from Sacramento.", "to_location Long Beach from_location Sacramento"], ["can you help me find a bus.", ""], ["from_location i am leaving from San Diego.", "from_location San Diego"], ["are there any other buses available i am plan on leaving on march 7th it is for one person.", "leaving_date march 7th"], ["are there any other buses available.", ""], ["whats the bus station i am leaving from.", ""], ["no i am good for right now that is all i need.", ""], ["Could you help me look for a bus? I would like to visit LA.", "to_location LA"], ["from_location I am exiting from San Francisco.", "from_location San Francisco"], ["leaving_date I am anticipating on leaving later today.", "leaving_date later today"], ["That sounds wonderful. That's all.", ""], ["I want to find a bus leaving on the 6th.", "leaving_date the 6th"], ["from_location I'm leaving from LAX.", "from_location LAX"], ["to_location I want to go to Anaheim.", "to_location Anaheim"], ["What's the station I'm leaving from and arriving at?", ""], ["Are there any other buses availble for one person?", ""], ["That good.", ""], ["no, I don't want to buy now.", ""], ["to_location I am going to Las Vegas. I will leave from Anaheim, CA.", "to_location Las Vegas from_location Anaheim, CA"], ["leaving_date My plans are to leave on the 13th day of the month.", "leaving_date 13th day of the month"], ["What's the bus station?", ""], ["That sound really good, like, really good.", ""], ["No. Thanks a lot for everything mate.", ""], ["Hey, can you help me find a bus for a trip I'm going? I want to leave on March 13th.", "leaving_date March 13th"], ["from_location I am leaving from SFO on the 12th. The destiny is Long Beach, CA.", "from_location SFO leaving_date the 12th destination Long Beach, CA"], ["In which bus station will I arrive? What's the bus station I'm leaving from?", ""], ["That's great for me. That's all I need.", ""], ["to_location leaving_date I want to go leave on the 14th of this month and go to SD. I need transportation for 1 person.", "to_location SD leaving_date 14th of this month"], ["That sounds good, that's all I need.", ""], ["I am planning of leaving on the 14th of this month. There are 2 of us. Can you help me find a bus?", "leaving_date 14th of this month"], ["from_location Sacramento is where i'm leaving from.", "from_location Sacramento"], ["to_location SD is where I want to go.", "to_location SD"], ["Do you know which is the bus station I am trying to reach and where is it leaving from?", ""], ["That sounds nice.", ""], ["That all I need and I don't need to buy tickets now.", ""], ["Hi, can you help me find a bus?", ""], ["That's perfect and everything I need.", ""], ["i need a bus. can you help me find one?", ""], ["to_location from_location i am going from san diego to LAX.", "to_location LAX from_location san diego"], ["leaving_date i want to leave on the 3rd of this month.", "leaving_date 3rd of this month"], ["is that the only bus available?", ""], ["that one sounds good! that is all i needed.", ""], ["I'm planning on going on a short trip with friends. Can you find me a bus?", ""], ["to_location I'm going to SFO and I have 3 people in my group.", "to_location SFO"], ["leaving_date I'll be leaving on the 8th of March.", "leaving_date 8th of March"], ["from_location I'm leaving from LA.", "from_location LA"], ["What bus station does it leave from?", ""], ["Great, that sounds perfect.", ""], ["No, that's all I needed. Thanks!", ""], ["from_location There are going to be 4 of us. We are leaving from New York City.", "from_location New York City"], ["Whats the bus station called that I'm leaving from?", ""], ["I need help to find a bus.", ""], ["from_location I'll be boarding at Long Beach.", "from_location Long Beach"], ["to_location leaving_date I need to go to San Fran today.", "to_location San Fran leaving_date today"], ["can you get me a bus.", ""], ["to_location iam going to san Francisco from long beach, CA.", "to_location san Francisco from_location long beach, CA"], ["leaving_date iam planning to go on march 2nd for 1 person.", "leaving_date march 2nd"], ["that's ok.", ""], ["no thanks.", ""], ["I am looking for a bus can you help me? I plan to leave next Thursday.", "leaving_date next Thursday"], ["from_location I will be leaving from Sacramento.", "from_location Sacramento"], ["to_location I want to go to San Fran and plan on leaving on the 13th of this month.", "to_location San Fran leaving_date 13th of this month"], ["Do you have any other buses available?", ""], ["Do you have any other buses?", ""], ["I'll take that one. Thank you.", ""], ["from_location I'm leaving from my hometown of Long Beach.", "from_location Long Beach"], ["What other bus times are available?", ""], ["That would work.", ""], ["I'm not looking to purchase tickets now but just wanted to inquire. I am done now.", ""], ["Can you find a bus for me? I want to go to Long Beach, CA.", "to_location Long Beach, CA"], ["from_location I am leaving from SD.", "from_location SD"], ["leaving_date I am planning to leave on Tuesday next week.", "leaving_date Tuesday next week"], ["What is the departing and destination bus stations?", ""], ["No. I don't want to buy tickets right now.", ""], ["No. Thanks a lot for your help.", ""], ["from_location I am from LAX.", "from_location LAX"], ["to_location I like to visit SD.", "to_location SD"], ["get me another available bus detail.", ""], ["That is convenient to me. Thanks, that's all", ""], ["Can you find me a bus to LAX?", "to_location LAX"], ["leaving_date from_location The 1st of March from San Francisco.", "leaving_date 1st of March from_location San Francisco"], ["Which stations does the bus depart from and arrive to?", ""], ["Are there any others available for 4 people?", ""], ["Any others?", ""], ["Nope, that is all I need.", ""], ["Could you help me search for a bus which is departing on Monday next week?", "leaving_date Monday next week"], ["to_location I would like to visit Long Beach, CA.", "to_location Long Beach, CA"], ["from_location I will be leaving from San Francisco.", "from_location San Francisco"], ["That sounds great, and that's all the help I need.", ""], ["I want to book a bus ticket. Can you help me find a Bus service", ""], ["from_location i want to book bus from Las Vegas.", "from_location Las Vegas"], ["leaving_date I am planning to leave Next monday.", "leaving_date Next monday"], ["to_location i will be going to Anaheim, CA. please book for 1 person.", "to_location Anaheim, CA"], ["NO. Thanks so much for your help", ""], ["to_location from_location I'm going to LA from Las Vegas. I need two tickets.", "to_location LA from_location Las Vegas"], ["leaving_date On March 3rd.", "leaving_date March 3rd"], ["Please find me a bus.", ""], ["From what station will I depart?", ""], ["At what station will I arrive?", ""], ["Please show me other options. I want 2 tickets.", ""], ["Please show me another route. I want to travel from Las Vegas to Fresno.", "to_location Fresno from_location Las Vegas"], ["I would like to book that trip.", ""], ["Can you please help me search for a bus?", ""], ["Which bus station am I going to?", ""], ["Are there any other buses available? I need one for 3 people.", ""], ["Are there any other buses available that are going to Los Angeles?", "to_location Los Angeles"], ["Which station am I leaving from and which station am I arriving at?", ""], ["That sounds good, that is all I need.", ""], ["Can you tell me what the departure station is and what the arrival station is?", ""], ["Okay, I like that. I want to book 2 people for the bus.", ""], ["Yeah, that's what I want.", ""], ["Okay, thanks a lot. That's all the help I need.", ""], ["leaving_date I am planning to leave on March 3rd.", "leaving_date March 3rd"], ["Are there any other buses available? It is for 1 person.", ""], ["Which bus station am I heading to?", ""], ["What's the bus station I am leaving from?", ""], ["Yes I would like to reserve tickets.", ""], ["Yes that works great for me.", ""], ["Thank you so much for the help.", ""], ["No, that will be all. Thank you again for your assistance.", ""], ["I need a bus for one please.", ""], ["from_location leaving_date to_location I want to leave on the 13th of this month from San Diego to Sacramento, CA.", "to_location Sacramento, CA leaving_date 13th of this month from_location San Diego"], ["Which station will I be arriving to?", ""], ["I want to make a reservation for the bus.", ""], ["Nope, that will be all.", ""], ["I'm looking for a bus from Sacramento, CA to San Diego.", "to_location San Diego from_location Sacramento, CA"], ["leaving_date I want to leave on next Wednesday.", "leaving_date next Wednesday"], ["Are there other buses available for 3 people?", ""], ["What is the departure station? What is the arrival station?", ""], ["to_location leaving_date I'm going to SFO on March 14th.", "to_location SFO leaving_date March 14th"], ["That's perfect. I'd like to reserve one ticket, please.", ""], ["Great. Thank you for your assistance. That's everything.", ""], ["I would like to get a bus to travel.", ""], ["to_location I am going to Seattle, WA.", "to_location Seattle, WA"], ["from_location I am travelling from Portland, OR.", "from_location Portland, OR"], ["Which station does the bus depart from and which station does it arrive at?", ""], ["That is just what I need. Can you reserve me a ticket?", ""], ["travelers Two tickets please.", ""], ["No actually it is only for 1 person.", ""], ["Yes that is it.", ""], ["to_location There will be two of us traveling from San Fran to Sacramento, CA.", "to_location Sacramento, CA from_location San Fran"], ["Ummm, are there any other buses available? That might be a little early for us.", ""], ["Yes, that will work. Will you please reserve the bus for us?", ""], ["No, that's all I needed. Thanks again.", ""], ["Can you find me a bus leaving on March 14th?", "leaving_date March 14th"], ["to_location from_location I am leaving from Fresno amd going to Las Vegas.", "to_location Las Vegas from_location Fresno"], ["Are there any other buses available? I need one ticket.", ""], ["What is the destination station?", ""], ["Which station does it leave from?", ""], ["That sounds good. I want to reserve the bus.", ""], ["Will you help me find a bus?", ""], ["What are the origin and destination stations?", ""], ["travelers 4 tickets.", ""], ["from_location I have a party of 2, and we are leaving from Sacramento, CA.", "from_location Sacramento, CA"], ["to_location San Diego, please.", "to_location San Diego"], ["leaving_date I'd like to leave on the 11th of this month.", "leaving_date 11th of this month"], ["Are they other options?", ""], ["Which bus station will it go to?", ""], ["Yes, that sounds good. What bus station am I departing from?", ""], ["leaving_date from_location to_location I want to go to Fresno, CA. I am planning to leave on today. I am leaving from SFO.", "to_location Fresno, CA leaving_date today from_location SFO"], ["Are there any other buses available? It is for three people.", ""], ["What's the bus station I am leaving from? Which bus station am I reaching?", ""], ["Are there any buses available?", ""], ["No, I don't want to buy tickets now. That's all I need.", ""], ["Please help me to find a bus.", ""], ["leaving_date to_location from_location I'm traveling from Fresno, CA to San Francisco on the 14th of this month.", "to_location San Francisco from_location Fresno, CA leaving_date 14th of this month"], ["Are any other buses available?", ""], ["I need 3 tickets on that bus.", ""], ["That's right. What's my departure bus station and arrival bus station?", ""], ["No. Thank you. That's all I need for now.", ""], ["leaving_date I want to leave in the 5th of this month.", "leaving_date 5th of this month"], ["from_location to_location I need a ticket from Fresno to Long Beach, CA.", "to_location Long Beach, CA from_location Fresno"], ["travelers I need three tickets.", ""], ["No, change that to 2 tickets.", ""], ["Please help me search for a bus.", ""], ["leaving_date I am leaving March 9th.", "leaving_date March 9th"], ["That will work, reserve please.", ""], ["travelers For two people.", ""], ["Yes, that is correct. What station am I leaving from?", ""], ["I'd like to find a bus?", ""], ["to_location from_location I'd like to go from Las Vegas to San Francisco.", "to_location San Francisco from_location Las Vegas"], ["leaving_date The 14th of March, please.", "leaving_date 14th of March"], ["Are there other options? I'd like to go from Sacramento, CA to Long Beach.", "to_location Long Beach from_location Sacramento, CA"], ["travelers Four, please.", ""], ["Thanks, that's all I needed.", ""], ["to_location I would like to go to Fresno, CA.", "to_location Fresno, CA"], ["I don't know. Are there any other buses available on that day?", ""], ["Which bus station would I be departing from and arriving at?", ""], ["Check for more buses please.", ""], ["Yes, please reserve this one.", ""], ["Perfect. Please book this.", ""], ["Thanks. That will be all.", ""], ["Hey there, can you get me a bus to San Diego?", "to_location San Diego"], ["Which bus station does it arrive at?", ""], ["Is there anything else? I need three tickets.", ""], ["That will be great. Please book the tickets.", ""], ["Thanks so much. That's all.", ""], ["I am looking for a bus. I want to go to San Diego", "to_location San Diego"], ["WHat bus station will I be leaving from.", ""], ["What bus station will I be arriving at?", ""], ["That sounds excellent. I will reserve that bus.", ""], ["I need to find a bus. Can you assist me with that?", ""], ["to_location I'd like to go to Fresno, CA.", "to_location Fresno, CA"], ["leaving_date I'd like to leave on the 4th of this month.", "leaving_date 4th of this month"], ["from_location I'll be departing from San Diego.", "from_location San Diego"], ["Can you tell me where that arrives?", ""], ["Where would I be leaving from?", ""], ["Yes, I'd like to buy them.", ""], ["travelers I'll need four tickets.", ""], ["I'm sorry, can you make that two tickets?", ""], ["No, I think that's everything. Thank you again.", ""], ["Can you search a bus for me to San Diego?", "to_location San Diego"], ["leaving_date My departure date will is 13th of March and there are 2 people in my group.", "leaving_date 13th of March"], ["Okay. That sounds great.", ""], ["No. That will be all. Thank you!", ""], ["I would like a bus to go to LA.", "to_location LA"], ["travelers There would be four people traveling.", ""], ["That would be fine.", ""], ["Which bus stations would the bus be leaving from and arriving at?", ""], ["No, you have been very helpful.", ""], ["leaving_date I plan on leaving on March 9th.", "leaving_date March 9th"], ["from_location I'd like to visit Portland, OR.", "from_location Portland, OR"], ["Excellent.", ""], ["Yes. I'd like four tickets, please.", ""], ["I need to find a bus, can you help?", ""], ["leaving_date Leaving on March 11th.", "leaving_date March 11th"], ["from_location to_location Going to Fresno, leaving from Vegas.", "to_location Fresno from_location Vegas"], ["Alright, that works. Can you reserve for 3 people?", ""], ["No actually I just need 1 ticket.", ""], ["No, that was all.", ""], ["What else do you have available?", ""], ["Leaving from what bus station?", ""], ["What bus station does it go to?", ""], ["I like that one.", ""], ["I'm all set.", ""], ["Please help me in searching a bus.", ""], ["to_location I wish to go to LA.", "to_location LA"], ["leaving_date I will be leaving on March 14th.", "leaving_date March 14th"], ["It is good for me.", ""], ["Yes. Please go ahead. It is for one person.", ""], ["Nope. I need it for 3 persons.", ""], ["Thanks. That is what I want.", ""], ["I need a bus leaving on 1st of this month.", "leaving_date 1st of this month"], ["from_location to_location I am leaving Sacramento, CA and going to San Diego.", "to_location San Diego from_location Sacramento, CA"], ["I want to reserve the bus.", ""], ["Good. What is the station I am leaving from and arriving at?", ""], ["I need to find a bus and I only need 1 seat.", ""], ["from_location My boyfriend decided to go so I will need 2 seats and we are leaving Las Vegas.", "from_location Las Vegas"], ["to_location I thought LA might be interesting.", "to_location LA"], ["leaving_date I really need to go on the 7th.", "leaving_date the 7th"], ["Could you check and see if there are any other options available?", ""], ["Can you find another?", ""], ["Which station would I end up at?", ""], ["That's the one I was looking for. I want you to make reservations for me.", ""], ["You helped me out a lot, thank you.", ""], ["No you got it all thanks again.", ""], ["leaving_date to_location from_location I'll be travelling from Seattle, WA to Portland on the 2nd.", "to_location Portland from_location Seattle, WA leaving_date the 2nd"], ["Can you please tell me my destination station?", ""], ["Would you please find me a bus?", ""], ["What bus station do I arrive at?", ""], ["That sounds good. I'd like to reserve teh bus.", ""], ["I need a bus ride, can you help me find one?", ""], ["Can you suggest me more of them? We're traveling in four.", ""], ["show me more options.", ""], ["Thank you, you've been of a great help.", ""], ["Are thre any other buses available for 2 people?", ""], ["What bus station am I going to?", ""], ["Okay. That sounds good.", ""], ["No, I don't want to buy the tickets now. That's all the information I need.", ""], ["from_location I will be leaving LAX and there are three people in my party.", "from_location LAX"], ["leaving_date Our trip is leaving on the 1st of March.", "leaving_date 1st of March"], ["to_location We will be traveling to San Fran.", "to_location San Fran"], ["Can you tell me which stations I will be departing from and arriving at?", ""], ["Yes, I'd like to purchase them now.", ""], ["Great! I appreciate the assistance. That's all I need for today.", ""], ["I need to find a bus to San Francisco on the 9th of March.", "to_location San Francisco leaving_date 9th of March"], ["Can you search for a bus to Vancouver.", "to_location Vancouver"], ["leaving_date I am leaving from Portland on March 13th.", "leaving_date March 13th from_location Portland"], ["travelers Three tickets needed.", ""], ["Yes that is perfect. What is the bus station origin and destination?", ""], ["There is one meeting for me, can you find a bus?", ""], ["Any other available, it is for one person.", ""], ["Great, I think it is better to reserve one seat in that bus.", ""], ["Thats right. Thank you.", ""], ["No, that much, thank you.", ""], ["What bus station will I be dropped off at.", ""], ["Sounds great! Please reserve that bus for me.", ""], ["Yes, that is corrects.", ""], ["leaving_date to_location I want to go to SFO on March 9th.", "to_location SFO leaving_date March 9th"], ["No, actually its 4 people.", ""], ["Yes, that works. What is the station I'm leaving from and arriving at?", ""], ["Im looking for a bus can you help me?", ""], ["leaving_date Im planning to leave on the 13th from Anaheim, CA.", "leaving_date the 13th from_location Anaheim, CA"], ["Is there any other buses available?", ""], ["Is there any other buses?", ""], ["Thats great for me. I want to book the bus for 1 people.", ""], ["Yes thats perfect for me. Which is the bus station am I reaching? from what the bus station im leaving?", ""], ["Thanks a lot for the help. Thats all for now.", ""], ["I need you to find me a bus.", ""], ["to_location leaving_date I'm going to Sacramento, CA on the 9th of this month.", "to_location Sacramento, CA leaving_date 9th of this month"], ["from_location I will get on in San Diego.", "from_location San Diego"], ["Which station am I leaving from.", ""], ["So, what are the starting and ending bus stations?", ""], ["OK. book me for that one.", ""], ["Thank you. That's it.", ""], ["leaving_date from_location to_location I'm heading to Seattle from Vancouver and I'd like to leave on the 3rd of March.", "to_location Seattle leaving_date 3rd of March from_location Vancouver"], ["OK, I'd like to reserve that one.", ""], ["travelers I'd like 4 tickets.", ""], ["Excellent, I'm all set.", ""], ["Please help me find a bus.", ""], ["leaving_date I'll be leaving on the 9th of this month.", "leaving_date 9th of this month"], ["Thank you for the help. That's all I need for now.", ""], ["Could you help me search for a bus for my upcoming trip? I plan on leaving on the 13th of this month.", "leaving_date 13th of this month"], ["to_location from_location I am leaving from Anaheim, CA and will be going to Sacramento.", "to_location Sacramento from_location Anaheim, CA"], ["Are there any others available?", ""], ["That wil not work. Are there any others that have enough seats for three people?", ""], ["Ok, that sounds great.", ""], ["Not at this time. Thank you!", ""], ["I am in need of having a bus and I would like for it to be for 2 people.", ""], ["to_location I would like to visit Fresno, Ca.", "to_location Fresno, Ca"], ["That seems as what I needed. I would like to make the reservation.", ""], ["Yes that's what I need and will be right for me.", ""], ["I appreciate your help very much. That would be all.", ""], ["to_location I'd like to visit LA.", "to_location LA"], ["Do you have any other buses ready?", ""], ["Do you have any other buses ready for 1 person?", ""], ["What bus station am I traveling to, and what station will I depart from?", ""], ["That sounds lovely. I'd like to book the bus.", ""], ["Yup, that's perfect for me.", ""], ["I am going on vacation, could you help me find a bus?", ""], ["to_location I am leaving for SF on the 13th of this month.", "to_location SF leaving_date 13th of this month"], ["That sounds great, I would like to reserve that bus.", ""], ["Yes, that will be great.", ""], ["Thank you for your help, have a nice day.", ""], ["to_location from_location I am leaving from San Diego and traveling to Fresno.", "to_location Fresno from_location San Diego"], ["Okay, that sounds awesome.", ""], ["No, I am not interested in making the purchase right now.", ""], ["I need a bus for three people.", ""], ["to_location To San Fran.", "to_location San Fran"], ["Great thank you.", ""], ["Yes, all good.", ""], ["Can you search for a bus for me?", ""], ["leaving_date I will leave on the 14th of March.", "leaving_date 14th of March"], ["to_location from_location I would like to go to SF and will be leaving from Fresno.", "to_location SF from_location Fresno"], ["Sounds good to me, I would like to reserve this bus.", ""], ["travelers For 3 people please.", ""], ["Yes, that seems good to me.", ""], ["What is the bus station I will be leaving from and which bus station am I reaching?", ""], ["Thank you very much. That is all I need.", ""], ["I would like to find a bus for a trip leaving on the 2nd.", "leaving_date the 2nd"], ["to_location I will be traveling to Las Vegas.", "to_location Las Vegas"], ["There will be 2 people traveling. What are my other bus choices?", ""], ["That one works for me.", ""], ["What are the name of the bus stations?", ""], ["I need help searching for a bus.", ""], ["from_location I'm going to leave from San Fran.", "from_location San Fran"], ["Okay I need to know which bus station I'm leaving from and arriving at.", ""], ["Okay, that sounds good. I'd like to reserve tickets for that bus.", ""], ["Thanks for your help! That is all I needed today.", ""], ["I need a bus for four people.", ""], ["leaving_date I'd like to leave on March 11th.", "leaving_date March 11th"], ["Was there any other buses available? I'd like to leave on Saturday this week.", "leaving_date Saturday this week"], ["What's the name of the station I'm leaving from?", ""], ["Is there any other bus available?", ""], ["My friend and I are leaving from Sacramento for a vacation. Would you be able to help me search for a bus ticket for the two of us?", "leaving_city Sacramento"], ["leaving_date to_location I'm planning to leave on March 13th and we would like to arrive in Vegas.", "to_location Vegas leaving_date March 13th"], ["Perfect. I would like to reserve the tickets for that bus.", ""], ["to_location leaving_date I'm leaving next Wednesday for Sacramento.", "to_location Sacramento leaving_date next Wednesday"], ["What station does it leave from and which station does it arrive at?", ""], ["Are there other buses available?", ""], ["No, I do not want to buy a ticket now.", ""], ["leaving_date Tuesday next week from LA.", "leaving_date Tuesday next week from_location LA"], ["Thanks a lot. That will be all.", ""], ["Could you please help me find a bus to San Francisco on the 12th?", "to_location San Francisco leaving_date the 12th"], ["What are my departure and destination bus stations?", ""], ["I like that. Please reserve the bus.", ""], ["Thank you, you've been very helpful. That will be all.", ""], ["Help me find a bus that is leaving on this Saturday.", "leaving_date this Saturday"], ["to_location from_location I want to go from Long Beach, CA to Fresno, CA.", "to_location Fresno, CA from_location Long Beach, CA"], ["That is what I want.", ""], ["I need to reserve that bus for three people.", ""], ["Yes but I need to know what station it is leaving from.", ""], ["Not at this time thank you.", ""], ["Can you please look for a bus from Anaheim to San Francisco?", "to_location San Francisco from_location Anaheim"], ["leaving_date I wan leave on 12th of this month.", "leaving_date 12th of this month"], ["I want to reserve a seat in that.", ""], ["Yes.Please confirm the same.", ""], ["No, Thanks.", ""], ["I need to find a bus please.", ""], ["from_location From Anaheim for one person.", "from_location Anaheim"], ["leaving_date On the 4th of this month and I'm going to Las Vegas.", "leaving_date 4th of this month destination Las Vegas"], ["What bus stations connect it?", ""], ["I'd like to make a reservation for that one.", ""], ["Thank you for that. I'm all set.", ""], ["to_location I'll be travelling to San Diego.", "to_location San Diego"], ["Can you tell which station the bus will be going to?", ""], ["And which station is the bus departing from?", ""], ["No, don't buy the tickets just yet.", ""], ["No, thanks so much for helping me.", ""], ["I'm traveling on the 4th of March leaving Portland, OR and need help finding a bus.", "leaving_date 4th of March from_location Portland, OR"], ["to_location I'll be gong to Portland, OR and leaving from Seattle.", "to_location Portland, OR from_location Seattle"], ["That sounds good. Let's reserve it.", ""], ["No. Change that to two people.", ""], ["Yes. That will be good.", ""], ["No. That will be all. Thanks.", ""], ["I need assistance to locate a bus.", ""], ["leaving_date It's for 3 people leaving on the 9th of this month from Las Vegas.", "leaving_date 9th of this month from_location Las Vegas"], ["to_location Anaheim leaving on the 10th of this month.", "to_location Anaheim leaving_date 10th of this month"], ["Yes please. I need them", ""], ["Correct, that's it.", ""], ["Thank you so much, that's all.", ""], ["Can you locate a bus for me? We have three people in our group.", ""], ["Whats the name of the bus station im leaving from?", ""], ["That sounds graet.", ""], ["Please reserve the bus for me.", ""], ["Can you find me a bus? I will leave from Sacramento.", "leaving_city Sacramento"], ["leaving_date to_location I would like to go to San Fran. I will leave Thursday next week.", "to_location San Fran leaving_date Thursday next week"], ["That sounds great. I want to buy tickets for this bus.", ""], ["Yes that's correct. What bus station does it arrive at? What bus station will I leave from?", ""], ["I need to find a bus from Seattle.", "to_location Seattle"], ["leaving_date to_location I am going to Portland, OR on the 3rd of this month. There will be four of us.", "to_location Portland, OR leaving_date 3rd of this month"], ["What about other buses on the 8th of March?", "date 8th of March"], ["Which bus station does that bus leave from? What is the destination station?", ""], ["What bus station will I be departing from and which station am I reaching?", ""], ["That sounds perfect, I'd like to reserve a seat.", ""], ["Yes that works great.", ""], ["Hi! I'm looking for a bus going to Philly.", "to_location Philly"], ["Are there other buses for two people?", ""], ["What bus station does it leave from and arrive to?", ""], ["OK. That's good.", ""], ["Yes. That will work.", ""], ["No. That will be it.", ""], ["to_location leaving_date I am going to Washington and want to leave on the 12th of March.", "to_location Washington leaving_date 12th of March"], ["What bus station am I departing from?", ""], ["Sound great. I would like to reserve the trip.", ""], ["Yes, that's fine.", ""], ["Thank you for your assistance?", ""], ["Can you help me find bus schedules?", ""], ["Thanks very much for your help.", ""], ["Which bus station am I arriving to and what station and I departing from?", ""], ["travelers It's for four people.", ""], ["Thanks a lot for your help! That's all I need.", ""], ["to_location leaving_date I want a bus for one person that goes to Las Vegas on March 13th.", "to_location Las Vegas leaving_date March 13th"], ["Which bus station does it leave from?", ""], ["Okay, book this one.", ""], ["sounds good. Which is the destination station?", ""], ["Thanks, thats all I need for now.", ""], ["Hi, Can you help me to find a bus?", ""], ["what are my other options.", ""], ["yes, i want to reserve tickets for 4 people.", ""], ["yep, that's good.", ""], ["thank you so much.", ""], ["no, that's all. thanks again.", ""], ["Could you help me find a bus to SD?", "to_location SD"], ["Sounds good, could you reserve me some tickets?", ""], ["travelers Just 1.", ""], ["What bus station will I be going to?", ""], ["What other buses are usable? Keep in mind my trip involves 2 people.", ""], ["That all works for me. What station will I be arriving at?", ""], ["Not right now. Glad you were able to offer your help.", ""], ["Where can I get a bus to Seattle, WA?", "to_location Seattle, WA"], ["leaving_date I will be leaving on the 8th.", "leaving_date the 8th"], ["What bus station will I be leaving from and going to?", ""], ["That will work great for me.", ""], ["Are there other available for 10th of march. there will be 4 passengers.", "date 10th of march"], ["I would like to reserve this bus.", ""], ["Yes that works. Which bus station am I reaching?", ""], ["Can you find me a bus that goes to SF?", "to_location SF"], ["That will work. Make a reservation.", ""], ["travelers There is only 1 person going.", ""], ["Yes, that is right.", ""], ["What bus station am I leaving from and going to?", ""], ["Thank a bunch.", ""], ["Can you help me look for a bus?", ""], ["What bus station am I leaving from and where is it going?", ""], ["Yes. 1 Ticket.", ""], ["Sorry, no. It's for two people.", ""], ["leaving_date to_location I want to leave today to Vancouver.", "to_location Vancouver leaving_date today"], ["from_location I'll be heading out of Portland, OR. Also, I need tickets for 4 people.", "from_location Portland, OR"], ["What bus station is it leaving from and going to?", ""], ["Yes, go ahead.", ""], ["Great, thanks for your help. That's all.", ""], ["What bus station will it depart from and arrive at?", ""], ["Yes please, I'd like that.", ""], ["Thanks so much, that'll be all.", ""], ["to_location leaving_date I am planning to leave on the 3rd of March for Sacramento, CA.", "to_location Sacramento, CA leaving_date 3rd of March"], ["That bus sounds good, I want to reserve it.", ""], ["That will work for me. Which bus station is this and which station am I leaving from?", ""], ["Thank you so much for your help. That will be all I will be needing.", ""], ["from_location to_location We're going to Anaheim, CA, and leaving from SD.", "to_location Anaheim, CA from_location SD"], ["leaving_date I'm leaving next Friday.", "leaving_date next Friday"], ["Are there other buses?", ""], ["Which station does this bus go to?", ""], ["That's great. I want to reserve the tickets.", ""], ["I want to go to Chicago. Can you find me a bus there?", "to_location Chicago"], ["from_location I want to leave from LAX.", "from_location LAX"], ["Perfect! I need to reserve three tickets please.", ""], ["No, I meant for 4 people.", ""], ["Yes that works for me.", ""], ["leaving_date I'm planning on leaving on the 6th of March, and I'd like the destination to be Sacramento, CA.", "leaving_date 6th of March destination Sacramento, CA"], ["From what station will the bus leave?", ""], ["Are there any other buses available that leave on the 5th of this month?", "leaving_date 5th of this month"], ["That sounds like the one. Please reserve me a two tickets.", ""], ["Yes, I confirm. What will be the departure station?", ""], ["Awesome. Thank you very much, that will be all I need.", ""], ["from_location to_location I am leaving from Los Angeles to Fresno, Ca.", "to_location Fresno, Ca from_location Los Angeles"], ["leaving_date I am heading out on the 2nd of March.", "leaving_date 2nd of March"], ["Are their any other buses available, this will be for a total of four people.", ""], ["What station will it be heading to?", ""], ["Sounds good, go ahead and make a reservation for me.", ""], ["Great, works for me.", ""], ["Thanks for the help, that will be all for today.", ""], ["Could you find me a bus?", ""], ["Yes, for one person.", ""], ["That sounds good. What bus station will I leave from and which bus station do I get off?", ""], ["That's all that I needed.", ""], ["Could you assist me in finding a bus?", ""], ["Yes this is fine.", ""], ["May I know the bus station I am departing from and arriving at?", ""], ["Thank you, that's all the help I need.", ""], ["What bus terminal do I leave from?", ""], ["Thanks so much for your assistance.", ""], ["No. Thats all. Thanks for your help.", ""], ["Can you please help me look for a bus?", ""], ["What would be the name of the bus station once I arrive?", ""], ["No, I just wanted to gather some information, thanks for your help.", ""], ["Hello, I have some friends visiting and am wondering if there are any interesting events to take them to.", ""], ["category city_of_event Oh yes, I am looking for events in San Francisco. A concert would probably be good, but I'm not set on that for sure.", "city_of_event San Francisco"], ["Ok, that sounds like it will work. That's all I need right now.", ""], ["Can you help me look for events to go to?", ""], ["That sounds interesting, what's the address?", ""], ["Could you assist me in searching for interesting activities?", ""], ["city_of_event category I'm searching for activities near Oakland. I enjoy Games activities.", "city_of_event Oakland"], ["No, maybe later. That's all.", ""], ["Could you find me some cool events?", ""], ["city_of_event NY.", "city_of_event NY"], ["What's the address of the event.", ""], ["I'd like to know more about the event.", ""], ["That sounds cool. Thanks for this.", ""], ["Hello, can you help me find some interesting events?", ""], ["city_of_event Yes, I would like to know if there are events around Berkeley, I am particularly interested in Concert events. Thank you.", "city_of_event Berkeley"], ["Excuse me, what is the address of the event?", ""], ["Thank you very much. Can you give me more details about this event?", ""], ["No. Thank you, you were very helpful.", ""], ["I am looking for some events to go to on Wednesday next week. I want to have fun!", "date Wednesday next week"], ["category I think a concert would be cool.", ""], ["That sounds awesome.", ""], ["No not now, that's all I needed at the moment.", ""], ["I would like enjoy some games.Are there any such event?", ""], ["city_of_event Yes, I prefer one in Seattle.", "city_of_event Seattle"], ["Shall I get details?", ""], ["Let me know about the venue.", ""], ["Good, I think that will do.", ""], ["No. Not needed, thank you.", ""], ["Can you help me find interesting events on the 13th of this month?", "date 13th of this month"], ["city_of_event Anaheim, CA.", "city_of_event Anaheim, CA"], ["category I like Match events?", ""], ["What's the venue address, and can you tell me more about this event?", ""], ["I want to find some cool events.", ""], ["city_of_event I want to find events in Livermore.", "city_of_event Livermore"], ["category I want to find a concert.", ""], ["No, now right now.", ""], ["I'm looking to go to a football match.", ""], ["That sounds really fun.", ""], ["No not now. Thanks for finding that.", ""], ["category city_of_event I'd like a games related event around Phoenix, please.", "city_of_event Phoenix"], ["What's the address, and what kind of event is it?", ""], ["I want to find interesting events around New York City.", "city_of_event New York City"], ["category I like concert events.", ""], ["Those sound good, but I want something on the 6th of march, and I also like match events.", "date 6th of march"], ["Nope, that's all I need.", ""], ["city_of_event I'd like to find something around SD.", "city_of_event SD"], ["Find interesting events happening around Seattle, WA please.", "city_of_event Seattle, WA"], ["category Find sports events please.", ""], ["That sounds really good.", ""], ["Nope. That's it.", ""], ["I am looking for some interesting events?", ""], ["category Search for some Music events.", ""], ["city_of_event Search the event around Portland.", "city_of_event Portland"], ["Find me some more information about the event?", ""], ["Okay. That sounds good to me. That will be all.", ""], ["I'm looking for some events to go to.", ""], ["category city_of_event I like music, something around Philly.", "city_of_event Philly"], ["Great, that's all for now.", ""], ["Hi i need a help, i am Interested in events, Could you find some events for me?", ""], ["city_of_event category i like Music events around in New York city.", "city_of_event New York city"], ["Yes, i am interested, tell me more about this event, What is the address of the venue?", ""], ["OK, Could you find another events for me?", ""], ["Ok, But, find me another event for me, I want some thing on tomorrow.", "date tomorrow"], ["Yes, It seems good for me, That's all i need, thank you very much for your help.", ""], ["category Music, please.", ""], ["Cool. Any other events?", ""], ["What's the address of that one?", ""], ["Can you find me an event I can go to?", ""], ["category city_of_event How about a concert around NYC?", "city_of_event NYC"], ["I want to have some fun so I need you to help me find some interesting events. I usually enjoy the Sports events and I am looking for events that take place in Phoenix, AZ.", "city_of_event Phoenix, AZ"], ["Can you give me the address where I can find the event?", ""], ["That seems as what I would enjoy.", ""], ["No at the moment. That would be all.", ""], ["I'm looking for something interesting to do.", ""], ["city_of_event I'm looking for events in or around NYC.", "city_of_event NYC"], ["category How about a Rock Concert?", ""], ["Can you find me some other events? Any type is fine.", ""], ["No, not right now. That's all I need. Thank you.", ""], ["I've got some friends visiting from out of town this week and I need somewhere to take them. Can you help me find some interesting events going on?", ""], ["category city_of_event I'd like to hear about Music events that are happening around New York City.", "city_of_event New York City"], ["No, that's all. Thanks for your help.", ""], ["I'm interested in attending events, especially Games. Can you find me some options?", ""], ["That's ideal.", ""], ["No, let me think about it.", ""], ["Would you look for some fun events?", ""], ["city_of_event category I want to find events around NYC, like concert events.", "city_of_event NYC"], ["That sounds perfect. That's all for now.", ""], ["Hi, I need something fun to do. Can you look for events in Phoenix, AZ?", "city_of_event Phoenix, AZ"], ["category I'd like to go to a concert.", ""], ["That sounds fun. That's all I needed.", ""], ["I'm looking for something to do, like attending an event, help me out?", ""], ["city_of_event Search in San Jose for an event.", "city_of_event San Jose"], ["Okay, cool, sounds awesome. That's it for now.", ""], ["Can you find some interesting concert events?", ""], ["No, I'm good for now.", ""], ["I'm looking for interesting events to go to.", ""], ["category city_of_event I like Sports, and want to find one in NYC.", "city_of_event NYC"], ["I am in Toronto and I would like to find events to participate to. Can you help me find some interesting events please?", "city_of_event Toronto"], ["category I am more interested in sports events.", ""], ["I'm looking for interesting events.", ""], ["city_of_event I'd like to go around Philly.", "city_of_event Philly"], ["Sounds perfect, that's all I was looking for.", ""], ["I am looking for events in Anaheim, CA.", "city_of_event Anaheim, CA"], ["That would be great.", ""], ["I'm looking for some events to go to, can you help me?", ""], ["city_of_event I'm looking for music events in Phoenix.", "city_of_event Phoenix"], ["Are there any others? I prefer Rock.", ""], ["No, that's all for today, thanks.", ""], ["Will you help me find some events that are interesting.", ""], ["category I enjoy Concert Events.", ""], ["Naw, not at this moment, but that's all I need.", ""], ["I'm looking for something to do. What are some good events happening?", ""], ["That sounds interesting. What else do you know about it?", ""], ["Sounds good. That would be all.", ""], ["category I'd prefer a Match event.", ""], ["Where's the venue? And can you tell me more about this event?", ""], ["Not right now.", ""], ["Could you show me some interesting events?", ""], ["category I like Music events.", ""], ["That sounds good but show me some other events.", ""], ["No, that is it. Thank you for your help.", ""], ["I'm looking for an interesting event.", ""], ["That's ok. By the way, can you find some other events for me? I want one on the 8th.", "date the 8th"], ["Perfect. Can you find me other events?", ""], ["Perfect, thanks.", ""], ["No that's all for today and thanks.", ""], ["city_of_event category I would enjoy Music events in NYC.", "city_of_event NYC"], ["No. I don't need it now. I just want some information.", ""], ["Can you help me find Sports events around Anaheim?", "city_of_event Anaheim"], ["Not right now thanks.", ""], ["Can you find me events like Match events?", ""], ["city_of_event The city is Philadelphia city.", "city_of_event Philadelphia city"], ["Thank you, that is all for today.", ""], ["city_of_event Please look for Games in or around Chi-town.", "city_of_event Chi-town"], ["This is good, but can you find me some other events?", ""], ["That sounds great. That's all I need.", ""], ["Would you mind helping me search for some interesting events? I fancy Match events.", ""], ["Is there anything else about this event?", ""], ["Is there anything else you could tell me about the event? What's the address to the game's location?", ""], ["category I would enjoy Music events.", ""], ["city_of_event Somewhere around SD would be great.", "city_of_event SD"], ["No. I don't need it now.", ""], ["Can you help me find some interesting events near me?", ""], ["category I enjoy Sports events.", ""], ["city_of_event I'd like an event in Atlanta on the 12th.", "date the 12th city_of_event Atlanta"], ["What is the address where it is being held?", ""], ["No, not right now. That is all the information I need.", ""], ["Can you help me find an event to go to?", ""], ["city_of_event category I'm looking for a Match even around Toronto, Ontario on the 6th of March.", "date 6th of March city_of_event Toronto, Ontario"], ["Okay, that sounds good. That's all I need.", ""], ["I'm loooking for events around Portland, OR can you help me?", "city_of_event Portland, OR"], ["category Let's go with a music related event.", ""], ["Great, can you find some other events?", ""], ["Good, that is what I need.", ""], ["Would you help me find some cool events?", ""], ["category city_of_event I like Music events and would like to watch around London, UK.", "city_of_event London, UK"], ["Tell me the address of the venue.", ""], ["This sounds good but would you be able to find me other events?", ""], ["That sounds good. That is all I need.", ""], ["Can you find some interesting events for me?", ""], ["city_of_event I am looking for an event around NY.", "city_of_event NY"], ["What's the address of the show?", ""], ["Nope, that's all.", ""], ["What events are happening this weekend?", "date this weekend"], ["Are there any more events?", ""], ["Do you have more information on this event?", ""], ["What is the address of this event?", ""], ["Are there any more games coming up?", ""], ["i am looking for events around stanford.", "city_of_event stanford"], ["category i like sports events.", ""], ["Help me to find some interesting events?", ""], ["category city_of_event at phoenix, az i want to see the concert.", "city_of_event phoenix, az"], ["yes the sounds are good.", ""], ["Hello! I'm looking to do something exciting and new. Can you help me find some interesting events around SD?", "city_of_event SD"], ["category I'm currently interested in Sports events. Are there any on Saturday this week?", "date Saturday this week"], ["Great! Can I please have the address of the venue?", ""], ["Great! Were they any other events happening?", ""], ["Can I get the address of the venue?", ""], ["That sounds great. That's all I need. Thank you so much.", ""], ["Would you help me find cool events in Portland, OR?", "city_of_event Portland, OR"], ["category I like Sports events around Philadelphia.", "city_of_event Philadelphia"], ["Not at the moment. I don't need anything else.", ""], ["city_of_event category I would like to attend a Music event in NYC.", "city_of_event NYC"], ["No but thank for what you've done to me.", ""], ["city_of_event category I'm looking for a sports event around LAX on the 9th of March.", "date 9th of March city_of_event LAX"], ["I'm looking for any Games coming up in the District of Columbia. Would you assist me in finding one please?", "city_of_event District of Columbia"], ["Okay, perfect. That should do for now, thanks.", ""], ["I want to see a good concert.", ""], ["Can you find some interesting Music events?", ""], ["No, not at the moment. Thanks.", ""], ["I am looking for some interesting events to attend.", ""], ["category I love to watch Match events.", ""], ["Thank you; what other events are available?", ""], ["Where is this event located?", ""], ["I am interested in doing something this Saturday.", "date this Saturday"], ["Thank you for your help; you've given me everything I need.", ""], ["I am meeting with a friend later to hang out. Can you find some cool places to nearby?", ""], ["Those sound find. But can you find me others?", ""], ["Can you provide me with the address?", ""], ["Are there any interesting events happening out there?", ""], ["category How about Games.", ""], ["city_of_event Check around SFO.", "city_of_event SFO"], ["I'm intrigued. Tell me more. Where is it, exactly?", ""], ["Nice. What else you got?", ""], ["That sounds awesome too. I'm good for now.", ""], ["Can you assist me in finding some interesting events around New York?", "city_of_event New York"], ["category Yes, I like events that have to do with Music.", ""], ["Not bad, but can you find me other events slated for March 11th?", "date March 11th"], ["Can you give me more information about this event? Is there an address for the venue of the event?", ""], ["Not at the moment. Thanks, that would be all.", ""], ["Can you help me find interesting events around Phoenix?", "city_of_event Phoenix"], ["category I like concert events and I can go any day.", ""], ["What is the venue address?", ""], ["Can you check to see if any occurrences of interest are nearby?", ""], ["That sounds fine, but I'd like to hear about other events.", ""], ["Not right now. I appreciate your help.", ""], ["Can you help me find interesting events such as American Football or other Match events?", ""], ["city_of_event Around Berkeley please.", "city_of_event Berkeley"], ["Can you please help me find events like games?", ""], ["city_of_event Yes, It can be baseball around Chicago on any day.", "city_of_event Chicago"], ["Is there anything in Los Angeles on 8th of March?", "date 8th of March city_of_event Los Angeles"], ["Thats all I need. Thanks.", ""], ["No not right now, that's all I need.", ""], ["I really like Baseball, please find me some interesting events.", "subcategory Baseball"], ["That is all I need, that sounds great.", ""], ["I have vacation days coming up, and I am looking for interesting events to attend. Could you please find me something on the 7th?", "date the 7th"], ["city_of_event category I'd like Match events around DC.", "city_of_event DC"], ["No, thanks. You've been very helpful.", ""], ["Help me find Music events around New York.", "city_of_event New York"], ["Nope. Thanks.", ""], ["city_of_event I am looking for events around Vancouver, BC.", "city_of_event Vancouver, BC"], ["category I really like Blues. How about Music events.", "subcategory Blues"], ["Thank you, but can you please find me some other events? I would like to see what is happening on the 10th of this month, specifically in and around Brisbane.", "date 10th of this month city_of_event Brisbane"], ["That sounds great, thanks.", ""], ["I am looking for some interesting events, can you help me?", ""], ["category Games are my favorite events.", ""], ["city_of_event What are some interesting events around NYC?", "city_of_event NYC"], ["No, that's all I need for now.", ""], ["Hi I have a friend visiting and I'm looking for some interesting events around NYC, can you help me?", "city_of_event NYC"], ["category I'm looking for Games events.", ""], ["That will be all, thank you.", ""], ["I'd like to get some tickets for an event.", ""], ["city_of_event I'm looking for events next Wednesday in the Stanford area. I'd need 3 tickets.", "date next Wednesday city_of_event Stanford"], ["That's too bad. Can you check to see if I can get tickets to the Giants Vs Dodgers?", "event_name Giants Vs Dodgers"], ["That's disappointing. Thank you for your help anyway.", ""], ["Yes, that is correct. When and where will this event take place?", ""], ["Can you help me reserve tickets to an event?", ""], ["city_of_event Events around the New York area, please. The event is Joe Hisaishi.", "city_of_event New York area event_name Joe Hisaishi"], ["Actually, I would rather find tickets for the 11th of this month.", "date 11th of this month"], ["No, I would like to change that. Can you find me an event around Chi-town that has 4 tickets available?", "city_of_event Chi-town"], ["Not at this time. Thank you for your assistance.", ""], ["city_of_event I wish to go to events which is around London.", "city_of_event London"], ["event_name number_of_seats date I wish to book one ticket for the event Crystal Lake on the 6th.", "date the 6th event_name Crystal Lake"], ["Yes. I like it. What is the venue of the event?", ""], ["Thank you very much for you help.", ""], ["Nope. Thank you very much for you help.", ""], ["I'd like tickets to an event. Can you help?", ""], ["number_of_seats Just two, please.", ""], ["On second thought can you find tickets for Phillies Vs White Sox in Philadelphia?", "city_of_event Philadelphia event_name Phillies Vs White Sox"], ["Yes, that's correct. Can you please tell me the event location and starting time?", ""], ["I would like to reserve event tickets around Phoenix.", "city_of_event Phoenix"], ["number_of_seats I want 4 tickets.", ""], ["event_name The event is called Colin James on the 13th of March. I need two tickets.", "date 13th of March event_name Colin James"], ["No but thanks for your help.", ""], ["I'm looking to book tickets to an event.", ""], ["event_name number_of_seats I need two tickets and the event is La Angels Vs Houston.", "event_name La Angels Vs Houston"], ["Nope, I'm good.", ""], ["event_name The Yankees Vs Rays.", "event_name Yankees Vs Rays"], ["date Preferable on the 14th of march, I'd like four tickets actually.", "date 14th of march"], ["Thanks I really appreciate it.", ""], ["Nope that was all, thanks again.", ""], ["number_of_seats city_of_event One ticket in ATL.", "city_of_event ATL"], ["I would like to make reservation of an event.", ""], ["number_of_seats Just one ticket, please.", ""], ["city_of_event I am looking forward to join an event in Chi-town.", "city_of_event Chi-town"], ["date I would like to watch Friday next week.", "date Friday next week"], ["Where will it be held again?", ""], ["Do you have the address of the venue and what time will it start?", ""], ["Could you reserve some event tickets for me?", ""], ["event_name number_of_seats Get me 2 tickets for the Yellow Jackets Vs Hokies.", "event_name Yellow Jackets Vs Hokies"], ["Yep, that works. Where is it at?", ""], ["I'd like to purchase some event tickets.", ""], ["city_of_event number_of_seats I am looking to purchase three tickets in New York.", "city_of_event New York"], ["event_name date Yes, I'm interested in seeing Greensky Bluegrass next Wednesday.", "date next Wednesday event_name Greensky Bluegrass"], ["I'm sorry, can we change that date to the 3rd of this month?", "date 3rd of this month"], ["Absolutely. Can you tell me the name and address of the venue that is hosting this?", ""], ["Great! I appreciate the assistance.", ""], ["I think that's everything for today. Thank you.", ""], ["I'd like to reserve some event tickets.", ""], ["Actually, on second thought I'd like a ticket for today to Mets vs Diamondbacks.", "date today event_name Mets vs Diamondbacks"], ["Yep, thats what I'd like.", ""], ["Hmmm, can you try again around Phoenix, AZ please.", "city_of_event Phoenix, AZ"], ["Yes, can you tell me where and when the event is?", ""], ["I want tickets to the Whitecaps Vs Kansas City game.", "event_name Whitecaps Vs Kansas City"], ["date I want to go on the 4th.", "date the 4th"], ["number_of_seats city_of_event Two tickets in Vancouver, BC.", "city_of_event Vancouver, BC"], ["Yes. What time does it start? What is the address?", ""], ["Thanks, that is all.", ""], ["I need 2 tickets please.", ""], ["city_of_event event_name date Probably somewhere around New York city. I need to get to Thee Oh Sees on Sunday this week.", "city_of_event New York city event_name Thee Oh Sees date Sunday this week"], ["Perfect. Give me the address please.", ""], ["That's some great detail work, thanks.", ""], ["I want to go to an event on the 13th, can you help reserve tickets?", "date the 13th"], ["city_of_event number_of_seats event_name I'd like three tickets for Lyfe Jennings, in or around New York.", "city_of_event New York event_name Lyfe Jennings"], ["No, actually I want to go on March 2nd, and have 2 tickets.", "date March 2nd"], ["Yes, that sounds good. Where and when will it take place?", ""], ["Thanks a lot for your help. That's all I need for now.", ""], ["Can I book some tickets?", ""], ["event_name number_of_seats date I want to see Brown Sabbath on 8th of March. I only need 1 ticket.", "date 8th of March event_name Brown Sabbath"], ["Yes, please confirm.", ""], ["Can I have the address?", ""], ["date I want it on the 10th of March.", "date 10th of March"], ["city_of_event I want the event Timbers Vs Dc United around Portland.", "city_of_event Portland event_name Timbers Vs Dc United"], ["Yeah that works. Where and when is the event happening?", ""], ["Can you try reserving again? This time for events around DC.", "city_of_event DC"], ["Yeah, that works.", ""], ["I want to reserve some tickets.", ""], ["event_name number_of_seats I want to go to Falcons Vs Buccaneers. I need four tickets.", "event_name Falcons Vs Buccaneers"], ["Yes, that's right. What's the address?", ""], ["I want to reserve 1 ticket for an event.", ""], ["event_name date I want to attend White Sox Vs Tigers on March 11th.", "date March 11th event_name White Sox Vs Tigers"], ["city_of_event I would like the event to take place in Chicago.", "city_of_event Chicago"], ["No but thanks for the help.", ""], ["I want to reserve two tickets for a Billy Idol event.", "event_name Billy Idol"], ["city_of_event I want the event to take place around Vancouver, BC.", "city_of_event Vancouver, BC"], ["date Preferably on the 7th of this month.", "date 7th of this month"], ["That's all correct and works for me. Which is the venue? What is the address?", ""], ["Thank you for all your help. That's all I needed.", ""], ["I would like to reserve some tickets to an event.", ""], ["city_of_event Can you search for events around Anaheim please.", "city_of_event Anaheim"], ["date event_name Something around the 1st of this month. I think the Mets vs Braves game would be interesting.", "date 1st of this month event_name Mets vs Braves"], ["No thank you that is fine.", ""], ["date event_name We're going on March 3rd and want to go to Allan Rayman.", "date March 3rd event_name Allan Rayman"], ["Yes please, that would be great.", ""], ["No thanks, that was all.", ""], ["Get me some tickets right away please.", ""], ["event_name Mets Vs Phillies.", "event_name Mets Vs Phillies"], ["city_of_event number_of_seats I need 3 in New york.", "city_of_event New york"], ["date Next Friday, is the only time I can do it.", "date Next Friday"], ["No, Wrong. 2 tickets. The event is called Jordan Rakei.", ""], ["Yes, you got it.", ""], ["Yes, finally. good.", ""], ["No, that's quite enough disappointment for one day.", ""], ["I'd like to reserve tickets for an event.", ""], ["event_name Blue Jays Vs Yankees.", "event_name Blue Jays Vs Yankees"], ["date city_of_event I would like 1 ticket for an event around Toronto, Canada, on March 6th.", "date March 6th city_of_event Toronto, Canada"], ["No, I'd like to reserve for the 14th.", "date the 14th"], ["No, I'd like to reserve 3 tickets for Imperial Daze instead.", ""], ["Hi. I'd like to reserve some tickets to an event.", ""], ["city_of_event Chicago.", "city_of_event Chicago"], ["Sorry. I'd actually like 3 tickets around SFO.", "city_of_event SFO"], ["How about the Low event on March 14th?", "date March 14th event_name Low"], ["Yes, that'll work.", ""], ["No, that's all. Thank you.", ""], ["I would like to reserve tickets to an event.", ""], ["event_name city_of_event I am looking for the Yellow Jackets Vs Hokies in ATL.", "city_of_event ATL event_name Yellow Jackets Vs Hokies"], ["number_of_seats I need four tickets.", ""], ["date I want it around the 6th of March.", "date 6th of March"], ["date I want to go on the 2nd of this month.", "date 2nd of this month"], ["Yes, that sounds good, where is the venue?", ""], ["Thanks a lot, that's all I need for now.", ""], ["I want to get tickets for the Mets Vs Rockies.", "event_name Mets Vs Rockies"], ["number_of_seats city_of_event date Check for 2 tickets on the 10th of this month in NYC.", "date 10th of this month city_of_event NYC"], ["Yes. What is the address for the game?", ""], ["Thanks for the help! That's all I needed.", ""], ["Hello, I'd like to reserve tickets for an event.", ""], ["number_of_seats date event_name I'd like two tickets for the Yankees Vs Angels game Saturday this week.", "date Saturday this week event_name Yankees Vs Angels"], ["No, thanks anyway.", ""], ["I want to reserve tickets at an event.", ""], ["number_of_seats event_name I would like three tickets for Yunger.", "event_name Yunger"], ["date I am looking for something in Sacramento, CA on March 10th.", "date March 10th city_of_event Sacramento, CA"], ["No, I want four tickets.", ""], ["Yes, that works for me. What is the address and when does it start?", ""], ["There is an event coming up that I'd like to reserve tickets for.", ""], ["event_name I am looking to go to the Sounders Vs United game in Seattle.", "city_of_event Seattle event_name Sounders Vs United"], ["My mistake. This new event is actually in London, England.", "city_of_event London, England"], ["Yeah, that sounds good. Could I get the location of the venue please?", ""], ["Great, that should do me for now.", ""], ["I need to book tickets for an event.", ""], ["number_of_seats 4 ticket please.", ""], ["Yes, what is the address?", ""], ["date event_name number_of_seats I'd like something on the 4th of this month. The event is the Blue Jays Vs Indians game. I'd like four tickets.", "date 4th of this month event_name Blue Jays Vs Indians"], ["city_of_event I'd like to find some events around New York City. The event is Nycfc Vs Timbers.", "city_of_event New York City event_name Nycfc Vs Timbers"], ["Yeah, that works for me. Where is the event taking place, and what is the address of the venue?", ""], ["I need to reserve a ticket to an event.", ""], ["city_of_event number_of_seats event_name The event I am looking for is called Allan Rayman in SF. I am looking for two tickets.", "city_of_event SF event_name Allan Rayman"], ["date I am looking for around 13th of March.", "date 13th of March"], ["No actually the event is The Drums. I need four ticket.", ""], ["Yes that is correct. Where is event located? what is the address?", ""], ["No that's it.", ""], ["number_of_seats event_name date I need four tickets to see the Sounders Vs red bulls on the 1st of march.", "date 1st of march event_name Sounders Vs red bulls"], ["city_of_event It will be in seattle, wa.", "city_of_event seattle, wa"], ["Yes, that's what I need.", ""], ["No thanks, that's all I need.", ""], ["number_of_seats date event_name I want two tickets to the Lizzo event next Thursday.", "date next Thursday event_name Lizzo"], ["Could you try again? I am looking for tickets to Nationals Vs Rockies around the District of Columbia.", "city_of_event District of Columbia event_name Nationals Vs Rockies"], ["No, thank you very much for your help.", ""], ["I would like to reserve some tickets for an event. I would like to book something for 4th of March.", "date 4th of March"], ["number_of_seats city_of_event I want tickets for events near to NY. I would like to book 1 ticket.", "city_of_event NY"], ["Yes, that would work for me.", ""], ["I will need two tickets to reserve for an event.", ""], ["I need to know the address of the venue and place of event which i want to know.", ""], ["I would like to book tickets to an event.", ""], ["Yes, that is it.", ""], ["No. Thanks for your help.", ""], ["I'd like two tickets to the Panthers Vs Jaguars.", "event_name Panthers Vs Jaguars"], ["date The 4th of March, somewhere are LAX.", "date 4th of March city_of_event LAX"], ["Try again for next Friday.", "date next Friday"], ["I would like to reserve tickets to events around New York City.", "city_of_event New York City"], ["event_name I've been looking at the Outlaw Music Festival.", "event_name Outlaw Music Festival"], ["No, I want a ticket on the 4th for the Toronto Fc Vs Crew.", "date the 4th event_name Toronto Fc Vs Crew"], ["Yes, that is what I want.", ""], ["I am looking for 2 tickets around Anaheim. Can you please try to reserve again?", "city_of_event Anaheim"], ["Yes, what time does it start and where is the event?", ""], ["I'd like help with reserving tickets to an event in New York. I'm looking for something to do on the 14th of this month.", "date 14th of this month city_of_event New York"], ["event_name number_of_seats The event is called Juliana Hatfield, I'd like 4 tickets. It's around Washington D.C.", "city_of_event Washington D.C event_name Juliana Hatfield"], ["No, that's not right. I want 2 tickets.", ""], ["Yes, that sounds right.", ""], ["I wish to book a ticket for the event Owls Vs Tigers.", "event_name Owls Vs Tigers"], ["number_of_seats city_of_event I wish to have 3 tickets for the event around Philadelphia.", "city_of_event Philadelphia"], ["date I wish to book it on 7th of March.", "date 7th of March"], ["Nope. I wish to see the event Hozier on March 3rd.", "date March 3rd event_name Hozier"], ["Yes. It is good for me. What is the address venue? When will it get start?", ""], ["Could you please try to reserve again? I wish to see the events around Washington.", "city_of_event Washington"], ["Nope. Thank you so much for your help.", ""], ["I'm planning on going to an event on 3rd of March, could you find me something?", "date 3rd of March"], ["city_of_event event_name number_of_seats I need four tickets for Yankees vs Indians, around New York.", "city_of_event New York event_name Yankees vs Indians"], ["Yes, I confirm that. Where is the event taking place?", ""], ["That's all. Thanks for your help.", ""], ["I'd like to reserve tickets for Giants vs Brewers.", "event_name Giants vs Brewers"], ["city_of_event date number_of_seats I was looking for something around SFO on the 7th of March for 3 tickets.", "date 7th of March city_of_event SFO"], ["When does the event start and where is the address of the venue?", ""], ["I want to reserve tickets for an event.", ""], ["number_of_seats I want two tickets.", ""], ["No, actually I want to go to Portland.", "to_location Portland"], ["I would like to reserve event tickets in the Phoenix area.", "city_of_event Phoenix"], ["Yes thank you. What is the start time and the venue's address?", ""], ["I'd like to reserve some tickets for an event.", ""], ["date number_of_seats I'm looking for events around NY. Three tickets for something on the 6th of March.", "date 6th of March city_of_event NY"], ["event_name Yes. It's Russian Circles.", ""], ["No, It needs to be near Seattle, WA.", "area Seattle, WA"], ["Yep, that's right.", ""], ["Can you change that to two tickets and try again?", ""], ["Yes. Where is the venue & what time does it start?", ""], ["I would like to reserve a set of tickets for the concert.", ""], ["event_name The event I will be attending with a friend is the Toronto Fc Vs Crew.", "event_name Toronto Fc Vs Crew"], ["date I would like something on the 10th.", "date the 10th"], ["number_of_seats I need two tickets.", ""], ["city_of_event Yes, I am looking for events that are around LAX and I need 4 tickets.", "city_of_event LAX"], ["Yes that is correct. What time does the event start?", ""], ["Can you try again? I need tickets for the event Jonathan Mcreynolds in Berkeley.", "city_of_event Berkeley event_name Jonathan Mcreynolds"], ["No thank you for your time.", ""], ["I want to attend an event?", ""], ["city_of_event I will be in Portland, OR.", "city_of_event Portland, OR"], ["event_name I want to see Timbers Vs Rsl.", "event_name Timbers Vs Rsl"], ["No, I want to attend an event in Napa.", "city_of_event Napa"], ["Can you try to get the tickets for Hot Water Music?", ""], ["Yes please. When and where is the event?", ""], ["I would like to reserve tickets to an event near Seattle.", "city_of_event Seattle"], ["number_of_seats date event_name I would like something for the 10th of this month. I'd like 2 tickets to Sounders Vs Revolution.", "date 10th of this month event_name Sounders Vs Revolution"], ["No, but thank you for your help.", ""], ["I want to book tickets for an event.", ""], ["number_of_seats date event_name I need 1 ticket for the event Diamondbacks Vs Dodgers on March 2nd.", "date March 2nd event_name Diamondbacks Vs Dodgers"], ["city_of_event I want to look for events around Phoenix.", "city_of_event Phoenix"], ["Do you know the venue of the event? I want to confirm the ticket for this event.", ""], ["No. Thanks.", ""], ["I am interested in reserving 2 tickets for an event around NY.", "city_of_event NY"], ["There we go. That's more I like it. So what time is the event and what's the address?", ""], ["Okay, that should do for now.", ""], ["I'd like to reserve 1 ticket for an event.", ""], ["city_of_event Search for events around Berkeley.", "city_of_event Berkeley"], ["date March 14th, and the event is actually an United Vs Red Bulls match.", "date March 14th event_name United Vs Red Bulls"], ["Yes, I'd like that. And where is the name of the venue that this event will be taking place in?", ""], ["No. But thanks a lot.", ""], ["Yes, I confirm. Where will the event take place and at what address?", ""], ["I need 3 tickets.", ""], ["No, thank you for the help.", ""], ["I want to reserve three tickets to an event.", ""], ["date event_name I want tickets on Tuesday next week for Outlaw Music Festival.", "date Tuesday next week event_name Outlaw Music Festival"], ["city_of_event I'm looking for tickets in New York City.", "city_of_event New York City"], ["When does the event start and where does it take place?", ""], ["number_of_seats city_of_event I want 3 tickets in Seattle by next Wednesday.", "city_of_event Seattle date next Wednesday"], ["No I want it in Philadelphia instead.", ""], ["Yes that works, what's the address and when is it?", ""], ["No, thanks for the help.", ""], ["Tell me more about this activity. Wheat is the location of the event?", ""], ["That's wonderful. I'd like to book tickets to the activity.", ""], ["number_of_seats I'd like three tickets.", ""], ["Are there any interesting events?", ""], ["category city_of_event Somewhere around ATL. I like Games.", "city_of_event ATL"], ["That sounds okay, but what else is there?", ""], ["That one sound perfect.", ""], ["Yes, I'd like to get 4 tickets.", ""], ["Can you find some interesting event on 1st of this month?", "date 1st of this month"], ["category Find me some Concert events.", ""], ["Can you find me the address of the venue?", ""], ["Okay, Reserve tickets for the event.", ""], ["That will be all. Thank you!", ""], ["Anything interesting happening in Toronto, Canada?", "city_of_event Toronto, Canada"], ["Where is the stadium?", ""], ["Yeah, please do.", ""], ["Confirmed.", ""], ["category city_of_event I am interested in events around New York. I enjoy going to sports games.", "city_of_event New York"], ["Please share some more information with me. Where is the venue located?", ""], ["This is perfect! Can you find some other events for me? I will be in Toronto, Ontario. Please look for events happening near Toronto on Friday next week.", "date Friday next week city_of_event Toronto, Ontario"], ["This is perfect! Can you find some other events for me? I would like to have multiple options.", ""], ["This is perfect! Please reserve 2 tickets to the Blue Jays vs. Indians game for me", "event_name Blue Jays vs. Indians"], ["Incorrect. I would like to reserve four tickets.", ""], ["Yes, this is the correct information. May you provide me the address of the venue?", ""], ["I am looking to find some interesting events.", ""], ["That sounds like a great event.", ""], ["Yes I would like to purchase some tickets.", ""], ["number_of_seats I would like to buy one ticket.", ""], ["No, I changed my mind and woul d like four tickets.", ""], ["Thank you for you assistance today. I do not need anything further.", ""], ["I am looking for some interesting events to go to. Could you help me with that?", ""], ["That sounds interesting. Tell me more.", ""], ["Could you tell me the exact address of the venue?", ""], ["Yes please. get me the tickets.", ""], ["Thanks so much. That is all that I need.", ""], ["Hi, I'm bored. Can you find me some interesting events to go to?", ""], ["category I think I'd like to go to a concert.", ""], ["Can you give me more information about the concert? What is the address of the concert venue?", ""], ["Sounds good to me. I'd like to reserve 3 tickets for the concert.", ""], ["No, actually I'd like 4 tickets.", ""], ["That sounds fun. I want to book tickets to that event.", ""], ["Yes, that's correct. What is the venue's address?", ""], ["Thanks for your help. That is all.", ""], ["I'm looking for something to do, can you locate some interesting events for me?", ""], ["I like the sound of that. Please reserve four tickets to that event for me.", ""], ["No, I only wish to have one ticket.", ""], ["Thank you very much for helping me. That's all I was looking for.", ""], ["category I need Music events.", ""], ["Yes, please buy me tickets.", ""], ["number_of_seats I want three tickets.", ""], ["Thank you for helping. That is all for now.", ""], ["I am looking for a fun event to attend. I really like Football and would like to go to something today. Could you help me find an event to go to?", "subcategory Football date today"], ["city_of_event I would like a Match event around Atlanta, GA.", "city_of_event Atlanta, GA"], ["That sounds good but could you find any other events? Any day would be fine, actually.", ""], ["That sounds great. I would like to reserve a ticket.", ""], ["number_of_seats I want to reserve 3 tickets.", ""], ["Yes, that is correct. What is the address of the venue?", ""], ["Can you help me find something interesting to go to around Atlanta, GA?", "city_of_event Atlanta, GA"], ["Actually I want 4 tickets.", ""], ["Thanks a bunch, that's all I need.", ""], ["Can you help me find some events around LAX?", "city_of_event LAX"], ["Can you tell me more information?", ""], ["No, that's all for now.", ""], ["Please list interesting local events.", ""], ["I would like Baseball around SD.", "city_of_event SD"], ["What is there address?", ""], ["Yes, I want to buy two tickets.", ""], ["Yes that is what I want.", ""], ["Thank you for everything.", ""], ["I feel like watching some baseball. Can you find a Match around me?", ""], ["city_of_event Around SD please.", "city_of_event SD"], ["That's nice but is anything else happening?", ""], ["Please do.", ""], ["Where is their venue located?", ""], ["Thanks a lot, that's all.", ""], ["I would like to find a fun event.", ""], ["city_of_event How about Philly?", "city_of_event Philly"], ["category I enjoy games.", ""], ["That's fine but anything else like baseball games?", ""], ["No, that should do it.", ""], ["I'm looking for something fun to do. Can you help me find some interesting events?", ""], ["I'll keep that one in mind. Separately, I really like baseball games. Can you look for any happening soon?", ""], ["What is the address of the venue for that game?", ""], ["That sounds great. I want to reserve a ticket. Can you book 1 ticket for me?", ""], ["No, sorry, change of plans: I want three tickets instead.", ""], ["Could you find me an interesting event to go to?", ""], ["Sounds good. Could you reserve 3 tickets to that event?", ""], ["Can you find me a good event to go to?", ""], ["That's good, but is there anything else?", ""], ["That's okay, but anything on the 7th?", "date the 7th"], ["Yes please, I'd like four tickets thanks.", ""], ["Yes, that's perfect. What is the address of the stadium?", ""], ["No thanks, that's all.", ""], ["city_of_event category How about a sports thing in Washington?", "city_of_event Washington"], ["Tell me more, what's the address?", ""], ["That sound riveting.", ""], ["number_of_seats Hit me 3 times.", ""], ["You pulled a winning ticket there.", ""], ["perfect swing on that ball.", ""], ["Nope daddyo I'm good.", ""], ["I am getting bored of regular jobs. its high time watched some events, can you help?", ""], ["category No doubt, Music.", ""], ["Thats ok, But can you find some around Seattle, WA, on next Wednesday.", "city_of_event Seattle, WA date next Wednesday"], ["Nice, then reserve three tickets for that.", ""], ["No thanks a lot.", ""], ["Can you help me find some events of interest?", ""], ["city_of_event I'm looking for something in New York.", "city_of_event New York"], ["number_of_seats I'd like 2 tickets please.", ""], ["Please help in finding something interesting events?", ""], ["city_of_event category Yes, please search in sports events SF.", "city_of_event SF"], ["Whats the address for it, can i have more details of it?", ""], ["ok, are there any other events?", ""], ["That is nice.", ""], ["category Let's do concert events please.", ""], ["Yes that sound great.", ""], ["Yep. Find out the venue address for me please.", ""], ["Thanks for your help today. That will be all.", ""], ["Wow, that sounds great. Thanks", ""], ["yes,sure i would like to buy tickets.", ""], ["number_of_seats I need 1 tickets.", ""], ["sorry for the ticket reservation because i need 3 tickets.", ""], ["category city_of_event I will be going to something in New York, and I really love Concert events.", "city_of_event New York"], ["Well, I don't know. Can you find event for something else?", ""], ["That's okay, but could you find me something else? What about events around San Francisco?", "city_of_event San Francisco"], ["Ooh, that seems fun.", ""], ["Sure, that would be fine.", ""], ["Thanks so much! I'm not bored, now.", ""], ["No thank you. You've been a great help.", ""], ["I'm looking for some fun, interesting Music events to go to.", ""], ["city_of_event Please look for some events happening around NY.", "city_of_event NY"], ["Yeah that sounds good. But can you look for some Sports events like Baseball games?", ""], ["What's the address for the game?", ""], ["That was a good suggestion, but what about any others?", ""], ["Cool, that sounds perfect.", ""], ["Yup, I'd like to buy some right now.", ""], ["number_of_seats Please buy three tickets.", ""], ["Yup, that's right.", ""], ["Can you find me some events in San Diego for Saturday this week?", "date Saturday this week city_of_event San Diego"], ["category I am looking for Match events.", ""], ["That is good, but can you find me something else?", ""], ["What other information do you have about this event?", ""], ["What is the location?", ""], ["number_of_seats There is one person going.", ""], ["Is there anything going on in this town?", ""], ["category city_of_event Look for Music in and around LAX.", "city_of_event LAX"], ["Sounds cool but I'm more into Electronica.", ""], ["Where they at?", ""], ["What else is out there?", ""], ["Yeah, that hits the spot. Could you get me some seats?", ""], ["number_of_seats Just 1 seat.", ""], ["Yes. Where is the venue?", ""], ["Excellent. I am all set for now.", ""], ["category city_of_event I'd like a concert event around San Diego, please.", "city_of_event San Diego"], ["Sounds fine, but can you find me some other events? Any day is fine.", ""], ["Sounds fine, but can you find me some other events?", ""], ["Yes, I'd like 2 tickets.", ""], ["No, that's all for now. Thanks.", ""], ["Hello, can you help me to find some events that I am interested in?", ""], ["Where is the venue located?", ""], ["Actually, no I only want 2 tickets please.", ""], ["Can you help me find some cool events?", ""], ["What's the address for that.", ""], ["Yeah.", ""], ["number_of_seats Three is good.", ""], ["I want to find some interesting events on Monday next week.", "date Monday next week"], ["category city_of_event I am looking for sports events around Seattle.", "city_of_event Seattle"], ["Ok. That sounds great.", ""], ["number_of_seats I just want 1 ticket for me.", ""], ["Yes, That is fine. Can you find me the the address of the venue?", ""], ["No. That will be all. thank you!", ""], ["Can you help me locate some interesting events around SD?", "city_of_event SD"], ["That sounds great. Can you please reserve 2 tickets?", ""], ["I would like 4 tickets please.", ""], ["Yes, that is correct. What is the address of the ballpark?", ""], ["Thank you a lot for your help.", ""], ["It sure is boring around here. Is anything interesting happening nearby?", ""], ["category I'm most interested in Match events.", ""], ["That could be interesting, but I'd like to hear about what other events are happening.", ""], ["That one is neat as well, but I'd rather you find me an event that starts on March 8th.", "date March 8th"], ["I'd like to hear more about this event. What's the address of the venue, so I know where to go?", ""], ["Sounds good to me. I'd like to reserve tickets for this game.", ""], ["number_of_seats I'd like to reserve four tickets.", ""], ["Actually, some of the people I had in mind aren't big on baseball. It'd be better if I just get two tickets.", ""], ["number_of_seats 4 tickets, please.", ""], ["Thanks very much.", ""], ["Could you assist me in discovering several interesting events?", ""], ["city_of_event I am searching for events near Phoenix, AZ.", "city_of_event Phoenix, AZ"], ["What is the location and name of the event?", ""], ["That's wonderful for me.", ""], ["Yup, I'd like to purchase tickets.", ""], ["number_of_seats I'd like 3 tickets.", ""], ["Nope; I'd like 1 ticket.", ""], ["Nope. Thank you for your assistance.", ""], ["Would you mind helping me find an event to go to?", ""], ["city_of_event I want to be in Stanford.", "city_of_event Stanford"], ["That sounds good, I want tickets to that.", ""], ["Actually, can you make it four tickets?", ""], ["Thanks so much, that's everything.", ""], ["category city_of_event I'd like to go out Tuesday next week for a sports event in NYC.", "city_of_event NYC date Tuesday next week"], ["Tell me more about this event and it's location.", ""], ["Yes, I would like to purchase two tickets.", ""], ["No, that is everything. Thank you.", ""], ["Can you find me some events I might be interested in?", ""], ["category city_of_event I kinda want to go to a concert. Let's look in Philadelphia", "city_of_event Philadelphia"], ["That's cool, but maybe I can go to something else, maybe something Pop music related.", ""], ["Yes please get me tickets.", ""], ["number_of_seats I want 2 tickets for that.", ""], ["Great, thanks for that.", ""], ["Are there any more cool events I can go to that I'd like?", ""], ["category city_of_event I am looking for events in the San Diego area. I love Music events. Hip Hop and Pop are amazing.", "city_of_event San Diego area"], ["What's the lineup? How many artists are performing besides Alejandro? What sort of people will be there?", ""], ["That sounds great. I want to reserve my tickets now. OK?", ""], ["number_of_seats I have 4 people in my party.", ""], ["Thank you so much. You're amazing.", ""], ["city_of_event I am looking for events around Atlanta, GA.", "city_of_event Atlanta, GA"], ["Can you please tell me more about this?", ""], ["number_of_seats I would like 2 tickets.", ""], ["Yes, correct. What is the address?", ""], ["No thank you, that is all.", ""], ["Hi, i need a help to find some interested events in new york.", "city_of_event new york"], ["category Yes, i like Concert events.", ""], ["I need more details about this event, What is the address of the venue?", ""], ["That sounds good for me.", ""], ["I want to go out. Can you help me find any interesting event around?", ""], ["city_of_event category Yes, I am looking for something around Philadelphia. I would some music event.", "city_of_event Philadelphia"], ["I like that one, but would you mind to find some other events? I really love sports events. I would like something on 4th of this month.", "date 4th of this month"], ["I like that one, but can you fin some other events?", ""], ["This one sounds great. I want to reserve tickets for this event, It will be three tickets.", ""], ["Yes, that would work perfectly for me. What is the address of the venue?", ""], ["No that will be all. Thanks a lot for your help.", ""], ["I want to find some neat events coming up.", ""], ["That sounds like a great game.", ""], ["Yes, and I'll just need one ticket.", ""], ["Great. Thanks. I don't think I need anything else.", ""], ["I am a bit bored, please help find some Interesting events.", ""], ["category Just help me find something on March 14th. I like match events.", "date March 14th"], ["city_of_event Events in Portland, OR would be perfect.", "city_of_event Portland, OR"], ["Sounds great. I want the book a ticket.", ""], ["number_of_seats I need 4 tickets.", ""], ["No, I need two tickets.", ""], ["Thanks, that would be all.", ""], ["Where is that venue located?", ""], ["That is ok, but is there anything else available?", ""], ["That would be awesome.", ""], ["I would like tickets for an event.", ""], ["That would be just fine.", ""], ["I appreciate your assistance. That would be all.", ""], ["city_of_event Search around San Francisco.", "city_of_event San Francisco"], ["Not bad, but can you find any other events?", ""], ["Tell me more.", ""], ["number_of_seats 2 tickets please.", ""], ["Yes, that works. What is the address?", ""], ["I'm trying to find some interesting events.", ""], ["city_of_event category I'm looking for something in New York, a concert event.", "city_of_event New York"], ["Yes I would like three please.", ""], ["Actually make that just 1 ticket.", ""], ["Not today, thank you.", ""], ["Can you find me an event in New York City.", "city_of_event New York City"], ["category I want Sports event.", ""], ["Any other events that you can find for me?", ""], ["Where is the event?", ""], ["I want 3 tickets for this event.", ""], ["Can you show me some events.", ""], ["That's great. Please reserve some tickets for me.", ""], ["number_of_seats I need 4.", ""], ["No, thanks. I'm good.", ""], ["I am looking for some type of interesting event to attend on Thursday next week.", "date Thursday next week"], ["OK, tell me more. What is the venue's address?", ""], ["That sounds great, I would like to reserve two tickets.", ""], ["I'm looking for interesting concert events.", ""], ["They're good, but I like Pop, are there events like that?", ""], ["Good, but are there other events like around SD on the 8th of this month?", "date 8th of this month city_of_event SD"], ["number_of_seats Two please.", ""], ["I'm looking for interesting events around NYC.", "city_of_event NYC"], ["category Music events.", ""], ["Good, any others?", ""], ["Yes, great.", ""], ["Hello, Can you help me find some interesting events?", ""], ["Great, Tell me more about this event.", ""], ["Yes, I would like to buy 1 ticket please.", ""], ["Perfect! That works for me.", ""], ["Thank you for your help. That is all I need.", ""], ["Yes, this is correct.", ""], ["No, that will be all, thank you.", ""], ["Can you help me find some interesting events on Tuesday next week?", "date Tuesday next week"], ["city_of_event I really like country events around New York City.", "city_of_event New York City"], ["That sounds great. I want to reserve a ticket to the event.", ""], ["number_of_seats I want 2 tickets.", ""], ["No that will be it. Thanks a lot for your help.", ""], ["Any other events? I like Pop music.", ""], ["Tell me the address.", ""], ["I want to buy 2 tickets.", ""], ["Sounds good to me! Can you help me reserve 3 tickets?", ""], ["That sounds great. Can I please reserve 1 ticket?", ""], ["No incorrect. I want three tickets.", ""], ["Yes, confirmed. What is the address of the venue?", ""], ["No Thank you.", ""], ["category I'm looking for a concert.", ""], ["Actually, I'd like 1 ticket.", ""], ["That sounds great. Can you please reserve 4 tickets to the event?", ""], ["No, that is all. Thanks again.", ""], ["Can you help me find an interesting event for the 5th of march?", "date 5th of march"], ["city_of_event Are there events in Anaheim?", "city_of_event Anaheim"], ["That's it, thank you so much.", ""], ["Can you help me search for fun events?2", ""], ["What's the venue address? Tell me more about the events.", ""], ["That's good too. Anything else?", ""], ["Yes I would.", ""], ["Yes that's perfect. What's the address again?", ""], ["Thanks a lot for your help, that's all I need.", ""], ["I'm looking for some interesting events to go to, do you have any suggestions?", ""], ["category Something that has to do with Sports.", ""], ["That sounds like something I'd enjoy. Book those tickets for me.", ""], ["number_of_seats I think I'm going to need three tickets.", ""], ["Yeah, that's perfect.", ""], ["Thanks so much for helping me out.", ""], ["No, thanks again.", ""], ["I am trying to find some interesting events. Can you help me find some?", ""], ["These sound good but I can go any day. Can you help me find other events?", ""], ["I would love to. I just want one tickets.", ""], ["Make it 2 tickets please.", ""], ["That's good. Can you confirm the address of the venue?", ""], ["You have given me all I need. Thanks for your help.", ""], ["That sounds great. I'd like to reserve tickets.", ""], ["number_of_seats I'd like 1 ticket, please.", ""], ["No. I'd like 2 tickets.", ""], ["Yes, that's great. What's the address for the venue?", ""], ["Will you help me find some events?", ""], ["city_of_event Toronto, Canada.", "city_of_event Toronto, Canada"], ["category Music.", ""], ["Sounds good. I would like to reserve tickets.", ""], ["number_of_seats 4 tickets please.", ""], ["No, I would one ticket.", ""], ["That's fine.", ""], ["I am looking for events in SF like Sports events.", "city_of_event SF"], ["Are there other events like Baseball?", ""], ["This is good but any others?", ""], ["This one I like.", ""], ["number_of_seats I want 1 ticket please.", ""], ["Yes, I confirm that all.", ""], ["Thank you that is all I need.", ""], ["city_of_event I am wanting to attend a concert event. Is there any around NY soon?", "city_of_event NY"], ["number_of_seats I will need three tickets.", ""], ["Yes that is correct. What is the address of the venue?", ""], ["Great, thank you for booking.", ""], ["Can you help me find something to do? I like sports events.", ""], ["city_of_event I think around DC.", "city_of_event DC"], ["What other events do you have?", ""], ["Now that sounds good.", ""], ["Yes, I would like two tickets please.", ""], ["Yes that's great! What is the address please?", ""], ["No, Thank you for your time.", ""], ["I'm looking for some interesting events to go to?", ""], ["Yes that works for me. Whats the address of the venue?", ""], ["Can you find me something cool? I like to watch Match events.", ""], ["Thats a good find! Any other events? I actually like watching Baseball to!", ""], ["Sure! Buy me 4 tickets please.", ""], ["Thats really good! Where is the address?", ""], ["category city_of_event I would like to attend a Music event in LA.", "city_of_event LA"], ["Sounds ok but can you find another event?", ""], ["I plan on it, thanks.", ""], ["Please help me find some interesting events on the 6th of this month.", "date 6th of this month"], ["That sounds good. Can you find me some other events around LAX?", "city_of_event LAX"], ["Please tell me more about this event and the address of the venue.", ""], ["Great. I would like to reserve tickets to that event.", ""], ["number_of_seats Three tickets, please.", ""], ["Thanks, that's what I needed.", ""], ["Thanks for your assistance. That will be all.", ""], ["I'm looking for some cool events around the Phoenix, AZ area.", "city_of_event Phoenix, AZ"], ["Yes, I want to purchase tickets.", ""], ["Actually, I only want one ticket.", ""], ["I'm looking for a cool event to attend. Can you help me?", ""], ["Change that to four tickets.", ""], ["Thank you, I appreciate it.", ""], ["No, I'm good, thanks.", ""], ["Can you help find some interesting events?", ""], ["What is the address? Tell me more!", ""], ["Yes, I want to buy tickets.", ""], ["No, I need three tickets.", ""], ["category city_of_event i like to go around San francisco. is there any match going on?", "city_of_event San francisco"], ["great.", ""], ["Yes I would like to buy tickets.", ""], ["number_of_seats i would like buy 2 tickets.", ""], ["could you please book 3 tickets instead of 2.", ""], ["No, Thank You.", ""], ["Can you help me me find some Sports events in the San Diego area?", "city_of_event San Diego"], ["Ok. Tell me more about the game.", ""], ["Where is the stadium's address?", ""], ["No, I want to buy 3 tickets.", ""], ["Nothing else today. Thanks for your help.", ""], ["I looking for an event on 8th of March.", "date 8th of March"], ["category I want music.", ""], ["city_of_event I want Jazz around Napa.", "city_of_event Napa event_name Jazz"], ["What is the address.", ""], ["yes please.", ""], ["thanks.", ""], ["Yes, 4 tickets please.", ""], ["Yes that's right. What's the address.", ""], ["Nope that's all.", ""], ["Will you help me find Music events?", ""], ["Do you have any more information?", ""], ["Yes, 1 ticket.", ""], ["No, I would like three tickets, please.", ""], ["I want apartment where pets are allowed.", ""], ["number_of_beds one bed room is enough.", ""], ["area Fremont will be fine.", "area Fremont"], ["Please find some other apartments.", ""], ["can you find some other with one baths?", ""], ["is the property furnished? Give the contact number", ""], ["Sounds good. Schedule a visit on March 2nd.", "visit_date March 2nd"], ["No. Schedule visit on Friday next week.", "visit_date Friday next week"], ["Yep. Sounds good", ""], ["No. Thanks a lot", ""], ["I am looking for a one bedroom apartment.", ""], ["area I am looking for one in San Jose.", "area San Jose"], ["What other options have you found?", ""], ["Great, can you give me the phone number? Does this property allow pets?", ""], ["No, I'm all set, thank you.", ""], ["number_of_beds area I want a one bed room apartment in Union City.", "area Union City"], ["visit_date I want to visit on the 8th of March.", "visit_date 8th of March"], ["area I'm looking for three baths. i really an apartment is located in Hayward.", "area Hayward"], ["can you tell me about other rents? Islocated in Concord. with pets, please.", "area Concord"], ["please, can you show me other apartments?", ""], ["tell me number phone property?", ""], ["have good sounds?", ""], ["Yes i do! 5th of this month.", "visit_date 5th of this month"], ["I want go 8th of this month.", "date 8th of this month"], ["have good sounds.", ""], ["very thanks.", ""], ["No. thanks.", ""], ["I'd like to find a 2 bedroom apartment can you help me find one?", ""], ["area I'd like to find one in san mateo preferably.", "area san mateo"], ["Can you find me some additional apartments that also have 2 baths?", ""], ["Is that apartment furnished?", ""], ["That one sounds good to me.", ""], ["Sure, I'd love to schedule a visit.", ""], ["visit_date I'd like to visit on the 9th.", "visit_date the 9th"], ["Yup, sounds good.", ""], ["Thank you very much, thats all I need for now.", ""], ["I would like to find an apartment, which should have at least 3 baths.", ""], ["number_of_beds It should have at least 3 bedrooms.", ""], ["area I would like an apartment in Sunnyvale.", "area Sunnyvale"], ["Can you find me other apartments? Some in which pets are allowed.", ""], ["Yes that apartment sounds good. Can I schedule a visit to the apartment? I want to visit later today.", "visit_date later today"], ["The date I want to visit is on the 14th.", "visit_date the 14th"], ["area It should have two baths.i want an apartment in Livermore.", "area Livermore"], ["Are pets allowed in the apartment? What is the property's phone number?", ""], ["I want an apartment and I want it in Newark.", "area Newark"], ["tell me the property phone number and if it is furnished.", ""], ["visit_date I need to visit the 13th of this month.", "visit_date 13th of this month"], ["I wanna visit Saturday this week.", "visit_date Saturday this week"], ["Yes are pets allowed?", ""], ["I am looking for a place to move to. An apartment would be perfect for me.", ""], ["What about some other apartments with 3 baths?", ""], ["Does it come with furniture? Are pets allowed?", ""], ["Are there other apartments available?", ""], ["Great! Is it furnished?", ""], ["No. Thank you again.", ""], ["I'm moving soon and I need a place to live! I'm in the market for an apartment.", ""], ["number_of_beds area I'm moving to Santa Rosa so I need to find a place there. I just need 1 bedroom.", "area Santa Rosa"], ["visit_date How about the 6th?", "visit_date the 6th"], ["I think that covers it. Thanks for everything!", ""], ["I'm looking for an apartment in San Jose.", "area San Jose"], ["Are there other options available somewhere else?", ""], ["Can you find me something else? I only need one bath, but I do need it furnished.", ""], ["Yes, that one sounds good. I'd like to schedule a viewing of the apartment.", ""], ["visit_date The 11th would be great, please.", "visit_date The 11th"], ["Yes, that is correct. Are pets permitted at the property? Also, what is the phone number?", ""], ["Thank you. I'm all set now.", ""], ["I need an apartment, can you find for me?", ""], ["number_of_beds area I need a two bed rooms apartment in SF and pets should be allowed there.", "area SF"], ["Can you find some other apartment in san Jose?", "area san Jose"], ["One bath is enough for me, can you find something like that?", ""], ["Get me the phone number for that apartment and get me details whether the apartment is furnished?", ""], ["Yes, that is good for me, can you Schedule a visit to that apartment on next Wednesday.", "visit_date next Wednesday"], ["Sorry, a small change, I need to visit on 2nd of March.", "visit_date 2nd of March"], ["Yes, that is good to me and please confirm the same.", ""], ["I'm looking for a new apartment. Can you help me find one?", ""], ["number_of_beds area I'm hoping to find a 2 bedroom apartment in Berkeley.", "area Berkeley"], ["What other options are there? I need something pet-friendly.", ""], ["That one sounds good. Can you schedule a visit there for the 11th?", "visit_date the 11th"], ["Yes, that's right. By the way, is it furnished?", ""], ["Thanks, that's it for now.", ""], ["Hello, I would like to find an apartment for myself.", ""], ["area Yes, I would like to find a place in Alameda.", "area Alameda"], ["number_of_beds It should have at least 1 bedroom for me.", ""], ["Two questions. Can I bring a pet? and is the place already furnished.", ""], ["Ok. Well, that place sounds like it will work for me.", ""], ["Certainly, I would like to have a chance to check it out.", ""], ["visit_date I would like to look at it on the 13th of this month if I can.", "visit_date 13th of this month"], ["Oh, actually, I would like to see it on the 3rd.", "date the 3rd"], ["That is great. Thank you so much. That is all.", ""], ["I need help finding an apartment.", ""], ["number_of_beds area In napa and with 1 bed room.", "area napa"], ["Yes, I want to visit on Wednesday next week.", "visit_date Wednesday next week"], ["Is furniture included? How can I contact the property?", ""], ["I would like to find an apartment where pets are allowed.", ""], ["number_of_beds 1 bedroom is okay.", ""], ["Please find one in Mountain View that has two baths.", "area Mountain View"], ["I would like you to schedule it on March 13th.", "date March 13th"], ["Yes that's okay.Is the apartment furnished?", ""], ["area I'd like to be in Fremont.", "area Fremont"], ["number_of_beds Something with 3 bedrooms.", ""], ["Yes, can you schedule a visit for tomorrow?", "visit_date tomorrow"], ["Actually, change that to the 12th of March.", "date 12th of March"], ["area I want a furnished apartment in San Jose.", "area San Jose"], ["What is their phone number?", ""], ["I would like to schedule a visit. It sounds good.", ""], ["This Saturday would work better.", "date This Saturday"], ["Thank you, no.", ""], ["I am looking for an apartment with one bathroom. I should allow pets.", ""], ["number_of_beds I need two bedrooms.", ""], ["area Yes, I have been looking at El Sobrante.", "area El Sobrante"], ["Yeah, that sounds great.", ""], ["Yes. Thanks a bunch.", ""], ["number_of_beds I need one bed room.", ""], ["I would like to schedule a visit on March 6th.", "visit_date March 6th"], ["Yes. Is this apartment furnished? Can you please provide me with a phone number?", ""], ["area I would like to live in San Leandro.", "area San Leandro"], ["Does the apartment come with furniture? Do you have a phone number for this property?", ""], ["Will you look for some other apartment options?", ""], ["I like the sounds of that apartment.", ""], ["I would like to schedule an appointment to visit this apartment.", ""], ["visit_date I would like to visit the apartment on March 3rd.", "visit_date March 3rd"], ["Do you have a phone number for the property? Does this apartment come with furniture?", ""], ["No. Thank you again", ""], ["Looking for apartment in Mountain View.", "area Mountain View"], ["number_of_beds I'm looking for apartment with 1 bedroom.", ""], ["Are there any otherS?", ""], ["I'd like that one.", ""], ["Please schedule a viewing.", ""], ["Change it to the 10th.", "date the 10th"], ["Any restrictions on the apartment.", ""], ["That would be all. Thanks", ""], ["I am moving to a new city for my job. Can you find me an apartment?", ""], ["number_of_beds I would like an apartment with three bed rooms.", ""], ["area I need the apartment to be in Fremont.", "area Fremont"], ["Can you tell me if the apartment is furnished or not? Can you tell me the property's phone number?", ""], ["I think I like this apartment.", ""], ["visit_date I am available to go there next Friday.", "visit_date next Friday"], ["Do you know if the property allows pets?", ""], ["number_of_beds area I was looking for an apartment with three bedrooms and located in Santa Rosa.", "area Santa Rosa"], ["Yes, that apartment sounds perfect. Can I please schedule a visit for the apartment. How about the 3rd?", "visit_date the 3rd"], ["Yes, that sounds good. Also, are pets allowed in the apartment and what is the property's phone number?", ""], ["number_of_beds area I'd like a three bedroom apartment in Brentwood.", "area Brentwood"], ["Could you give me some more options? It should have three baths.", ""], ["Sounds good. What's the number?", ""], ["Thanks. I'd like to schedule a visit.", ""], ["visit_date I'd like to schedule for the 8th of this month.", "visit_date 8th of this month"], ["Thank you. That's it for now.", ""], ["number_of_beds area Three bedrooms and in San Jose.", "area San Jose"], ["Are pets allowed in the apartment and does it come furnished?", ""], ["No, I need it to be on the 14th.", "date the 14th"], ["area number_of_beds I want an apartment in Morgan Hill. I need a one bedroom apartment.", "area Morgan Hill"], ["Yes, I would like to schedule a visit for the 6th of March.", "visit_date 6th of March"], ["I am looking for a apartment.", ""], ["number_of_beds area I am liking fremont and it should have 2 bedrooms and at least 1 bath.", "area fremont"], ["I would like to schedule a visit to that apartment.", ""], ["visit_date I would like to on the 8th of March.", "visit_date 8th of March"], ["Are pets allowed and does it come furnished?", ""], ["I am looking to move out of my share-house. Can you help me find a new apartment?", ""], ["area I'm interested in Cupertino.", "area Cupertino"], ["That sounds good, what's the phone number I can contact to inquire?", ""], ["Thank you. Any other apartments in the area?", ""], ["Thank you. Can you find me other apartments that also allow pets?", ""], ["That sounds like a good apartment. I would like to take a look at it. Can I visit it on the 8th of this month to check it out?", "visit_date 8th of this month"], ["Yeah that sounds good.", ""], ["area I want an apartment in Fairfield.", "area Fairfield"], ["number_of_beds I want three bed rooms in the apartment.", ""], ["Thanks. What's the phone number for the property?", ""], ["Okay. Can you find me some other apartments?", ""], ["This apartment sounds good.", ""], ["Yes, I want to schedule a visit to the apartment for March 12th.", "visit_date March 12th"], ["Yes, that sounds good. Is the apartment furnished, and are pets allowed in the apartment?", ""], ["Okay. Thanks a lot.", ""], ["No, that'll be all. Thanks a lot.", ""], ["number_of_beds I want 1 bedroom.", ""], ["area I am looking in the Cupertino area.", "area Cupertino"], ["Yes, please. Thanks.", ""], ["visit_date This Saturday works for me.", "visit_date This Saturday"], ["No, I'd like to visit on the 8th.", "visit_date the 8th"], ["Yes, sounds great.", ""], ["number_of_beds It should have 2 bed rooms and baths. also pet should allowed", ""], ["area I want in santa Rosa.", "area santa Rosa"], ["Yes that apartment looks good for me. Can you schedule the visit", ""], ["visit_date March 3rd.", "visit_date March 3rd"], ["Yes that's good. can you have contact number of the property? Is fully furnished apartment?", ""], ["I am looking for an apartment, and that in this apartment I can have pets.", ""], ["area I want it to have 3 bed rooms. And you need to be in Antioch.", "area Antioch"], ["Can you find me another apartment, one that has 2 bathrooms?", ""], ["Great. That's great.", ""], ["Yes I want.", ""], ["visit_date I want to visit next Tuesday.", "visit_date next Tuesday"], ["No, I prefer it on this Saturday.", "date this Saturday"], ["Yes, it's great. This furnished apartmen?.", ""], ["Great the way I need it.", ""], ["I want to find an apartment with three bedrooms and baths.", ""], ["area The apartment should be in Concord.", "area Concord"], ["Yes, I want to visit on the 10th of March.", "visit_date 10th of March"], ["Yes great! Are pets allowed in the apartment?", ""], ["No. Thank you", ""], ["number_of_beds area I'd like an apartment in Mountain View with 1 bed room.", "area Mountain View"], ["Do they allow pets at the apartment, and is it furnished?", ""], ["Can you look for some other apartments?", ""], ["Can you look for some more apartments?", ""], ["Right, that sounds like a great apartment.", ""], ["Sure, I would like to make an appointment to visit on 14th of this month.", "visit_date 14th of this month"], ["Right, that sound perfect.", ""], ["Thanks so much! I'm finished.", ""], ["I'm looking for a new apartment.", ""], ["number_of_beds area It should have one bed room and I want to move to San Jose.", "area San Jose"], ["Could you show me other apartments?", ""], ["I'm looking for something else that has two bed rooms and I would like to move to Union City.", "area Union City"], ["Can I bring any pets? Does the place have furniture?", ""], ["I'm interested in this apartment.", ""], ["visit_date I would like to visit on the 8th of this month.", "visit_date 8th of this month"], ["I would like to come on the 14th of March.", "date 14th of March"], ["Yes, awesome. Could I have the property's phone number?", ""], ["No, you have been very helpful thank you.", ""], ["I'm looking to find an apartment. Can you help find me one?", ""], ["area number_of_beds I want a one bed room apartment in South San Francisco.", "area South San Francisco"], ["Can you help find me some other apartments with one bath as well?", ""], ["Can you help find me some other apartments? I want to find a place where pets are allowed.", ""], ["Is the apartment furnished, and what is the property's phone number?", ""], ["Yes, this apartment sounds good.", ""], ["visit_date I would like to visit on the 4th of this month.", "visit_date 4th of this month"], ["No, I want to visit on the 12th.", "visit_date the 12th"], ["No, that's it. Thanks.", ""], ["I want to find an apartment in Corte Madera.", "area Corte Madera"], ["number_of_beds I want two bed rooms.", ""], ["Yes, that's good. I would like to schedule a visit to the view the apartment.", ""], ["visit_date I want to visit on March 6th.", "visit_date March 6th"], ["No, I would like to visit on the 3rd of this month.", "visit_date 3rd of this month"], ["Yes, that sounds good. Is the apartment furnished? What is the phone number?", ""], ["No, that is all. Thank you", ""], ["I need to find a pet-friendly apartment.", ""], ["number_of_beds It should have two bedrooms, 1 bathroom.", ""], ["Okay, can I get the phone number? Oh, is it furnished?", ""], ["Can you find me some other options?", ""], ["No, on second thought I want to visit on March 9th.", "visit_date March 9th"], ["Yes, perfect. Is the apartment furnished?", ""], ["What's the phone number?", ""], ["Thanks. That's all I need, thank you.", ""], ["Hey, I'm thinking of moving out. Can you find me a three baths apartment?", ""], ["number_of_beds Three bedrooms, please.", ""], ["area In San Jose.", "area San Jose"], ["Are pets allowed in there? Do you have the property's phone number?", ""], ["Can you find another one?", ""], ["This one sounds very good. I want to schedule a visit for March 7th. Can you arrange that?", "visit_date March 7th"], ["Yes, that's it. Do you know if pets are allowed in the apartment?", ""], ["Thanks very much. That's all, for now.", ""], ["I want to find an apartment that has 2 baths.", ""], ["number_of_beds I just want one.", ""], ["area Santa Clara please.", "area Santa Clara"], ["OK, that one sounds good. I would like to schedule a visit to see it.", ""], ["visit_date I am free to see it this Saturday.", "visit_date this Saturday"], ["Yeah, that's right.", ""], ["Thank, I appreciate it.", ""], ["I am new in town and would like to find an apartment to rent.", ""], ["area number_of_beds I would like to live in the city of Vacaville and I only need a 1 bedroom apartment.", "area Vacaville"], ["That apartment sounds very good.", ""], ["Yes, I would like to visit on the 11th.", "visit_date the 11th"], ["No that was wonderful. Thank you very much.", ""], ["Do you have any apartments with four bedrooms?", ""], ["That one sounds interesting.", ""], ["I am available the 6th of this month.", "date 6th of this month"], ["Can we change it to the 12th of this month.", "date 12th of this month"], ["Thank so much.", ""], ["No, Thank you.", ""], ["I need a 2 bedroom apartment.", ""], ["area I want one in Newark.", "area Newark"], ["Yes, what is the property's phone number?", ""], ["Thanks! That's all I needed.", ""], ["area number_of_beds I'm looking for an apartment in Milpitas. It should have 1 bedroom and at least 1 bath.", "area Milpitas"], ["That apartment sounds good. I'd like to schedule a visit on the 5th of March.", "visit_date 5th of March"], ["Yes. Sounds good. Is the apartment furnished? What is the property's phone number?", ""], ["area number_of_beds I want a one bed room in San Jose.", "area San Jose"], ["Yes, I'd like to visit today.", "visit_date today"], ["Yes, are pets allowed?", ""], ["Please help me to get an apartment.", ""], ["Do you have the property's contact number?", ""], ["Is there any restrictions like pets are not allowed in the apartment? Do we need to have furnish or its a furnished one?", ""], ["I wish to have my pets in the apartment. Please can me find me something else which allows pets?", ""], ["Great! It sounds good.", ""], ["visit_date Please schedule it today.", "visit_date today"], ["Sorry, Please can you reschedule to visit by March 10th.", "visit_date March 10th"], ["Yup! that's great.", ""], ["Thank you so much. I got all the details whatever needed.", ""], ["I need an apartment and need well furnished apartment.", ""], ["area number_of_beds I need an apartment in Santa Clara. Should have 2 bed rooms.", "area Santa Clara"], ["Please, can you look for other apartment? i need to have 1 bed rooms.", ""], ["That apartment will be best.", ""], ["Yes, i need to schedule, I want to visit on next Thursday.", "visit_date next Thursday"], ["That's sounds good.", ""], ["Does that apartment allowed the pets?", ""], ["That's all I need. Thanks a lot.", ""], ["Can you find me an apartment that allows pets?", ""], ["number_of_beds I'm looking for a 2 bedroom apartment.", ""], ["Could I have their telephone number?", ""], ["That sounds like what I am looking for.", ""], ["visit_date I would like to schedule a viewing on the 1st.", "visit_date the 1st"], ["No, do they have any available appointments on the 7th of March?", "date 7th of March"], ["Can you find me and my pet an apartment with one bath?", ""], ["number_of_beds area I want an apartment with 2 bed rooms in Walnut Creek.", "area Walnut Creek"], ["Is the apartment furnished? What's the property's phone number?", ""], ["This apartment is perfect.", ""], ["visit_date On March 5th.", "visit_date March 5th"], ["No, I want to visit the property on 10th of this month.", "visit_date 10th of this month"], ["No, I'm fine. Thank you.", ""], ["I need to move out of my parent's house. I really want to find my own apartment.", ""], ["That's great! Two questions, though. Does the apartment come fully furnished? Also, are pets allowed?", ""], ["That apartment sounds great! I would like to schedule a visit, please.", ""], ["visit_date I'm hoping to visit on March 3rd.", "visit_date March 3rd"], ["Hello, I need to find an apartment suitable for a small family. It should have 4 bedrooms and 3 baths.", ""], ["area The SFO area.", "area SFO"], ["I am sorry. That is a little pricey. Can you look for something with 2 bedrooms instead?", ""], ["That is still a bit too high. Can you look for something with 2 baths?", ""], ["Yes. That sounds great. Can I scheduled a visit for the 9th of March?", "visit_date 9th of March"], ["Sorry. I mean the 8th of this month.", "date 8th of this month"], ["Yes that sounds great. Do you know if the apartment is furnished? What is their phone number?", ""], ["number_of_beds area 2 Bedrooms in Pleasant Hill.", "area Pleasant Hill"], ["What's their number? Do they allow pets?", ""], ["Can you schedule an apartment visit on the 4th of March?", "visit_date 4th of March"], ["Actually make that the 9th of this month.", "date 9th of this month"], ["Yes that's good.", ""], ["Thanks that's all.", ""], ["What are the other options?", ""], ["Does the property allow pets?", ""], ["Sure, that apartment sound fine to me.", ""], ["Yes, I would like to visit the apartment.", ""], ["visit_date I would like to schedule for the 3rd of this month.", "visit_date 3rd of this month"], ["Actually, I would like to schedule for the 11th.", "date the 11th"], ["No, I'm good. thank you.", ""], ["Can you help me find an apartment that will allow pets? I'm thinking of moving out", ""], ["number_of_beds area I think I want at least four bedrooms. Can you look in Fremont? That seems like a nice area", "area Fremont"], ["That sounds great, can you book me in to visit?", ""], ["visit_date March 6th please.", "visit_date March 6th"], ["Yes please, thank you.", ""], ["Do you know if the apartment is furnished? I might need to call them.. can you get me their number please?", ""], ["Lovely, thank you.", ""], ["Not right now, thank you.", ""], ["I'd like to find a new apartment.", ""], ["area Yes. I'd like and apartment with 3 bathrooms located in San Mateo.", "area San Mateo"], ["number_of_beds I'd like one with two bedrooms and two bathrooms.", ""], ["Can you give me some other options?", ""], ["This one sounds perfect. I'd like you to schedule a visit to the apartment on 1st of March.", "visit_date 1st of March"], ["Correct! Do you know if they are pet friendly?", ""], ["Can you tell me if the apartment is furnished?", ""], ["Thanks for everything.", ""], ["Nope. Thats all. Thanks!", ""], ["Are there any others?", ""], ["visit_date Next Monday.", "visit_date Next Monday"], ["No, on 6th of March.", "date 6th of March"], ["Yes please. What is the phone number there?", ""], ["I would like to find a one bedroom apartment.", ""], ["area I would like to find a place in Concord.", "area Concord"], ["That apartment sounds good. Can I schedule an appointment to look at it?", ""], ["visit_date I would like to look at it on March 1st.", "visit_date March 1st"], ["Yes, that sounds great. Does the property allow pets?", ""], ["No, thank you very much.", ""], ["I would like to look for an apartment?", ""], ["number_of_beds area I prefer an apartment in the Petaluma area. I want it to have one bedroom and one bathroom.", "area Petaluma"], ["Can I get the phone number for that? Also, are pets allowed?", ""], ["Can you help me find an apartment that allows pets?", ""], ["Yes, I would like to. Schedule it for March 12th please.", "visit_date March 12th"], ["I'm on the hunt for a new apartment.", ""], ["Great start, are there any other suitable ones?", ""], ["Be good to have one more to compare with.", ""], ["That sounds like a good one actually, can I arrange a visit?", ""], ["visit_date Next Wednesday if that's possible.", "visit_date Next Wednesday"], ["Great. One other thing, is it furnished?", ""], ["Have you got a phone number for it please?", ""], ["number_of_beds area Can you look up three bedroom apartments in Campbell?", "area Campbell"], ["Can you see what's available with only 1 bathroom, and I also need somewhere that is pet friendly.", ""], ["Can you look up more please?", ""], ["Does this apartment already come furnished?", ""], ["Okay, well that apartment sound great.", ""], ["I want to find an apartment with one bath.", ""], ["area I want to live in Campbell.", "area Campbell"], ["number_of_beds I would like one bedroom.", ""], ["Can you find me other apartments? I am looking for three bathrooms and pets allowed.", ""], ["What is their phone number? Is the apartment furnished?", ""], ["Okay, sounds good.", ""], ["Please schedule a visit to the apartment on the 8th of March.", "visit_date 8th of March"], ["No. Schedule the visit for March 10th.", "visit_date March 10th"], ["I need an apartment. Can you help me?", ""], ["number_of_beds 1 will be fine.", ""], ["area I want it in South San Francisco. Find one that allows pets with 1 bath room", "area South San Francisco"], ["Can you give me its number?", ""], ["I like it.", ""], ["Thank you, bye.", ""], ["I'm looking for a one bedroom apartment.", ""], ["area In San Jose please.", "area San Jose"], ["Can you find me something else? I need three baths.", ""], ["visit_date How about on the 11th of this month?", "visit_date 11th of this month"], ["Yes please. Do they allow pets?", ""], ["Nope that's it for now.", ""], ["I'm looking for a 1 bedroom apartment.", ""], ["area I'm looking for something in San Leandro.", "area San Leandro"], ["Could you find me a different one please?", ""], ["Are pets allowed in the apartment? What is the property?s telephone?", ""], ["Could you please find me another apartment?", ""], ["this sound good. Could you schedule me an appointment to visit the property please?", ""], ["No, thanks, that's all.", ""], ["number_of_beds area I need at least four bed rooms, and I want it to be in San Rafael.", "area San Rafael"], ["Yes ma'am sounds good to me.", ""], ["Can you please give me the phone number for the property and do you know if these apartments allow pets? I forgot to asked that.", ""], ["That's okay, well thank you for all your help.", ""], ["No ma'am that will be all thank you again.", ""], ["I would like to find an apartment, please have at least 1 bath.", ""], ["area I would like the apartment to be in Palo Alto, I should also include 1 bed room.", "area Palo Alto"], ["Is the apartment furnished? Are pets allowed?", ""], ["I would like to schedule a visit to this apartment.", ""], ["visit_date I would like to visit on Saturday this week.", "visit_date Saturday this week"], ["Yes that would be good.", ""], ["what is the property's phone number?", ""], ["No, that would be all. Thank you", ""], ["Can you find me a 2 bedroom apartment?", ""], ["area I'd like a pet-friendly apartment in Rio Vista.", "area Rio Vista"], ["Can you find me other options?", ""], ["Is it furnished? Can you give me the phone number?", ""], ["That place sounds great.", ""], ["Yes, I'd like to schedule a visit.", ""], ["visit_date I'd like to visit on the 5th of this month.", "visit_date 5th of this month"], ["Thanks, that'll be all.", ""], ["Are Pets allowed in this apartment?", ""], ["This apartment really sounds very good.", ""], ["Yes i am interested to schedule a visit to the property.", ""], ["visit_date I am planning to visit on this Sunday.", "visit_date this Sunday"], ["Thanking you very much.", ""], ["No thank you very much.", ""], ["I want to find an apartment that has 3 baths and allows pets.", ""], ["area number_of_beds Look for a two bed room apartment in Concord.", "area Concord"], ["Can you find me apartments with 1 bed room?", ""], ["Perfect. Please schedule a visit to the apartment on the 6th of March.", "visit_date 6th of March"], ["What is the apartment property's phone number?", ""], ["Thanks! That's all I need.", ""], ["area I want in Vacaville, also pets should be allowed.", "area Vacaville"], ["can you find some other apartments?", ""], ["Yes that's good for me.", ""], ["yes I want to schedule visit.", ""], ["visit_date I want to visit on 13th of this month.", "visit_date 13th of this month"], ["yes that sounds good.", ""], ["can you provide me the contact number of the property. Is furnished?", ""], ["That's all I need. thanks", ""], ["I want an apartment.", ""], ["number_of_beds 2 bedrooms and 1 bath.", ""], ["area Palo Alto.", "area Palo Alto"], ["The apartment sounds good to me.", ""], ["Yes, I would like to visit it on the 7th.", "visit_date the 7th"], ["Excellent. What is the apartment complex's phone number? Are pets allowed?", ""], ["I need a place to live. Any apartments nearby?", ""], ["area number_of_beds An apartment in Suisun City with 3 bedrooms suits my needs.", "area Suisun City"], ["What phone number should I dial if I want to learn more about the apartment?", ""], ["That sounds great. I want to arrange a visit to the apartment to get a better idea of what it's like.", ""], ["visit_date On the 14th sounds good to me.", "visit_date the 14th"], ["Indeed I do.", ""], ["Many thanks.", ""], ["Not at the moment. Thank you very much.", ""], ["area number_of_beds I want to have three bedrooms at an apartment in Concord.", "area Concord"], ["I'd like you to find me some more two bedroom apartments.", ""], ["I want you to find me more 1 bath apartments.", ""], ["That apartment sounds great. I want to visit it.", ""], ["visit_date I'd like to visit the 13th of March.", "visit_date 13th of March"], ["That would be great. Tell me the phone number for the property please.", ""], ["number_of_beds area The apartment should have 1 bedroom. I would like an apartment in the San Jose area.", "area San Jose"], ["Does this apartment allow pets?", ""], ["Is the apartment already furnished? Can I get the property's phone number, please?", ""], ["That one sound like a good fit for me. I would like to schedule a walk through with that apartment.", ""], ["visit_date I would like to visit them on March 10th.", "visit_date March 10th"], ["No, but thank you.", ""], ["I want to find an apartment to move to.", ""], ["number_of_beds It should have 3 bedrooms.", ""], ["area I want the apartment to be in the Mountain View area.", "area Mountain View"], ["What is the phone number of the property? Is the apartment furnished?", ""], ["Can you find other apartments for me?", ""], ["I want to schedule a visit to the apartment on the 10th.", "visit_date the 10th"], ["That sounds great, but I need to know if the apartment is furnished and if pets are allowed.", ""], ["I have a pet and I want that apartment whom allow pets.", ""], ["area number_of_beds I want apartment in livermore with only 2 bedroom and 1 baths.", "area livermore"], ["I want to contact apartment by which phone number? I need only furnished apartment", ""], ["I know that the apartment sound good.", ""], ["Yes schedule is required to visit property.", ""], ["From my family issues I drop plan on the 6th.", "date the 6th"], ["I like that good sounds.", ""], ["Thanks for helping me lot that I need.", ""], ["I'm after an apartment with 3 baths.", ""], ["area number_of_beds I'm looking in Newark, and it should have 4 bedrooms.", "area Newark"], ["Does it come furnished? What's their contact number?", ""], ["Sounds good, can you schedule a visit?", ""], ["Can you change that to this Sunday?", "date this Sunday"], ["Yes, thank you. Can you check if it's pet friendly?", ""], ["I want to search an apartment.", ""], ["number_of_beds It must have one bed room and and 2 bathrooms.", ""], ["area I need it in Walnut creek.", "area Walnut creek"], ["Yeah that sounds good. I need to visit that apartment at 12th of this month.", "visit_date 12th of this month"], ["Yes that'd be great.", ""], ["Thanks. That's all I need.", ""], ["area I want an apartment in South San Francisco.", "area South San Francisco"], ["number_of_beds It should be pet friendly with 1 bed room and 1 bath.", ""], ["Can you find me other apartments? I want a 4 bed room apartment in Campbell.", "area Campbell"], ["Yes I want to schedule an visit for tomorrow.", "visit_date tomorrow"], ["number_of_beds area I want an apartment in San Leandro with 2 bedrooms.", "area San Leandro"], ["What's a phone number I can use to contact?", ""], ["Are there any other apartments you can find for me?", ""], ["Are there any other apartment you can find for me?", ""], ["The apartment sounds good and I want to schedule an appointment.", ""], ["visit_date This Saturday will be good.", "visit_date This Saturday"], ["That sounds good. Is the apartment furnished?", ""], ["That will be it. Thanks a lot.", ""], ["area number_of_beds Just 1 bedroom in Fremont.", "area Fremont"], ["visit_date I'd like to visit on March 11th.", "visit_date March 11th"], ["Sorry, I want to go on the 14th.", "date the 14th"], ["I'd like to find an apartment in El Cerrito.", "area El Cerrito"], ["number_of_beds I'd prefer four bedrooms.", ""], ["Is that apartment pet friendly? Is it furnished or unfurnished?", ""], ["Yes, I'd like to check it out.", ""], ["Yes, that is correct. Can you tell me the property's phone number please.", ""], ["nope, that was all thanks.", ""], ["area Can you look at Concord?", "area Concord"], ["number_of_beds Three bedrooms please.", ""], ["Sounds good. I want to see it at March 10th", "visit_date March 10th"], ["No. I want to go on Wednesday next week", "date Wednesday next week"], ["I want to find a 1 bedroom apartment.", ""], ["area I want an apartment in Petaluma.", "area Petaluma"], ["Can you find me other apartments. They should have 2 baths and be located in Fremont.", "area Fremont"], ["Can you find me other pet friendly apartments?", ""], ["Yes, I would like to visit on March 4th.", "visit_date March 4th"], ["Yes that sounds good. What is the phone number of the property?", ""], ["I want an apartment that is allowed to have pets.", ""], ["area I want an apartment that is already furnished. An apartment in Lafayette", "area Lafayette"], ["I want to find an apartment. I want an apartment with only one bathroom. I want an apartment in FairField.", "area FairField"], ["What is the telephone number for this property?", ""], ["Wow this apartment seems to be very suitable for me.", ""], ["Yes, that's exactly what I want.", ""], ["Thank you so much for everything. That was what I was looking for.", ""], ["Can you find a pet friendly apartment?", ""], ["number_of_beds area Fully furnished, three bed rooms and three baths in San Jose.", "area San Jose"], ["Can you find me another apartment with two baths?", ""], ["Can you find me a 1 bed room apartment?", ""], ["Yes, that is a good apartment.", ""], ["Yes,I would like to visit on the 12th of this month.", "visit_date 12th of this month"], ["No, the visit should be on the 3rd.", "visit_date the 3rd"], ["Yes, please give me the phone number.", ""], ["I'm moving to the area and am interested in finding an apartment that has two baths. I have a large family.", ""], ["number_of_beds I am married and have one son. We are interested in finding an apartment that has two bedrooms.", ""], ["area I would like to live close to San Jose. This is close to many things that I am interested in.", "area San Jose"], ["We have pets. Are they allowed at this location? What is a number that I can call to speak with someone?", ""], ["I think I better look at some other apartments. Can you look again for me?", ""], ["That is a bit high. Can you keep looking for me? I appreciate it.", ""], ["Great! That apartment sounds just right.", ""], ["Yes, that would be great! Let's schedule a visit.", ""], ["visit_date I would prefer to visit on the 14th of March.", "visit_date 14th of March"], ["Perfect. Another question. Will the apartment come furnished with living room and bedroom furniture?", ""], ["May I have the phone number for the apartments please?", ""], ["This has been very helpful. Thank you so much!", ""], ["No. Thank you again!", ""], ["number_of_beds area I'd like a furnished apartment in Campbell with 1 bed room.", "area Campbell"], ["Can I have the property's phone number?", ""], ["I would like to find an apartment in the area.", ""], ["area The apartment I'm looking for should have three baths and be located in San Jose.", "area San Jose"], ["number_of_beds The apartment should have 4 bed rooms.", ""], ["Thank you, I would like to rent that apartment.", ""], ["Yes, I would like to schedule a visit.", ""], ["visit_date I request a visit on the 1st of this month.", "visit_date 1st of this month"], ["Perfect, but is the apartment furnished?", ""], ["Thank you for your assistance, I have all the information I need.", ""], ["I'm looking for an apartment that has two baths.", ""], ["number_of_beds area It should have 3 bedrooms, and should be in Foster City.", "area Foster City"], ["That sounds good, I'd like to schedule a visit to the apartment.", ""], ["visit_date 10th of March should be fine.", "visit_date 10th of March"], ["Yes, that is correct. It sounds good. Is the apartment furnished?", ""], ["area number_of_beds I would like a 2 bedroom apartment in Santa Clara.", "area Santa Clara"], ["Could you find me some more options?", ""], ["Could you find me some more apartments? I would like one bath and pets should be allowed.", ""], ["What is the phone number? And is it furnished?", ""], ["Great, this apartment sounds good. I would like to schedule an appointment to visit the apartment on the 9th.", "visit_date the 9th"], ["No, I would like to visit on the 4th.", "visit_date the 4th"], ["I need a 2 bedroom apartment with 2 baths.", ""], ["area I want a pet friendly apartment in Santa Rosa.", "area Santa Rosa"], ["I would also like to see apartments in Campbell.", "area Campbell"], ["Is the apartment furnished and what is the contact number?", ""], ["Can I another choice?", ""], ["This apartment is suitable.", ""], ["Yes, I want to book a tour to see it.", ""], ["visit_date Please book for the 11th of this month.", "visit_date 11th of this month"], ["Actually, I want to see it on the 8th.", "date the 8th"], ["Yes, I confirm that.", ""], ["Thank you that is great.", ""], ["No that is all today.", ""], ["Hello I'm here to search for an apartment.", ""], ["area number_of_beds I prefer Santa Clara with 3 bed rooms.", "area Santa Clara"], ["I think this works for me. Would you mind scheduling this apartment visit tomorrow.", "visit_date tomorrow"], ["Perfect. I would like to know the phone number and are they willing to allow pets to the apartment?", ""], ["I need to locate an apartment. Can you help?", ""], ["area number_of_beds Let's start with a three bedroom apartment in Menlo Park.", "area Menlo Park"], ["Ok, let's look at some other apartments that have just 1 bathroom.", ""], ["Are they pet friendly?", ""], ["OK do they come furnished? Are pets allowed?", ""], ["visit_date The 10th of March is a good day.", "visit_date 10th of March"], ["What is the main number for the property?", ""], ["Thank you. That will be all for today.", ""], ["area number_of_beds It should be a 2 bedroom in Santa Rosa.", "area Santa Rosa"], ["What's the number of the place?", ""], ["visit_date How about the 10th of March?", "visit_date 10th of March"], ["Yup sounds great. Is it furnished?", ""], ["I'm looking for a 2 bath apartment to rent. Can you help me?", ""], ["No, Thanks a lot.", ""], ["area I would like to look in San Leandro for an apartment with one bathroom.", "area San Leandro"], ["number_of_beds I am looking for a one bedroom apartment.", ""], ["Can you find me some more options? I need one that allows pets.", ""], ["Can you tell me the phone number? Is the apartment furnished?", ""], ["What else did you find?", ""], ["Yes, that sounds good. Is the apartment furnished? What is the property's phone number?", ""], ["Thank you! I'm all set now.", ""], ["Hello. I'm currently looking for a new apartment. Can you please help me look for one?", ""], ["Where there any other options I can look at? How about apartments in Vacaville?", "area Vacaville"], ["Is the apartment furnished and are any pets allowed?", ""], ["Can I look at some other apartments?", ""], ["That apartment is sounding pretty good.", ""], ["No sorry. Can I change the date to the 11th.", "date the 11th"], ["Yes, that sounds good. Also, is the apartment furnished and what was the property's phone number?", ""], ["Thank you so much,.", ""], ["I'm looking for apartments near Sunnyvale.", "area Sunnyvale"], ["number_of_beds I need a 1 bedroom, preferably in San Jose.", "area San Jose"], ["Does the apartment come furnished? Also, are pets allowed?", ""], ["visit_date I have time on the 10th.", "visit_date the 10th"], ["I appreciate the help. Thanks", ""], ["area Search in Benicia.", "area Benicia"], ["Yes, i want to visit on March 12th.", "visit_date March 12th"], ["I'm looking around for a new apartment. Can you help me find one?", ""], ["area number_of_beds Petaluma is a great neighborhood. It would be great if the apartment has 2 bedrooms.", "area Petaluma"], ["Thanks a lot. That is all I needed.", ""], ["I want to find a three bed room apartment.", ""], ["area The apartment should be located in Berkeley.", "area Berkeley"], ["Can I get the property phone number and are pets allowed?", ""], ["I will try this apartment.", ""], ["visit_date Lets schedule for the 1st.", "visit_date the 1st"], ["Yes. Is it a furnished apartment.", ""], ["area It needs to be in San Rafael, and they should allow pets.", "area San Rafael"], ["number_of_beds It must have 4 bed rooms and furnished preferably.", ""], ["No that is all.", ""], ["I am looking for an apartment in Suisun City.", "area Suisun City"], ["number_of_beds We need 2 bed rooms.", ""], ["The apartment sounds good. I would like to arrange an inspection.", ""], ["Sorry, no I would like to inspect the property on the 4th of this month.", "visit_date 4th of this month"], ["Could you tell me the property's phone number?", ""], ["Thank you. Thanks all the information I need for now.", ""], ["number_of_beds area I am looking for a two bedroom apartment in Fremont, one that would allow pets.", "area Fremont"], ["That sounds like a good option.", ""], ["visit_date March 11th works best for me to visit the property.", "visit_date March 11th"], ["No, not at this time. Thank you.", ""], ["I would like to find a three bedroom apartment.", ""], ["area Iwant a pet-friendly apartment in Sunnyvale.", "area Sunnyvale"], ["What is the phone number of the property? Is the apartment fully furnished>", ""], ["Can you locate some more apartments with four bed rooms and three bath rooms>.", ""], ["Yes, that apartment works. I would like to schedule a visit.", ""], ["visit_date I would like to visit on the 4th of March.", "visit_date 4th of March"], ["Yes, that is correct. What is the phone number of the property? Is the apartment fully furnished?", ""], ["I am searching an apartment which should have atleast one baths.", ""], ["area The apartment should be in Vallejo.", "area Vallejo"], ["number_of_beds The apartment should have atleast two bed rooms and Pets should be allowed.", ""], ["Please find some other apartment that should have 3 bed rooms.", ""], ["I think that apartment is a good choice.", ""], ["I want to visit a schedule on March 3rd.", "visit_date March 3rd"], ["Thanks for you.", ""], ["I wanna find an apartment with three bed rooms in Santa Clara.", "area Santa Clara"], ["How about apartments that have 2 bed rooms?", ""], ["How about one with 2 baths?", ""], ["Great. Are pets allowed there by the way?", ""], ["I would like to find an apartment with two baths.", ""], ["That one sounds nice, can I schedule an appointment to look at it?", ""], ["visit_date Please schedule it for the 6th of this month.", "visit_date 6th of this month"], ["Yes, that sounds great, thank you.", ""], ["Does the apartment allow pets? Is it furnished?", ""], ["number_of_beds area I want an apartment in Martinez with 4 rooms.", "area Martinez"], ["Any other apartments with 2 rooms?", ""], ["Schedule me a visit to that apartment on March 8th.", "visit_date March 8th"], ["No make it next Tuesday.", "date next Tuesday"], ["Yes I confirm, what is their phone number?", ""], ["I want to find an apartment in Hayward where pets are allowed.", "area Hayward"], ["number_of_beds With two bed rooms.", ""], ["I would like to see other options with two baths.", ""], ["Can you give me the phone number of that place?", ""], ["I would like you to find me another apartments with 3 baths and furniture.", ""], ["This apartment sound nice.", ""], ["visit_date On Saturday this week.", "visit_date Saturday this week"], ["Yes, thank you.", ""], ["number_of_beds I need 3 bed rooms.", ""], ["area An apartment in San Rafael would be great.", "area San Rafael"], ["Could you please search for some different apartments?", ""], ["Mind looking for some other apartments? I need 1 bath.", ""], ["What is the number to the apartment? Does it come with furniture?", ""], ["Yeah, set up a visit.", ""], ["visit_date I'd like to go there on the 14th.", "visit_date the 14th"], ["I am looking for an apartment with two baths.", ""], ["area number_of_beds I want an apartment in Union City with two bed rooms.", "area Union City"], ["Okay, that apartment sounds good.", ""], ["Yes, that is correct. Is the apartment furnished?", ""], ["Thank you! That's all I need.", ""], ["number_of_beds I would like a three bedroom.", ""], ["area I would like a three bath apartment in san rafael.", "area san rafael"], ["yes that is right.", ""], ["thank you.", ""], ["area number_of_beds I want 3 bedrooms and I want to live in Fairfield.", "area Fairfield"], ["Are pets allowed in this apartment? Also, what's the property's phone number?", ""], ["Ok, that apartment sounds good. I want to schedule a visit for the 12th of this month.", "visit_date 12th of this month"], ["No, I actually want to go on the 14th of March.", "date 14th of March"], ["Yeah that sounds good, also does this apartment come furnished or no?", ""], ["Thanks that was all.", ""], ["area I really like the San Jose area.", "area San Jose"], ["number_of_beds I only need 1 bedroom.", ""], ["How about some others?", ""], ["Can I have pets?", ""], ["Okay, that apartment's fine.", ""], ["Thanks for setting that up.", ""], ["number_of_beds area I'm looking for a four bedroom, three bath apartment in Redwood City, California.", "area Redwood City, California"], ["Is the apartment furnished, and do they allow pets?", ""], ["Do you have any others?", ""], ["visit_date On the 2nd of March.", "visit_date 2nd of March"], ["Can I visit on March 10th instead?", "visit_date March 10th"], ["Do they allow pets, and is it furnished?", ""], ["number_of_beds Please search for a 1 bedroom in Walnut Creek.", "area Walnut Creek"], ["Can you find me some others?", ""], ["What is the phone number? Is the apartment furnished?", ""], ["Yes, that's correct, thank you.", ""], ["area I need an apartment in Campbell that allows pets.", "area Campbell"], ["Is there an others. I want it in Fairfield with one bath.", "area Fairfield"], ["Does the apartment come Furnished?", ""], ["Yes that sounds good. I would like to visit it on March 11th.", "visit_date March 11th"], ["What is the contact number for the property?", ""], ["number_of_beds I need two bedrooms and two bathrooms.", ""], ["area I would like it to be in San Jose.", "area San Jose"], ["Okay, that apartment sounds fine.", ""], ["Yes, please schedule a visit.", ""], ["visit_date I want to go today.", "visit_date today"], ["Yes, please. Does the apartment allow pets? What is their contact number?", ""], ["I just moved to this city for a new job, and I need to find an apartment.", ""], ["number_of_beds It would be perfect with at least two bed rooms.", ""], ["visit_date Yes, the 4th of this month should be a perfect date.", "visit_date 4th of this month"], ["Yes, I confirm! Just another detail, is the apartment furnished?", ""], ["Perfect! Actually that's all I need to know. We will be in touch if I'll need something else.", ""], ["number_of_beds area I want an apartment in Dublin with 2 bedrooms.", "area Dublin"], ["Can you find me some others? I want them to have one bath.", ""], ["visit_date I want to go on the 4th of this month.", "visit_date 4th of this month"], ["No, I want to visit on the 3rd.", "visit_date the 3rd"], ["Thanks, that's everything.", ""], ["number_of_beds area The apartment should have three bed rooms. I would like to be situated in Pleasant Hill.", "area Pleasant Hill"], ["What is the phone number of your property? Are animals allowed in the house?", ""], ["Yes that property sounds good.", ""], ["Yes I want to plan a date to visit the property. It would be on 9th of this month.", "visit_date 9th of this month"], ["Thank you. That is all for now.", ""], ["area Search for apartment in Santa Clara.", "area Santa Clara"], ["number_of_beds Three bed rooms.", ""], ["I wish to find an apartment located in San Jose.", "area San Jose"], ["number_of_beds The place should have 1 bed rooms.", ""], ["Can you find me other apartments where pets are allowed?", ""], ["Are you able to find other apartments?", ""], ["Yes the apartment sounds great. I wish to schedule a visit to the apartment on the 9th.", "visit_date the 9th"], ["Yes that sounds great. Please do tell me the property's phone number.", ""], ["number_of_beds I'd like an apartment with two bedrooms.", ""], ["area The apartment should be located in San Jose.", "area San Jose"], ["That won't work. Can you find another apartment that allows pets. It should have 1 bathroom.", ""], ["Yes, that'd be great.", ""], ["visit_date I'd like to visit it on the 12th of this month.", "visit_date 12th of this month"], ["No, I've changed my mind. I'd like to visit on the 1st of this month instead.", "visit_date 1st of this month"], ["Yes that's great. What's the phone number for this apartment? And is it furnished?", ""], ["Thank you for the help. That's all that I need help with for now.", ""], ["I am looking for an apartment with one bath.", ""], ["It it furnished? Are pets allowed?", ""], ["Did you find anything other apartments?", ""], ["Great. I would like to schedule a visit on March 8th.", "visit_date March 8th"], ["Yes, that's it. Are pets allowed?", ""], ["Is it furnished? What's the contact number?", ""], ["That's it for now. Thanks.", ""], ["number_of_beds I need 3 bedrooms.", ""], ["What's the phone number? Do they allow pets?", ""], ["I need information about an apartment.", ""], ["number_of_beds I need 3 bed rooms apartment.", ""], ["area In San jose.", "area San jose"], ["Is the apartment is fully furnished. Is there any restrictions for pets there?", ""], ["Please get me details about some other apartments.", ""], ["I need furnished apartment, can you find something like that?", ""], ["Yes, fix it.", ""], ["visit_date on the 6th.", "visit_date the 6th"], ["Yes, thats good, please also confirm about pets allowed or not and get me contact details.", ""], ["I am looking for a two bathroom apartment.", ""], ["Great. Could you search for some other apartments?", ""], ["Do you have a phone number for the property and is it furnished?", ""], ["Sounds great. I'd like to schedule a tour on Wednesday next week.", "visit_date Wednesday next week"], ["Thanks for your help, that's all I needed.", ""], ["I need an apartment with one bed rooms.", ""], ["area I'd like to find it in San Jose.", "area San Jose"], ["Are animals allowed?", ""], ["No, I prefer on 8th of March.", "date 8th of March"], ["Yes, It's perfect. Can you find the phone number?", ""], ["I'm looking for an apartment with two baths, help me out.", ""], ["Is there anything else, I actually want three baths, sorry.", ""], ["Okay, that apartment fits what I need.", ""], ["Yeah, can you set that up for the 11th of this month.", "date 11th of this month"], ["No, I actually want to go on the 13th of March.", "date 13th of March"], ["Thanks so much, that's it for now.", ""], ["I am looking to move soon and currently apartment hunting can you help?", ""], ["number_of_beds area I am looking for a one bedroom, one bathroom, I live alone. Also, I want to live in Brentwood.", "area Brentwood"], ["What is the property's phone number? I'd like to learn more.", ""], ["Is the apartment furnished? I am not looking to buy new furniture. Also I have a dog. Are pets allowed?", ""], ["That sounds great! I want to visit the apartment. Can you schedule a visit for the 8th of this month.", "visit_date 8th of this month"], ["Yes! Perfect.", ""], ["Are pets allowed? I have a pet.", ""], ["Is the apartment furnished. Again, I do not want to purchase furniture. Can I get the property's phone number?", ""], ["Thanks! I do not need anything else.", ""], ["I would like to find an apartment with three baths.", ""], ["area I need to find an apartment in Castro Valley.", "area Castro Valley"], ["Can we explore apartments in Concord?", "area Concord"], ["Are pets allowed in this apartment? What's the property's phone number?", ""], ["All right, that apartments sounds good.", ""], ["Yes, please! Can you schedule a visit for the 10th of March?", "visit_date 10th of March"], ["That sounds great! By the way, does the apartment come furnished?", ""], ["No, that's all. Thank you so much!", ""], ["area I would like one in San Pablo.", "area San Pablo"], ["number_of_beds I would like three bedrooms please.", ""], ["What's the phone number? And are pets allowed?", ""], ["Yes, please schedule a visit for me.", ""], ["visit_date I would like to visit on the 8th of March.", "visit_date 8th of March"], ["Never mind, I want to visit on the 10th of this month instead.", "visit_date 10th of this month"], ["Yes, that would be great. Is the apartment already furnished?", ""], ["Thanks again, that'll be all for today.", ""], ["Will you help me find an apartment with 3 bedrooms?", ""], ["area Sunnyvale.", "area Sunnyvale"], ["visit_date The 12th.", "visit_date The 12th"], ["Thanks. That's all.", ""], ["I'm looking for an apartment with 4 bedrooms.", ""], ["area Somewhere in Cotati.", "area Cotati"], ["I am interested in this apartment.", ""], ["Yes schedule one for later today.", "date later today"], ["What is the phone number for the property?", ""], ["number_of_beds area I'd like two bed rooms and one bath. I'd like the apartment to be in Rohnert Park.", "area Rohnert Park"], ["Yep, that sounds great. Can you give me their phone number? Also, do they allow pets?", ""], ["Nope, that is all, thanks much.", ""], ["Find me an apartment in Fremont that has four bed rooms.", "area Fremont"], ["Is there already furniture within the apartment.", ""], ["Okay, then can you find a different apartment?", ""], ["Are there any other apartments that have three bed rooms and pets can be in the building?", ""], ["I want to visit the apartment on the 11th of this month, schedule an appointment.", "visit_date 11th of this month"], ["Thank you very much, that is all for today.", ""], ["Yes. Does El gato allow pets?", ""], ["Hi! I'm here to find an accomodation.", ""], ["number_of_beds area I need an accomodation with 2 bed rooms, possibly located in San Jose.", "area San Jose"], ["I think I'll find a solution for this problem, actually I need an accomodation so it's fine.", ""], ["I'm sorry, but on that day I'll be in another city. Can I suggest the 1st of March?", "date 1st of March"], ["Yes, it's fine. I just need to know if the apartments are furnished.", ""], ["Ok, no problem. For now that's all, thank you very much!", ""], ["I want to find a pet friendly apartment.", ""], ["number_of_beds area 1 bed, 1 bath in Mountain View.", "area Mountain View"], ["What is the property's phone number? Does the apartment come furnished?", ""], ["I am looking for an apartment that allows pets. It should also have one bathroom.", ""], ["area number_of_beds I would like one bedroom and it should be in Campbell.", "area Campbell"], ["What is the phone number to this property and can you tell me if the apartment is furnished?", ""], ["That apartment sounds good to me.", ""], ["Yes please make me an appointment.", ""], ["visit_date I am willing to visit on March 9th.", "visit_date March 9th"], ["No, I'd like to visit on the 7th.", "visit_date the 7th"], ["number_of_beds With 1 bed room.", ""], ["Show me other apartments with 1 bath, please.", ""], ["It sounds good, I would like to schedule a visit on the 14th.", "visit_date the 14th"], ["Yes, thank you, what's the phone number of the property?", ""], ["Thank you. That's all.", ""], ["I'm trying to find an apartment in Hayward please.", "area Hayward"], ["number_of_beds Just one please.", ""], ["Could you get me some other suggestions? I need 3 bedrooms.", ""], ["Do they accept pets?", ""], ["Actually can I change that to Tuesday next week?", "date Tuesday next week"], ["That's right. What's the telephone number?", ""], ["Thank you so much. I'm all set.", ""], ["number_of_beds area Pets need to be allowed. it should have one bedroom. I want an apartment in Santa Rosa", "area Santa Rosa"], ["Is the apartment furnished? What is the phone number?", ""], ["Yes that sounds good. I want to schedule a visit on Wednesday next week.", "visit_date Wednesday next week"], ["No, I want to visit March 1st.", "visit_date March 1st"], ["I don't have where to sleep tonight and I want an appartment with two bedroom, in San Jose.", "area San Jose"], ["they accept pets?", ""], ["The apartemnt is furnished?", ""], ["Could you find something else?", ""], ["Thats sounds good. Can you make me a schedule to visit an apartment?", ""], ["visit_date I want todo he visit on 14th of this month.", "visit_date 14th of this month"], ["Yes, it is ok.", ""], ["Thanks you, it's all I need.", ""], ["I want to find apartment where pets are allowed.", ""], ["number_of_beds area I want only 1 bed room of apartment in Antioch.", "area Antioch"], ["Can you know to find good apartments?", ""], ["I like that sounds of that apartment and also I want to visit it.", ""], ["I like that sounds.", ""], ["Thanks for helping me lot.", ""], ["Yes, that would be good.", ""], ["Yes. Is the apartment furnished?", ""], ["number_of_beds Please search for a two bedroom apartment.", ""], ["Please search for other apartments?", ""], ["Are pets allowed and is the apartment furnished?", ""], ["Yes, please schedule a visit on the 12th of March.", "visit_date 12th of March"], ["No I would like to visit on March 10th.", "visit_date March 10th"], ["That is all. Thank you.", ""], ["area I want the apartment to be in Concord.", "area Concord"], ["Is that apartment furnished and pet-friendly?", ""], ["Yes, I'd like to visit.", ""], ["No, I actually want to visit on March 14th.", "visit_date March 14th"], ["Could I have the property's phone number please?", ""], ["number_of_beds area In Berkeley with 3 hedrooms.", "area Berkeley"], ["Get me another one with 3 baths.", ""], ["Awesome,that looks good.", ""], ["Sure, schedule a visit.", ""], ["visit_date Make it on the 1st.", "visit_date the 1st"], ["No. Make it 2nd of March.", "date 2nd of March"], ["Nice. Is it furnished what is the contact number.", ""], ["I appreciate That.", ""], ["I want to find a three bedroom apartment.", ""], ["area Look in Lafayette.", "area Lafayette"], ["Yes, confirmed. Can I have their phone number, and is it furnished?", ""], ["Nope, that's it. Thanks.", ""], ["I would like to find an apartment, where I can have pets.", ""], ["number_of_beds 1 bed room.", ""], ["Is the apartment furnished or studio, what is the phone number for the landlord?", ""], ["Are there any other similar apartments?", ""], ["visit_date On the 11th.", "visit_date the 11th"], ["Yeah that's, can you let me know if it is furnished and the contact phone number?", ""], ["No that's all thanks.", ""], ["I want an apartment with two baths.", ""], ["number_of_beds area It must have 3 bed rooms and should be located in Sunnyvale.", "area Sunnyvale"], ["Can you find another apartment? I want a furnished apartment.", ""], ["Which is their phone number? Are pets allowed in the apartment?", ""], ["Yes that apartment sounds great.", ""], ["Yep. I want a visit on the 14th.", "visit_date the 14th"], ["Yes that sounds fine.", ""], ["i am looking for a apartment.", ""], ["number_of_beds area 4 bedrooms seems good and i would like it to be located in Santa Rosa.", "area Santa Rosa"], ["Nice, sounds great.", ""], ["Yes, that's correct. Are pets allowed in the apartment and is it furnished?", ""], ["thank you very much.", ""], ["No, that's all.Thank you.", ""], ["number_of_beds area I want this apartment in Santa Rosa, with three bedrooms.", "area Santa Rosa"], ["Is there any other where pets are allowed?", ""], ["Yes, I like it. I want to schedule a visit on the 14th.", "visit_date the 14th"], ["Thank you, that is all I need.", ""], ["number_of_beds area I thought San Jose could be a good choice, and it should have four bed rooms.", "area San Jose"], ["maybe I'll look for something different... Do you have other available accomodation?", ""], ["I'm sorry, do you have another suggestion?", ""], ["I think this one is perfect, do you have it's phone number?", ""], ["Ok, however the offer looks good, I think I'll be able to visit it on 12th of March.", "visit_date 12th of March"], ["No, I'm sorry, I just changed my mind, if possible I want to see it later today.", "date later today"], ["I am looking for an apartment with 3 baths.", ""], ["I am looking for a two bedroom apartment.", ""], ["That sounds like exactly what I need. Thanks.", ""], ["area Sunnyvale looks nice.", "area Sunnyvale"], ["Does it come with furniture? Whats their number?", ""], ["This looks promising.", ""], ["area number_of_beds I want an apartment in San Jose. It should have two bedrooms and two baths.", "area San Jose"], ["Is the apartment furnished and do they allow pets?", ""], ["Yes the apartment sounds good.", ""], ["I need your help in finding an apartment. Can you do that?", ""], ["number_of_beds area I'd like to find a one -bedroom apartment in Fremont.", "area Fremont"], ["Maybe. What's the complex's phone number.", ""], ["area In the Castro Valley. I need a three bedroom.", "area Castro Valley"], ["Any more?", ""], ["Shadow Creek sounds good. Thank you.", ""], ["Does the apartment come furnished? Could you give me their phone number?", ""], ["I am looking for an apartment in SFO.", "area SFO"], ["number_of_beds I want it to have two bed rooms.", ""], ["Are there any other apartments you can find? I want it to have two baths and 3 bedrooms.", ""], ["Yes, that apartment sounds very nice. Thank you. That's all I was wanting.", ""], ["number_of_beds I need a place with three bedrooms.", ""], ["area I need to live in Napa.", "area Napa"], ["number_of_beds area I need 1 bedroom and 1 bath in Sunnyvale.", "area Sunnyvale"], ["Do you have anything in Campbell?", "area Campbell"], ["That sound nice.", ""], ["area Pleasant Hill. I need it to accept pets and have at least 1 bath", "area Pleasant Hill"], ["number_of_beds At least two.", ""], ["Thank you, I don't need anything else.", ""], ["I would prefer to find an apartment in Alameda.", "area Alameda"], ["number_of_beds I am looking for a 1 bedroom apartment.", ""], ["Yes, that apartment sounds great.", ""], ["No, thank you. That's all I needed.", ""], ["I will need a place to live in, so I need to find an apartment.", ""], ["number_of_beds area I would very much like for it to have 2 bed rooms and for the apartment to be in Rohnert Park.", "area Rohnert Park"], ["Would you be able to find some other options? I would like for the apartment to have one bath.", ""], ["What phone number does the property have, so that I can contact them?", ""], ["Would you be able to find other apartments which are located in San Jose?", "area San Jose"], ["This apartment seems as what I want. I appreciate it, that would be all!", ""], ["number_of_beds One bedroom please.", ""], ["Do they allow pets? What is their phone number?", ""], ["No not now thanks.", ""], ["Hey, I'm thinking of moving out. Can you help me find an apartment?", ""], ["Yes, that apartment sounds great for me.", ""], ["No, not now. But thank you.", ""], ["area number_of_beds One bedroom in Mountain View would be great.", "area Mountain View"], ["That sounds great, That will be all.", ""], ["My lease is up soon and I am looking for a new apartment.", ""], ["number_of_beds I need at least one bed room.", ""], ["area I would like to live in Mountain View.", "area Mountain View"], ["Do you have any other apartment listings?", ""], ["area I'd like to look in Union City.", "area Union City"], ["Could I have the phone number? Also are the apartments furnished?", ""], ["I am looking for two bedroom apartment.", ""], ["Can you confirm if this apartment is furnished? Also are they pets friendly?", ""], ["Can you find me another apartment that has 1 bedroom.", ""], ["This apartment sounds great.", ""], ["No I don't need you to schedule a visit yet. This is all I need. Thank you.", ""], ["number_of_beds area I want it in San Jose with two bedrooms and 3 baths.", "area San Jose"], ["Are pets allowed? What's their phone number?", ""], ["Please check for some other aparments.", ""], ["That one sounds good. That's all, thank you.", ""], ["I'm interested in finding an apartment, any suggestions?", ""], ["area I am primarily interested in apartments in Milpitas.", "area Milpitas"], ["number_of_beds I want a fully furnished apartment, with 4 bedrooms.", ""], ["How can I contact the property owner, and do they allow pets in the apartment?", ""], ["Can you search an apartment with 3 baths for me?", ""], ["area Search around Santa Clara.", "area Santa Clara"], ["number_of_beds The apartment should have four bed rooms.", ""], ["Can you look for any other apartments?", ""], ["I've decided to move to a new place. Can you find me an apartment?", ""], ["number_of_beds area I'd like to live in San Rafael. I'd like a two bedroom apartment that allows pets.", "area San Rafael"], ["Can you find anything else? One bathroom is good.", ""], ["area number_of_beds It needs to have 2 baths and should be in Livermore. It should have three bed rooms.", "area Livermore"], ["No, not right now. That's all for now, thanks.", ""], ["number_of_beds area I need four bed rooms in Santa Rosa.", "area Santa Rosa"], ["Does the apartment come furnished.", ""], ["No not right now. Thanks that will be all.", ""], ["I need to find an apartment with 2 baths.", ""], ["area I need an apartment in Napa.", "area Napa"], ["number_of_beds I need three bedrooms please.", ""], ["Do they permit pets?", ""], ["Great. Sounds good. That's all for now.", ""], ["number_of_beds area Yes, a 1 bedroom in Santa Rosa would be ideal.", "area Santa Rosa"], ["Is this a pet friendly apartment?", ""], ["Okay in that case this option sounds good.", ""], ["Maybe but I don't want to schedule anything now.", ""], ["No, that's everything.", ""], ["area number_of_beds I am looking for a two bedroom place in San Leandro.", "area San Leandro"], ["Can you find me something else with two baths?", ""], ["Do they allow pets in that apartment?", ""], ["Okay, that apartment sounds good. That's all I need for now.", ""], ["I need you to search for an apartment for me.", ""], ["area I want one in Novato with 3 bed rooms.", "area Novato"], ["Yes, that sounds nice.", ""], ["my friend is looking for an apartment.", ""], ["Yes that apartment sounds good. i can live there", ""], ["No I don't want to schedule it now.", ""], ["number_of_beds I'm looking for 4 bed rooms in San Jose area that allows pets.", "area San Jose"], ["No, I'll schedule it later. Thanks.", ""], ["area I want the property to be in San Jose.", "area San Jose"], ["number_of_beds It should have one bedroom.", ""], ["Yes, that apartment sounds good. Thanks, that's all I need.", ""], ["I am looking for a furnished apartment.", ""], ["number_of_beds four bed rooms and 3 baths.", ""], ["Yes that sounds perfect. Thanks, that is everything.", ""], ["number_of_beds I think three would hit the spot.", ""], ["Lets jack it up to three baths. And Pet friendly only.", ""], ["Is that with furniture.", ""], ["That might have my name on it. I'm good for now.", ""], ["number_of_beds Let's look for three bedrooms.", ""], ["area Search apartments in Rohnert Park please.", "area Rohnert Park"], ["Perfect. This is exactly what I was looking for. That will be all.", ""], ["I'm looking for an apartment with two baths.", ""], ["number_of_beds area I want a three bedroom apartment in Santa Clara.", "area Santa Clara"], ["I would like an apartment with three baths. Can you show me more properties?", ""], ["Can you show me apartments on Pomeroy Avenue?", "area Pomeroy Avenue"], ["Who is the point of contact for the property? Also, is the apartment furnished?", ""], ["That would be good.", ""], ["No thanks. I don't need anymore information.", ""], ["I'm looking for an apartment. I'd like one with three bathrooms.", ""], ["number_of_beds area San Jose and I want a three bedroom.", "area San Jose"], ["Can you tell me about another one?", ""], ["No thanks, that should do it for now.", ""], ["I need to find a good apartment.", ""], ["area number_of_beds I want an apartment in Dublin with four bedrooms and three baths.", "area Dublin"], ["Is it furnished? And what is their phone number?", ""], ["I'd like to get an apartment in Sunnyvale.", "area Sunnyvale"], ["number_of_beds Just 1 bed room.", ""], ["That place sounds great. That's all i need - thanks for your help.", ""], ["I would like to find an apartment in Mountain View that allows pets.", "area Mountain View"], ["number_of_beds I would like 3 baths and 3 bedrooms.", ""], ["I am in need of finding a place to leave so can you help me with finding an apartment?", ""], ["area number_of_beds The apartment I am looking for should have one bedroom, and the pets should be permitted since I have a dog. The location of apartment I would prefer to be Sunnyvale.", "area Sunnyvale"], ["Which is the phone number that I can use to contact them with?", ""], ["I would like to see if there are other options available for me.", ""], ["Can you tell me if this apartment has furniture in it?", ""], ["No, I don't want to make a visit at the moment.", ""], ["I am looking for an apartment to rent that will allow my pet. Can you help?", ""], ["Do any of the available apartments have 3 bathrooms?", ""], ["Thanks, that apartment sounds like what I am looking for.", ""], ["No thank you, perhaps another time. That is all for now.", ""], ["number_of_beds area I want a 2 bedroom apartment in San Jose.", "area San Jose"], ["What's the property's phone number, and is it furnished?", ""], ["Yes, that apartment sounds good. Thanks, That's all I need.", ""], ["number_of_beds I'm looking for one in Cupertino with four bedrooms and 3 baths.", "area Cupertino"], ["No, thank you. That's all for now.", ""], ["number_of_beds I want 4 bed rooms.", ""], ["area I want it in San Jose.", "area San Jose"], ["Coan you find me some other apartments?", ""], ["Are pets allowed? What is the property's phone number?", ""], ["I would like to find an apartment with one bedroom.", ""], ["area I prefer Sunnyvale. It also needs to have one bathroom.", "area Sunnyvale"], ["Does it come furnished?", ""], ["That apartment will work. Thanks for your help.", ""], ["What's their phone number? Can you tell me if it's fully furnished?", ""], ["Nope. Thank you for your help.", ""], ["I'm looking to find an apartment.", ""], ["area number_of_beds At least two bedrooms, 3 baths and in San Jose.", "area San Jose"], ["Can you find me an apartment in Pittsburg, that allows pets?", "area Pittsburg"], ["No not at this time.", ""], ["Can you get me an apartment please?", ""], ["area I want to stay in Fremont.", "area Fremont"], ["number_of_beds I require 3 bed rooms. My dogs need their own.", ""], ["That's a perfect option, thanks.", ""], ["area Antioch works best for me.", "area Antioch"], ["Is it furnished? And what's their number?", ""], ["No that's it, thanks.", ""], ["number_of_beds I would like three bedrooms. I also need pets to be allowed.", ""], ["area It should also have one bath and I want to look in Santa Rosa.", "area Santa Rosa"], ["number_of_beds 2 bedrooms would be good.", ""], ["That apartment sounds good. That's all I'll need. Thanks.", ""], ["number_of_beds area Look in the San Mateo area and I want 4 bed rooms.", "area San Mateo"], ["area Please look in Richmond.", "area Richmond"], ["Okay. What is the property's phone number?", ""], ["Sounds good. Thank you so much for your help", ""], ["area number_of_beds I would like four bed rooms and I would like an apartment in Union City.", "area Union City"], ["Can you find me some other ones?", ""], ["I don't want to schedule it yet but thank you, that's all I'll need for now.", ""], ["Not at this time.", ""], ["That's it. Thanks.", ""], ["I'm looking for apartments.", ""], ["area Something in Santa Clara.", "area Santa Clara"], ["number_of_beds Four, please.", ""], ["number_of_beds 1 bedroom is good enough and pets should be allowed.", ""], ["That apartment sounds good. That's all for now.", ""], ["i would like to find an apartment to live in in Napa and i would like it to have 2 bedrooms.", "area Napa"], ["are there any other apartments available?", ""], ["are you allowed to have pets at the property and what is the telephone number for the Cadillac Flats Apartments.", ""], ["thank you so much, that is all i need for now.", ""], ["I would like to find an apartment in Hayward with three bed rooms, can you help me to search one?", "area Hayward"], ["Can you check whether they allowed any pet animals there?", ""], ["Can you find me some more?", ""], ["No, not now, may be later.", ""], ["No, that's all I want. Thanks.", ""], ["I'm looking for an apartment with 2 bedrooms.", ""], ["Can you find me more apartments? They should have 2 baths.", ""], ["I'm looking for a 1 bathroom apartment.", ""], ["Thanks. Can you locate some additional apartments that allow pets?", ""], ["Can you find some other apartments in Fairfield?", "area Fairfield"], ["No, thanks so much.", ""], ["number_of_beds I would like 3 bed rooms.", ""], ["area I would like an apartment in Santa Rosa.", "area Santa Rosa"], ["That sounds great! Thanks, that will be all I need.", ""], ["Hi. I am moving soon and need to find an apartment. Can you help?", ""], ["area I want to stay in my current area, so, I want an apartment in Santa Rosa.", "area Santa Rosa"], ["number_of_beds I have 3 children, so I need 4 bedrooms.", ""], ["Do you have any other options? The apartment should have 3 bathrooms.", ""], ["No thank you! I am not ready yet. Thanks, that's all I needed.", ""], ["I want to find an apartment in Concord.", "area Concord"], ["number_of_beds I want 3 bed rooms.", ""], ["Can you find another apartment? I'm looking for 3 baths.", ""], ["Can you find something else? I'm looking for 1 bed room.", ""], ["That apartment sounds good, then.", ""], ["No, I'd rather not schedule it now.", ""], ["No, thanks a lot for the help.", ""], ["I'm looking for an apartment to rent. Can you help me find one?", ""], ["number_of_beds Yes, I would like an apartment with 2 rooms. Is there anything in Menlo Park?", "area Menlo Park"], ["That one sounds perfect. That's all for now.", ""], ["I would like to find an apartment with 2 bedrooms.", ""], ["This is not what I am looking for, is there any other apartments. The apartment should have 1 bath.", ""], ["Do you have a phone number to contact the property. Also, will the apartment be furnished already?", ""], ["Okay, this apartment seems like a suitable choice.", ""], ["I am not ready to schedule it right now. Thank you, I no longer need any assistance.", ""], ["I would love to find a new apartment. It would be great to have 2 baths.", ""], ["number_of_beds It really should have 2 bed rooms as well.", ""], ["area I really want to have a nice apartment in Sunnyvale.", "area Sunnyvale"], ["Great, but can you find me some other apartments?", ""], ["Yes, that apartment sounds perfect.", ""], ["Nothing more, thank you.", ""], ["I am retiring and am looking for an apartment do downsize. I absolutely need three baths and I would prefer a furnished apartment.", ""], ["number_of_beds area I am hoping to live near Vacaville so I can be close to my children. I need at least three bedrooms.", "area Vacaville"], ["No, I can't schedule it just yet. I will have to talk to my husband and find out when he is available.", ""], ["No, that was all I needed. Thank you very much!", ""], ["Hi, I'm looking for a two bathroom apartment.", ""], ["area I'm looking for a one bathroom in Alameda.", "area Alameda"], ["That sounds excellent.", ""], ["No. Thank you very much.", ""], ["I need to look for a new apartment.", ""], ["number_of_beds area I'd like a 3 bedroom apartmetn in Redwood City.", "area Redwood City"], ["That sounds like just what I'm looking for.", ""], ["Not just now. That's all I need for now.", ""], ["I would like some help finding an apartment.", ""], ["Great that sounds exactly what I am looking for. Thank you for your help.", ""], ["I am looking for an apartment with one bathroom.", ""], ["number_of_beds I need at least three bedrooms and one bathroom.", ""], ["area Yes, I would like to find something in Fairfield.", "area Fairfield"], ["Can you look up two bedroom apartments?", ""], ["That's sounds perfect, thank you that is all I will be needing.", ""], ["area number_of_beds I want to look for one in Belmont. It needs one bedroom.", "area Belmont"], ["That apartment sounds good. Thanks, that's all.", ""], ["Thank you. That sounds like the perfect apartment.", ""], ["number_of_beds area Please find a four bed room apartment in San Francisco.", "area San Francisco"], ["No thanks, not right now. Thank you, that will be all.", ""], ["I'm looking for an apartment. I want furnished apartment.", ""], ["area number_of_beds I want in Hayward. I would like to have four bed rooms.", "area Hayward"], ["Do they allow pets inside the apartment?", ""], ["No I dont want it right now.", ""], ["No. Thanks. Thats all I need", ""], ["area number_of_beds I want a 2 bedroom apartment in Santa Rosa.", "area Santa Rosa"], ["Sounds good, it has everything I'm looking for.", ""], ["Meadowood Apartments sounds good.", ""], ["No thanks, I don't want to schedule it now.", ""], ["No but thank you.", ""], ["I'll be moving soon, can you help me find a 3 bedroom apartment?", ""], ["area I'd like an apartment in Sunnyvale.", "area Sunnyvale"], ["What are there other options?", ""], ["No, not right now. Thanks for your help.", ""], ["area Menlo Park please.", "area Menlo Park"], ["I want to find a two bed room apartment.", ""], ["No I don't. Thanks that's all I need.", ""], ["I want to find an apartment that allows pets.", ""], ["number_of_beds area I want one that has at least one bath and one bedroom. An apartment in Livermore would be great.", "area Livermore"], ["What's the property's phone number?", ""], ["Can you find me other apartments, please?", ""], ["That sounds good! Okay, that's all I need for now.", ""], ["Help me find an apartment. I'm looking in Martinez.", "area Martinez"], ["number_of_beds I need four bedrooms.", ""], ["Ok, can you find me anything else?", ""], ["Nope that's it.", ""], ["I got to find an apartment.", ""], ["number_of_beds It needs 3 bedrooms.", ""], ["Yeah that apartment sounds great.", ""], ["No I would not like to schedule it now. Thank you and that is all I need.", ""], ["area number_of_beds I prefer to have four bed rooms built in 1800 to 2100 square feet area, preferably in Concord.", "area Concord"], ["Looks good, but do you have any other apartments too?", ""], ["Yup! This apartment looks good.", ""], ["Nope, not for now. Thanks.", ""], ["Can you search for a 3 bed room pet friendly apartment?", ""], ["area I would like to live in Sausalito.", "area Sausalito"], ["That sounds like a good fit.", ""], ["No, this is fine.", ""], ["number_of_beds The apartment should have three bed rooms.", ""], ["area The apartment should be in Walnut Creek.", "area Walnut Creek"], ["Can you look for any other option?", ""], ["Can you find me the contact number?", ""], ["I am looking for an apartment in Walnut Creek.", "area Walnut Creek"], ["number_of_beds I need two bedrooms and 3 baths.", ""], ["Yes, thanks, that sounds like everything I need.", ""], ["I'm looking for a 2 bedroom apartment.", ""], ["Is is a pet-friendly apartment.", ""], ["Can you look for some other pet-friendly apartments?", ""], ["Yes, it sounds like a good apartment. Thanks, that will be all.", ""], ["number_of_beds Three rooms would be perfect.", ""], ["Yes, looks good. Thanks. That is all.", ""], ["Hey, I would like to search for an apartment with 2 bedrooms in Santa Rosa.", "area Santa Rosa"], ["I see, could you help to find other apartments instead?", ""], ["Great! What is the property's phone number?", ""], ["Not now, thank you.", ""], ["That's all the help I need. Thank you very much!", ""], ["Hi, my friend will be living here for a while and I need to find an apartment for him. Can you help me search for one?", ""], ["area number_of_beds I'd like a 3 bedroom apartment in Cloverdale.", "area Cloverdale"], ["number_of_beds I want an apartment with 1 bedroom.", ""], ["area I want an apartment in Castro Valley. It should also have 1 bathroom.", "area Castro Valley"], ["Are pets allowed inside?", ""], ["Can you find some other apartments? These ones should have 2 baths.", ""], ["No, I don't want to schedule a visitation now.", ""], ["No, but thanks a lot for your help.", ""], ["number_of_beds area I prefer Santa Rosa and I need two bedrooms.", "area Santa Rosa"], ["No, I want it for this Saturday.", "date this Saturday"], ["is that apartment furnished?", ""], ["Do they allow pets? Do you have a phone number?", ""], ["Super, thank you.", ""], ["number_of_beds It should have four bedrooms.", ""], ["Can you find some more apartments please?", ""], ["Yes I would like to schedule a visit.", ""], ["No.I would like to visit on the 14th of this month.", "visit_date 14th of this month"], ["Yes that is perfect.", ""], ["area In Vacaville and it should have one bath.", "area Vacaville"], ["number_of_beds Just one.", ""], ["Is the apartment furnished? Also, are pets allowed?", ""], ["That sounds good. I would like to schedule a visit for the 13th of this month.", "visit_date 13th of this month"], ["I am searching for an apartment with 4 bed rooms in Berkeley.", "area Berkeley"], ["Is the apartment furnished and are pets allowed?", ""], ["Are there any other options available?", ""], ["That apartment sounds like a great option.", ""], ["Can you schedule a visit for me on March 1st?", "visit_date March 1st"], ["Yes, that should work just fine.", ""], ["What's the phone number to the apartments?", ""], ["Thank you for the help.", ""], ["I would like to find an apartment that has three baths.", ""], ["number_of_beds area I would like the apartment t be in San Jose. 1 bed room is fine.", "area San Jose"], ["Yes that apartment sounds great. I would like to schedule a visit to the apartment. I would like to visit today.", "visit_date today"], ["I am moving to Mountain View and looking for an apartment.", "area Mountain View"], ["number_of_beds I would like to have 2 bedrooms and preference to have one attached bathroom and another common bathroom. So total 2 bathroom as well.", ""], ["I want to see the apartment by 8th of this month.", "visit_date 8th of this month"], ["Exactly you got the right schedule.", ""], ["Perfect thanks for the help.", ""], ["No, I am good thanks,.", ""], ["I want to find an apartment in Hayward.", "area Hayward"], ["number_of_beds It should have 1 bed room.", ""], ["Is it pet friendly? Is it furnished?", ""], ["Yes that sounds good. I would like to schedule a visit to the apartment.", ""], ["No I want to visit on the 12th.", "visit_date the 12th"], ["I want to find a 2 bedroom apartment.", ""], ["area I want a furnished apartment with 2 bathrooms in San Jose.", "area San Jose"], ["Yes that one sounds good.", ""], ["visit_date Later today.", "visit_date Later today"], ["No, thanks.", ""], ["Hello. I need to find an apartment.", ""], ["Great. What is their phone number?", ""], ["Can you find some other apartments? How about a four bedroom that allows pets?", ""], ["visit_date I think the 6th of this month will work.", "visit_date 6th of this month"], ["Great. Is the apartment furnished?", ""], ["Ok. Thanks for your help.", ""], ["I am looking for an apartment in El Sobrante, and it needs to allow pets.", "area El Sobrante"], ["Yes, I would like to take a look.", ""], ["Yes, that will be great, thanks.", ""], ["I would like to find a three bed room apartment.", ""], ["Are there any other nice apartments?", ""], ["Ok, I would like to schedule a visit to this apartment for Monday next week.", "visit_date Monday next week"], ["Yes, that is correct. Also, are pets allowed and could you provide me with the property's phone number?", ""], ["Ok, that is great.", ""], ["dropoff_date pickup_time I'll pick it up around 10:30 in the morning, keeping it until next Thursday.", "pickup_time 10:30 in the morning dropoff_date next Thursday"], ["pickup_date pickup_city I'll pick it up in New York on March 4th.", "pickup_date March 4th pickup_city New York"], ["No not now.", ""], ["dropoff_date I need a pickup time around 18:30 and I will need the car until the 7th.", "pickup_time 18:30 dropoff_date the 7th"], ["That would be perfect.", ""], ["No, I don't want to reserve it yet. That's all I need.", ""], ["My usual car is being repaired right now. I'm in need of a rental car for the interim.", ""], ["pickup_date dropoff_date I'll be needing it from March 9th to March 14th.", "pickup_date March 9th dropoff_date March 14th"], ["pickup_city I'd like to pick it up from Phoenix.", "pickup_city Phoenix"], ["pickup_time I'll have to pick it up around 4:30 pm.", "pickup_time 4:30 pm"], ["Yes, I want to rent this Accord.", ""], ["That's all correct. What will it cost me?", ""], ["No, that's all. Thanks for helping.", ""], ["I need a car for next Thursday.", "pickup_date next Thursday"], ["pickup_time 6 in the evening please.", "pickup_time 6 in the evening"], ["pickup_date the 5th of March.", "pickup_date 5th of March"], ["What else is there, I'd like arrange for it to be picked up in New York.", "pickup_city New York"], ["Sweet, thanks.", ""], ["Nope, thanks.", ""], ["I have an out-of-town business meeting and would prefer to drive. Please find me a rental car.", ""], ["dropoff_date pickup_city I'd like to pick it up from Toronto, Canada, and keep it until the 6th of this month.", "pickup_city Toronto, Canada dropoff_date 6th of this month"], ["pickup_time I'll be needing the car from the 5th of March around morning 11. Any type will do.", "pickup_date 5th of March pickup_time morning 11"], ["Sorry, there's been a last-minute change of plans and I have to leave on March 4th. Do you have anything else available then?", "date March 4th"], ["dropoff_date pickup_city I want to pick up the rental car from Phoenix until the 7th.", "pickup_city Phoenix dropoff_date the 7th"], ["pickup_time pickup_date I would like the rental car from March 6th at around evening 6.", "pickup_date March 6th pickup_time evening 6"], ["No, I don't want to reserve it right now.", ""], ["I need to rent a Full-size car.", ""], ["pickup_date pickup_city I need to pick it on Wednesday next week in Portland, OR.", "pickup_date Wednesday next week pickup_city Portland, OR"], ["That is fine.", ""], ["I want to make the reservation for the car.", ""], ["Hey, I want a car for rent. I need it until the 10th. Can you help me?", "pickup_date the 10th"], ["Yeah, please get me that vehicle/.", ""], ["No, I don't really want a a reservation right now.", ""], ["dropoff_date pickup_city Till next Friday I want it, from Paris.", "pickup_city Paris dropoff_date next Friday"], ["pickup_date From 4th of this month.", "pickup_date 4th of this month"], ["I prefer a medium-sized one, look for that.", ""], ["What will be the cost?", ""], ["Look for one from the 7th.", "date the 7th"], ["Great, that will do.", ""], ["Yeah go on.", ""], ["Yes it is correct.", ""], ["thank you for the help.", ""], ["Hi, I will be travelling and I need to book a rental car for the 6th of March.", "pickup_date 6th of March"], ["pickup_time dropoff_date I'd like to pick it up around three pm and I will need it until March 9th.", "pickup_time three pm dropoff_date March 9th"], ["pickup_city I would like to pick up the car from Philly.", "pickup_city Philly"], ["That sounds great, I'd like to reserve the car.", ""], ["I think I need to rent a car.", ""], ["Let's do that.", ""], ["How much will all this cost me?", ""], ["Nothing, thanks.", ""], ["Can you search for a rental car?", ""], ["Perfect! Book this car.", ""], ["Yes, I do. What is the cost?", ""], ["No, It's all, thanks.", ""], ["I would like to find a rental car. I'll need to keep it until the 8th of this month.", "pickup_date 8th of this month"], ["pickup_date I need it starting Tuesday next week.", "pickup_date Tuesday next week"], ["pickup_city I would like to get it from Fresno, CA.", "pickup_city Fresno, CA"], ["Is there anything else? I would like a standard car.", ""], ["What's the cost of it?", ""], ["No, I don't need it now.", ""], ["Nope, that's for your help.", ""], ["Hello. Can you help me find a rental car?", ""], ["pickup_date pickup_city I would like to pick it up from Ciudad de Mexico on this Sunday.", "pickup_date this Sunday pickup_city Ciudad de Mexico"], ["pickup_time I would prefer to pick it up around 1:30 in the afternoon.", "pickup_time 1:30 in the afternoon"], ["I would really prefer a medium-sized car. Are there any available?", ""], ["What's the total cost to reserve that car?", ""], ["That sounds good. Would you please reserve that car?", ""], ["No, that's it. Thanks again.", ""], ["pickup_date 9th of March please.", "pickup_date 9th of March"], ["Sounds perfect, can you book the car please?", ""], ["Yes please! And how much is that?", ""], ["Lovely, thank you very much.", ""], ["I'm looking to rent a car for my next trip.", ""], ["pickup_time pickup_date yes, I need it from the 11th around morning 10.", "pickup_date the 11th pickup_time morning 10"], ["Can you show me another possibility?", ""], ["I prefer a compact car honestly.", ""], ["I may like it.", ""], ["No, I don't have any other request.", ""], ["I wish for a car for rent.", ""], ["pickup_date pickup_time pickup_city For this sunday at around half past 6 in the evening rom sacramento, ca.", "pickup_date this sunday pickup_time half past 6 in the evening pickup_city rom sacramento, ca"], ["What is the cost?", ""], ["Thats exactly what I want.", ""], ["Yes, thank u for this.", ""], ["Thanks so much for being fast;.", ""], ["I wanna find a rental car.", ""], ["pickup_time pickup_city I want to pick it up from Sacramento, CA, around evening 7:30.", "pickup_city Sacramento, CA pickup_time 7:30"], ["pickup_date dropoff_date I need the car from March 10th till the 14th.", "pickup_date March 10th dropoff_date the 14th"], ["Is there anything else avaliable? I'd like a Compact car.", ""], ["Nope, I'm good for now. That's all I need.", ""], ["pickup_time pickup_date I need the car from the 5th and I want to pick it up at 3 in the afternoon.", "pickup_date the 5th pickup_time 3 in the afternoon"], ["No, nothing else.", ""], ["I would like to find a rental car.", ""], ["pickup_date I want a standard car from tomorrow.", "pickup_date tomorrow"], ["Is there anything else available for pickup around twelve pm.", "pickup_time twelve pm"], ["No, I don't want to reserve the car right now. That's all I needed.", ""], ["dropoff_date pickup_date pickup_city I need the car from 11th of March until the 13th. I want to pick it up in Phoenix.", "pickup_date 11th of March dropoff_date the 13th pickup_city Phoenix"], ["pickup_time I want to pick it up around 3:30 pm.", "pickup_time 3:30 pm"], ["How much is the total cost?", ""], ["Nope. Thanks a lot for all your help.", ""], ["I am looking for a Full-size rental car.", ""], ["It is great. I want to book this car.", ""], ["Yes. It is good.", ""], ["May I know the total cost?", ""], ["Thank you so much for your help. That is what I need.", ""], ["I have a business trip coming up in San Diego and will need a rental car.", "city_of_event San Diego"], ["pickup_date I will need the car on the 5th if possible.", "pickup_date the 5th"], ["That's perfect, can you please reserve that for me?", ""], ["Thanks so much, that saves me some extra time.", ""], ["pickup_city pickup_time I need it in Philly and I'll get it around 3 pm.", "pickup_city Philly pickup_time 3 pm"], ["What will that run me?", ""], ["Is there another car? Maybe an intermediate car.", ""], ["What's that cost?", ""], ["That's great, book it for me.", ""], ["Yes that's all correct.", ""], ["Thanks for that, that's all for now.", ""], ["I need to a rental car.", ""], ["pickup_time Around afternoon 12:30.", "pickup_time 12:30"], ["dropoff_date Until the 5th, please.", "dropoff_date the 5th"], ["Can you find me a Compact car?", ""], ["How much does the rental of this car cost?", ""], ["Yes, It's correct, thank you.", ""], ["Thanks for your valuable help.", ""], ["No, It's all. Thanks", ""], ["pickup_time I want to pick up the car around 12 o\"clock in the afternoon.", "pickup_time 12 o\"clock in the afternoon"], ["Sounds good, let's reserve that car.", ""], ["Sounds good. How much does it cost?", ""], ["Im looking for a car rental.", ""], ["pickup_date dropoff_date pickup_time I need the car from March 5th till 6th of this month, will pickup around 3:30 in the afternoon.", "pickup_date March 5th dropoff_date 6th of this month pickup_time 3:30 in the afternoon"], ["pickup_city From Ciudad de Mexico I will pick it up.", "pickup_city Ciudad de Mexico"], ["Whats the total cost?", ""], ["Thats perfect for me.", ""], ["Yes. I want to book the car.", ""], ["Yes thats great.", ""], ["No Thanks for the help thats all I need.", ""], ["I would like to find a car to rent.", ""], ["What will the final price be?", ""], ["Well that sounds excellent.", ""], ["Yep that sounds good to me.", ""], ["I really appreciate your help.", ""], ["No, but I appreciate all your help.", ""], ["pickup_date pickup_city I want to pick up a car from Vancouver, BC and need it from 9th of March.", "pickup_date 9th of March pickup_city Vancouver, BC"], ["That's good news.", ""], ["I confirm the details are correct.", ""], ["pickup_city dropoff_date pickup_date I need the Car from Tuesday next week to the 8th from Atlanta.", "pickup_date Tuesday next week dropoff_date the 8th pickup_city Atlanta"], ["Get me the rent details so that I can confirm.", ""], ["Can you get me some other car?", ""], ["That seems okay to me. can you reserve it for me?", ""], ["pickup_date dropoff_date I will need the car on the 3rd of this month until next Tuesday. I am looking for a small car.", "pickup_date 3rd of this month dropoff_date next Tuesday"], ["That works. I would like to reserve this.", ""], ["I'm interested in renting a car.", ""], ["dropoff_date I need to rent out a car until the 9th of March.", "dropoff_date 9th of March"], ["pickup_date The 6th of March is when I will begin renting the car.", "pickup_date 6th of March"], ["What will it cost to rent out the car?", ""], ["I'm looking to rent a medium-sized car, is there anything else available?", ""], ["Can I get another recommendation, and can I change the pickup date to the 3rd of March, around 1 in the afternoon?", "pickup_date 3rd of March pickup_time 1 in the afternoon"], ["A Sentra sounds good.", ""], ["Yes, please rent out the vehicle.", ""], ["That all sounds good, what will be the total cost?", ""], ["Thanks for the assistance, that will be all.", ""], ["I got to rent some wheels?", ""], ["dropoff_date I got to have it until the 4th of March.", "dropoff_date 4th of March"], ["What's the damage report?", ""], ["Alright. I'll take it.", ""], ["Yeah. Confirmed.", ""], ["Good job.", ""], ["I'm sure you can. But I am good to go.", ""], ["I am in need of renting a car and I need it to be a small car.", ""], ["pickup_date I need to rent the car from 10th of March.", "pickup_date 10th of March"], ["pickup_time I need to pick up the rented car at around 5 in the evening.", "pickup_time 5 in the evening"], ["Can you tell me how much it will cost me?", ""], ["Are there some other options which are available to me?", ""], ["Can you tell me how much this car will be costing me?", ""], ["Are there some other options which I can have?", ""], ["That suits well to what I need. I want to book this car.", ""], ["Those details seems good. Can you tell me how much it will cost me?", ""], ["I want to rent a car from March 7th.", "pickup_date March 7th"], ["Please tell me the cost.", ""], ["That's perfect. I want to reserve it", ""], ["No, thanks. That's all.", ""], ["pickup_date pickup_time I want the car from March 8th and need to get the car around 12:30.", "pickup_date March 8th pickup_time 12:30"], ["What is the total price?", ""], ["That's cool. I want to book this car.", ""], ["This is perfect.", ""], ["pickup_date I would like to get it the 9th of March.", "pickup_date 9th of March"], ["I'm looking for a rental car through March 12th.", "pickup_date March 12th"], ["pickup_date I need to pick it up on the 9th.", "pickup_date the 9th"], ["pickup_time pickup_city I want to pick it up in Portland, OR, around six in the evening.", "pickup_city Portland, OR pickup_time six in the evening"], ["What is the total for that rental?", ""], ["That sounds good. I want to reserve that car now.", ""], ["Thanks a lot! That's all I need today.", ""], ["I want to find a compact car for rent.", ""], ["pickup_date pickup_city In need the Car in Delhi from March 6th.", "pickup_date March 6th pickup_city Delhi"], ["Can you search for some other car?", ""], ["How much does the car rent?", ""], ["I need to book a rental car.", ""], ["pickup_city I'll get the car in Chicago. I want a small car.", "pickup_city Chicago"], ["Great. Please book it.", ""], ["Yes that's it.", ""], ["Thanks. That's great.", ""], ["I am looking for a standard class rental car.", ""], ["pickup_time I want to pick it up around afternoon 1.", "pickup_time afternoon 1"], ["dropoff_date I need it until March 11th.", "dropoff_date March 11th"], ["pickup_date I need to pick up the car on March 6th.", "pickup_date March 6th"], ["pickup_city From Paris, please.", "pickup_city Paris"], ["I'm not fond of Accords. Is anything else available?", ""], ["OK, what is the total for that rental?", ""], ["Yes, please reserve it for me.", ""], ["Yes, that's good.", ""], ["Thanks very much. That's all I need today.", ""], ["Is there anything else avaliable? I'd like to pick it up from Anaheim, and I want a large car.", "pickup_city Anaheim"], ["That sounds good. I'd like to reserve this car.", ""], ["Yeah, that sounds good. What is the total cost?", ""], ["Nope. Thanks a lot.", ""], ["Hmmmm..... Any other cars please? I will be able to pick up the car around half past 6 in the evening.", "pickup_time half past 6 in the evening"], ["How much they aggregate with taxes?", ""], ["Awesome! sounds good.", ""], ["Yup! I wish to rent this car.", ""], ["Yup! Sounds good.", ""], ["Thanks much for your service.", ""], ["Nope, thanks. I'm set.", ""], ["dropoff_date pickup_time I'd like to pick it up around eleven am, and I'll need it until next Friday. Is there anything available?", "pickup_time eleven am dropoff_date next Friday"], ["That sounds good! What will the cost of that be?", ""], ["Nope, that was all. Thanks again!", ""], ["pickup_date dropoff_date I need it from March 11th until the 13th of March.", "pickup_date March 11th dropoff_date 13th of March"], ["Please reserve it.", ""], ["pickup_date From March 5th.", "pickup_date March 5th"], ["pickup_city From Toronto.", "pickup_city Toronto"], ["Sounds good! I would like to reserve this car.", ""], ["What is the total cost? That sounds good!", ""], ["No. Thanks for the help!", ""], ["Find me a rental car.", ""], ["pickup_city From Vancouver.", "pickup_city Vancouver"], ["dropoff_date Until the 6th.", "dropoff_date the 6th"], ["pickup_time I prefer to pick it up around 15:00, if possible.", "pickup_time 15:00"], ["Sounds good. Can you make me a reservation?", ""], ["Yes it is.", ""], ["Thanks for your help. I am all set.", ""], ["I need to get a car to drive.", ""], ["pickup_time dropoff_date pickup_date I have to have the car on the 9th and I can turn it back in on the 10th. Can I pick something up around 7:30 in the evening? Oh, also I need this to be a compact.", "pickup_date the 9th dropoff_date the 10th pickup_time 7:30 in the evening"], ["pickup_city I'm in Portland, OR.", "pickup_city Portland, OR"], ["I really don't like that option. What else is there?", ""], ["How many clams will that run me?", ""], ["I agree to your terms maam.", ""], ["Thanks for you attentive assistance.", ""], ["How shall I find a rental car?", ""], ["dropoff_date pickup_city I want to book the car up to March 7th and pick up me from KL.", "pickup_date March 7th pickup_city KL"], ["It is great.", ""], ["Yes please. Please book a car for rent.", ""], ["Yes. It is great.", ""], ["Thank you very much for your help. That is what I need.", ""], ["dropoff_date pickup_time I'm going to need to pick it up at 4:30 in the evening. And I'm going to need it until the 7th of March.", "pickup_time 4:30 in the evening dropoff_date 7th of March"], ["pickup_date pickup_city I'm going to need the car starting on March 5th and I would like to pick it up from Washington.", "pickup_date March 5th pickup_city Washington"], ["What is another option?", ""], ["I like that, please reserve that car for me.", ""], ["That is correct, how much will that cost me?", ""], ["Thanks so much for the help, that'll be all.", ""], ["I want to pick up the car around 3 in the afternoon.", "pickup_time 3 in the afternoon"], ["I am confirming to reserve this car.", ""], ["I like this.", ""], ["Do you know what the rental cost would be?", ""], ["What about a medium-sized car? Are nay of those available?", ""], ["I like the sounds of a Prius.", ""], ["Not at this time. That will be all.", ""], ["Can you help with renting a Standard car.", ""], ["pickup_date I would need it from March 12th.", "pickup_date March 12th"], ["Can you please tell me the total rental cost?", ""], ["This sounds perfect. Can you help with the reservation?", ""], ["I want to book a rental car.", ""], ["pickup_date I need the car from next Tuesday.", "pickup_date next Tuesday"], ["That sounds good, reserve it please.", ""], ["pickup_date pickup_time On 12th of March, around afternoon 3:45.", "pickup_date 12th of March pickup_time 3:45"], ["I would prefer a Compact car.", ""], ["Yes, I confirm. What's the total cost?", ""], ["pickup_date Starting on the 7th.", "pickup_date the 7th"], ["That sounds OK.", ""], ["Not today, no.", ""], ["I need to find a rental car with a pick up around 17:00.", "pickup_time 17:00"], ["pickup_city pickup_date I need to get the car from Sacramento, CA on Thursday next week.", "pickup_date Thursday next week pickup_city Sacramento, CA"], ["Yes, please make the reservation.", ""], ["Yes, that sounds perfect.", ""], ["THanks for the help.", ""], ["Hello! I am looking for rental car information.", ""], ["dropoff_date pickup_date I need a car from the 3rd until the 8th, please.", "pickup_date the 3rd dropoff_date the 8th"], ["pickup_city I would like to pick it up in London, England. Could I pick it up around 12:00?", "pickup_city London, England pickup_time 12:00"], ["OK. What is the total cost for that rental?", ""], ["Let's search again, please. Are there any small cars available?", ""], ["That sounds better. I would like to reserve that one, please.", ""], ["Yes, that's exactly right.", ""], ["What would be the total cost for the rental?", ""], ["Yes, that sounds correct.", ""], ["I really appreciate the help thanks.", ""], ["No that was all I wanted, thanks again.", ""], ["Can you find me a rental car?", ""], ["I need it from 2nd of March. Is there another car? I'm good with anything.", "pickup_date 2nd of March"], ["How much is the cost?", ""], ["That works. I want to reserve it", ""], ["pickup_city I need to get it in Ciudad de Mexico.", "pickup_city Ciudad de Mexico"], ["dropoff_date pickup_date Actually, I need to pick it up Seattle, WA. I'll need it from the 10th until the 13th.", "pickup_date the 10th dropoff_date the 13th pickup_city Seattle, WA"], ["I am interested in a Standard car. Do you have anything else?", ""], ["I'd like to know what my other options are. Any model is fine.", ""], ["Got anything else?", ""], ["No, not yet. That's all I need.", ""], ["I need a rental car to pick up at Las Vegas.", "pickup_city Las Vegas"], ["I would like a Compact car. Is there anything available?", ""], ["Yes that sounds right.", ""], ["dropoff_date pickup_date I want to rent it from the 7th of this month until the 13th of this month.", "pickup_date 7th of this month dropoff_date 13th of this month"], ["I'm going to need it until Friday next week and pick it up around eleven am. Do you have other cars?", "pickup_date Friday next week pickup_time eleven am"], ["What is the price of the rental?", ""], ["Yes, I want to book it.", ""], ["pickup_time dropoff_date pickup_date I want to rent the car from the 1st to next Wednesday, and I'd like to pick it at at 1 in the afternoon.", "pickup_date the 1st dropoff_date next Wednesday pickup_time 1 in the afternoon"], ["What else do you have.", ""], ["And what's the cost of that?", ""], ["Yeah, that' correct.", ""], ["Do you have some other car ready?", ""], ["Do you have anything else?", ""], ["Do you have a large car available?", ""], ["Yes, please book.", ""], ["Sounds just perfect.", ""], ["I am travelling to California and need a rental car for the trip.", "to_location California"], ["Yes, that is right. Could I have the total price, please?", ""], ["dropoff_date Will be needing it till the 8th. I will be travelling alone so I prefer a small car.", "dropoff_date the 8th"], ["pickup_city I am currently at Anaheim, CA. Please find one near my area.", "pickup_city Anaheim, CA"], ["I am not really into Bolt cars. Do they have other cars?", ""], ["I do not have that much budget since it is urgent but how much is it?", ""], ["dropoff_date Till March 11th.", "dropoff_date March 11th"], ["I would like to make the reservation.", ""], ["Could you help me to find a rental car for us until the 12th of March?", "pickup_date 12th of March"], ["pickup_city pickup_time I would like to pick the car up at about twelve in the afternoon in New York.", "pickup_city New York pickup_time twelve in the afternoon"], ["Are there any alternatives available?", ""], ["No thanks, that's all the help I need.", ""], ["pickup_time I would like to pick up the vehicle at 5 in the evening.", "pickup_time 5 in the evening"], ["How much is the total price?", ""], ["That sounds alright.", ""], ["pickup_city SFO.", "pickup_city SFO"], ["Total cost?", ""], ["pickup_date I'd need to pick it up by March 9th.", "pickup_date March 9th"], ["pickup_city I'll be in Vegas.", "pickup_city Vegas"], ["Yes, I'd like to rent the Civic.", ""], ["Thank you so much for all of your help.", ""], ["I need to rent a car. Full-size please.", ""], ["pickup_city I'll get the car in Chi-town.", "pickup_city Chi-town"], ["Anything else? Make the pickup around 12 in the afternoon.", "pickup_time 12 in the afternoon"], ["How much does that one cost?", ""], ["Not right now. I'm good thanks.", ""], ["whether any other car available?", ""], ["Ok That sounds good to me.", ""], ["Yes, I need it.Book it", ""], ["THanks a lot for your kind help.", ""], ["pickup_date dropoff_date pickup_time I need the car from March 6th till next Friday, please. I want to pick up the car on the evening 4:30, please. I am looking for a medium-sized car.", "pickup_date March 6th dropoff_date next Friday pickup_time 4:30"], ["Fantastic.", ""], ["What other cars you got?", ""], ["What's that come out to?", ""], ["Book that thing.", ""], ["Excellent. Nice work.", ""], ["Nothing. I'm all set.", ""], ["whar is the total cost?", ""], ["that sounds good.", ""], ["no i don't want to reserve it now.", ""], ["no thanks a lot for your help.", ""], ["I need to rent a car on March 5th.", "pickup_date March 5th"], ["pickup_city pickup_time I need to pick it up around 12 in the afternoon in Anaheim, CA.", "pickup_city Anaheim, CA pickup_time 12 in the afternoon"], ["No. I don't need a reservation now.", ""], ["pickup_date dropoff_date I need the car from March 7th till 9th of this month.", "pickup_date March 7th dropoff_date 9th of this month"], ["pickup_city pickup_time I need it in San Francisco and would be able to pick it around afternoon 1:30.", "pickup_city San Francisco pickup_time afternoon 1:30"], ["What would the booking cost?", ""], ["This sounds good, book this one.", ""], ["What is the cost of this?", ""], ["No, that would be all,.", ""], ["dropoff_date pickup_time pickup_date I require the car from Saturday this week till 8th of March and i also need to pick up the car around 13:30.", "pickup_date Saturday this week dropoff_date 8th of March pickup_time 13:30"], ["Can i get anything else?", ""], ["What is the total amount?", ""], ["That is cool.", ""], ["Yes i like to rent a vehicle.", ""], ["Thank you very much for your help. That's all i want.", ""], ["pickup_city I would like from SD.", "pickup_city SD"], ["Great.What would be the total cost of the car?", ""], ["pickup_date I need it on 10th of this month.", "pickup_date 10th of this month"], ["dropoff_date pickup_city I want to pick it up from SFO till the 12th.", "pickup_city SFO dropoff_date the 12th"], ["pickup_time I need it at around six pm.", "pickup_time six pm"], ["What is the total cost of the rental.", ""], ["that works, please reserve for me.", ""], ["Yes thats correct.", ""], ["thanks thats all i need from you.", ""], ["How much do i owe?", ""], ["I need a car rental.", ""], ["dropoff_date pickup_city I want to pick up the car in New York City, and will need it until the 11th.", "pickup_city New York City dropoff_date the 11th"], ["I am interested in renting a vehicle.", ""], ["pickup_time I would pick it up about 11:30.", "pickup_time 11:30"], ["I would like to pick it up about 4:30 pm. I would like an intermediate care. Is there anything else available?", "pickup_time 4:30 pm"], ["Do you have anything else available?", ""], ["That sounds good. I will reservice this car.", ""], ["How much is the toal cost? That sounds correct.", ""], ["dropoff_date I will have to use it till the 5th of March.", "dropoff_date 5th of March"], ["What is the total charge.", ""], ["Yes, sounds correct.", ""], ["Thanks so much for your help. That is all I need.", ""], ["pickup_date I need the car from this Saturday. I want a small car.", "pickup_date this Saturday"], ["The is the total cost for the rental?", ""], ["That will work for me. I'd like to reserve this car.", ""], ["Good. That sounds great.", ""], ["Thanks. I appreciate your help.", ""], ["No, That's all. Thanks", ""], ["I would like to hire a rental car.", ""], ["pickup_date pickup_city I'm planning to pick it from long beach, and its for 8th of this month.", "pickup_date 8th of this month pickup_city long beach"], ["Great, sounds good.", ""], ["No, Thanks a lot for your help.", ""], ["I want to find a rental car please.", ""], ["pickup_time I will pick it up around 11 o\"clock in the morning.", "pickup_time 11 o\"clock in the morning"], ["Can you help me find a rental car?", ""], ["pickup_time I wanna pick it up around eleven in the morning.", "pickup_time eleven in the morning"], ["Yes, please reserve the car.", ""], ["Yup that's right.", ""], ["No we're good, thanks.", ""], ["How much will the rental cost me?", ""], ["I accept that price and want to continue with the reservation.", ""], ["I appreciate the assistance, that's all for now.", ""], ["pickup_date pickup_city I want to get it from Washington on the 3rd of this month.", "pickup_date 3rd of this month pickup_city Washington"], ["No, not now. That is all.", ""], ["dropoff_date pickup_city I want to pick it up while i'm in Paris, France and I'll need it until the 8th.", "pickup_city Paris, France dropoff_date the 8th"], ["pickup_date I would need it next Monday.", "pickup_date next Monday"], ["How much is this going to cost me?", ""], ["Sounds good, I'll take it.", ""], ["pickup_time pickup_city I'll pick it up in Long Beach, CA around four pm.", "pickup_city Long Beach, CA pickup_time four pm"], ["pickup_date I will pick it up next Wednesday.", "pickup_date next Wednesday"], ["OK. I'll take that one.", ""], ["OK. How much will it be?", ""], ["What's the total bill. And yes that's right", ""], ["pickup_city I want to get it in Kuala Lumpur.", "pickup_city Kuala Lumpur"], ["That is fine. Reserve that car.", ""], ["How much will it cost total?", ""], ["No, that's all. Thanks a lot for your help.", ""], ["pickup_date pickup_time I need car on the 4th of March around afternoon 12:30.", "pickup_date 4th of March pickup_time 12:30"], ["Can I please get a quote?", ""], ["Would there be any other car options.", ""], ["It matches my requirements and I would like to reserver this car.", ""], ["I can confirm that details are correct.", ""], ["i WANT TO FIND A RENTAL CAR.", ""], ["pickup_date I need the car from Next friday.", "pickup_date Next friday"], ["I need spacious car.", ""], ["thanks a lot for your help.", ""], ["no thanks If I need, I will call you.", ""], ["pickup_date pickup_time I need it on the 5th. I want to pick it up around 18:30", "pickup_date the 5th pickup_time 18:30"], ["Sounds good. I want that car.", ""], ["What's the total cost?", ""], ["I'm going on a road trip, I'll need help to find a rental car.", ""], ["pickup_date I need it from the 9th of March till the 14th.", "pickup_date 9th of March dropoff_date the 14th"], ["Actually, I need the car from the 7th of this month, what else is available?", "pickup_date 7th of this month"], ["Yes, I want to rent that vehicle.", ""], ["No, that's all for now, thanks.", ""], ["I want to rent a car.", ""], ["I want to pick up a standard car in San Francisco. Is that possible?", "pickup_city San Francisco"], ["I need it in the morning 10:30. Is that possible?", "time 10:30"], ["Yes, sounds good to me.", ""], ["Thanks so much. I appreciate it.", ""], ["Sounds great.", ""], ["Thanks, that's all for now.", ""], ["Yes, sounds good.", ""], ["Can you find me a bus?", ""], ["Thanks a lot.", ""], ["Are there any other options?", ""], ["Yes. That is correct.", ""], ["Thank you for helping.", ""], ["That one sounds great.", ""], ["Yes please.", ""], ["I need a bus for 2 people.", ""], ["Sounds good to me.", ""], ["Works for me.", ""], ["Thanks for the help.", ""], ["No, thank you.", ""], ["I need to find a bus.", ""], ["Yes, that is correct.", ""], ["Thanks for you help.", ""], ["Can you help me search for a bus?", ""], ["Yes, that's right.", ""], ["Thanks for your help.", ""], ["What else do you have?", ""], ["What bus station does it depart from?", ""], ["That works for me.", ""], ["That sounds good.", ""], ["No, not right now.", ""], ["No, thanks a lot for your help.", ""], ["That sounds good. That's all I need.", ""], ["Can you help me find a bus?", ""], ["That sounds great.", ""], ["No, not now, thanks.", ""], ["That will do.", ""], ["No, thanks a lot.", ""], ["that sound good.", ""], ["Which bus station does it go to?", ""], ["No thanks.", ""], ["Sounds good. That's all I need for now.", ""], ["Thanks, that's it.", ""], ["Is there anything else?", ""], ["Are there any other buses available?", ""], ["That sounds good to me.", ""], ["Yes, that works for me.", ""], ["Yes, I confirm, thanks.", ""], ["Yes, that's perfect.", ""], ["Thanks for your assistance.", ""], ["No thank you.", ""], ["Thanks a lot for the help.", ""], ["Great.", ""], ["Yes.", ""], ["Are there other options?", ""], ["Sounds good.", ""], ["Thanks.", ""], ["Thank you very much for the help.", ""], ["Yes, please.", ""], ["Yes, that works.", ""], ["Any other options?", ""], ["Thank you, that is all.", ""], ["Which station does it leave from, and which station does it arrive at?", ""], ["That works great for me.", ""], ["That is correct.", ""], ["Thank you for your assistance.", ""], ["No, thank you. That'll be all.", ""], ["That sounds perfect.", ""], ["Yes, that's correct.", ""], ["No, that is all.", ""], ["That is perfect.", ""], ["What is the destination bus station?", ""], ["That's perfect for me.", ""], ["to_location I want to go to Fresno.", "to_location Fresno"], ["No, that will be all. Thank you.", ""], ["Yes that's right.", ""], ["Thank you for your help.", ""], ["Thank you so much for your help.", ""], ["No, not right now. That's all I need.", ""], ["No. Thank you for your help.", ""], ["Yes that is correct.", ""], ["Yes that works.", ""], ["Thank you, that's all I need.", ""], ["Yes, that would be great.", ""], ["No, that's it.", ""], ["No, that is all. Thanks.", ""], ["Ok, that sounds good.", ""], ["Correct.", ""], ["Sounds perfect.", ""], ["category I like Concert events.", ""], ["Yes, that's great.", ""], ["Can you help me find an event?", ""], ["Not at the moment.", ""], ["That sounds amazing.", ""], ["No, thank you for your help.", ""], ["That sounds interesting.", ""], ["That's perfect.", ""], ["Nope, thanks for your help.", ""], ["Can you help me find some interesting events?", ""], ["No, not at the moment.", ""], ["What's the address of the venue?", ""], ["I am looking for some interesting events.", ""], ["Can you find anything else?", ""], ["No, you've been very helpful.", ""], ["What is the address of the venue?", ""], ["Sounds good, but could you search for some different events?", ""], ["What's the address?", ""], ["What is the venue's address?", ""], ["No, not now.", ""], ["Thank you.", ""], ["yes.", ""], ["Can you help me find interesting events?", ""], ["Perfect.", ""], ["That's great.", ""], ["Perfect, thank you.", ""], ["No, not at this time.", ""], ["I'd like to reserve tickets to an event.", ""], ["No, that will be all.", ""], ["Yes, that is perfect.", ""], ["Awesome, thanks.", ""], ["Yes, perfect.", ""], ["No that will be all.", ""], ["Nope, that's it.", ""], ["Thanks so much.", ""], ["Can you help me reserve tickets for an event?", ""], ["Yes that's perfect.", ""], ["Thank you very much.", ""], ["No, thanks for your help.", ""], ["No, that's all thanks.", ""], ["Thanks a lot for your help.", ""], ["Thanks a bunch.", ""], ["Thank you very much for your help.", ""], ["No, Thank you very much for your help.", ""], ["Yes that's great.", ""], ["No, thanks again for the help.", ""], ["No. Thank you.", ""], ["Thanks, that's all I need.", ""], ["Yes, that sounds good.", ""], ["No, that's all I need.", ""], ["Thanks for everything, that's all I needed.", ""], ["category I like music events.", ""], ["No, that is all. Thank you.", ""], ["category I like Match events.", ""], ["Yes, 3 please.", ""], ["What is the address?", ""], ["Yes, Please buy tickets for me.", ""], ["Yes, that's it.", ""], ["No, that's all.", ""], ["That sounds wonderful.", ""], ["Yes that's correct.", ""], ["Can you tell me the address of the venue?", ""], ["I need 4 tickets.", ""], ["I want 2 tickets.", ""], ["Can you tell me the address?", ""], ["No, thank you so much.", ""], ["number_of_seats I would like to buy 4 tickets.", ""], ["I want to find an apartment.", ""], ["Yes, that apartment sounds good.", ""], ["Yes, I would.", ""], ["Thanks, that is all I need.", ""], ["Does the apartment come furnished?", ""], ["Thank you so much.", ""], ["Yes that apartment sounds good.", ""], ["Is the apartment furnished?", ""], ["No. Thanks a lot.", ""], ["Yes that sounds great.", ""], ["Do you know of any other options?", ""], ["Any other apartments?", ""], ["What else can you find?", ""], ["Great, thank you.", ""], ["I am looking for an apartment.", ""], ["I'd like to find an apartment.", ""], ["That apartment sounds good.", ""], ["Thanks, that will be all.", ""], ["Thanks a lot. That's all I need.", ""], ["I'm looking for an apartment.", ""], ["Yes, that sounds great.", ""], ["Thanks, that's all.", ""], ["I need to find an apartment.", ""], ["Is this property a phone number?", ""], ["Can you find me other apartments?", ""], ["Yes that sounds good.", ""], ["Yes that sounds perfect.", ""], ["Are there other apartments?", ""], ["Is it furnished? What's the phone number?", ""], ["That one sounds good.", ""], ["Yes that is great.", ""], ["Can you find me some other apartments?", ""], ["Yes, I do.", ""], ["I want to find a furnished apartment.", ""], ["Can you help me find an apartment?", ""], ["Thank you so much. That will be all for today.", ""], ["Anything else?", ""], ["Is it furnished?", ""], ["That's right.", ""], ["What is the phone number?", ""], ["Thank you, that is all I needed.", ""], ["Can you find me an apartment?", ""], ["Do they allow pets?", ""], ["I would like to find an apartment.", ""], ["Help me find an apartment.", ""], ["Sounds great to me.", ""], ["Find me an apartment.", ""], ["That apartment sounds great.", ""], ["I am looking for a new apartment.", ""], ["visit_date March 2nd.", "visit_date March 2nd"], ["Is it a furnished apartment?", ""], ["Is the apartment already furnished?", ""], ["Are pets allowed?", ""], ["I need an apartment.", ""], ["area I would like an apartment in Fremont.", "area Fremont"], ["What is the property's phone number?", ""], ["Are there any other apartments?", ""], ["Yes, That sounds great to me.", ""], ["No. That will be all. Thank you.", ""], ["Can you find something else?", ""], ["Find me some other apartments.", ""], ["What other apartments are available?", ""], ["No thanks so much.", ""], ["How much?", ""], ["Yes please do.", ""], ["How much will everything cost?", ""], ["I need a rental car.", ""], ["How much is the total?", ""], ["That will work.", ""], ["What will the total cost be?", ""], ["I want to find a rental car.", ""], ["What else is available?", ""], ["How much will it cost?", ""], ["I am looking for a rental car.", ""], ["I need to find a rental car.", ""], ["What will it cost?", ""], ["What is the total cost?", ""], ["How much is it?", ""], ["That is great.", ""], ["Anything else available?", ""], ["I'm looking to rent a car.", ""], ["How much does it cost?", ""], ["How much will that cost?", ""], ["what is the total cost?", ""]]